pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// bl602_demo_at_text_0005.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 2305032A: Register word32 bt_get_name()
// Called from:
//      bt_mesh_proxy_adv_start
//      read_name
//      ble_get_device_name
//      ble_start_advertise
word32 bt_get_name()
{
	return 1107353112;
}

// 23050334: Register Eq_2 bt_id_create(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_64398) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out Eq_284854 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bt_setup_id_addr
Eq_2 bt_id_create(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_64398 * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, union Eq_284854 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	Eq_284854 s1_131;
	Eq_2 s3_115 = a0;
	Eq_2 s0_17 = a1;
	if (a0 != 0x00)
	{
		word32 a5_279;
		word32 a1_278;
		if (memcmp(a0, fp + -40, 0x07, out a1_278, out a2, out a3, out a4, out a5_279) == 0x00)
			goto l23050346;
		if ((word32) *a0 == 0x01 && ((word32) (*((word32) a0 + 6)) & 0x00C0) == 0x00C0)
		{
			int32 a0_35;
			word32 s1_297;
			s0_17 = id_find(a0, out s1_297, out a0_35, out a2, out a3, out a4, out s3_115);
			s1_131.u0 = -69;
			if (a0_35 < 0x00)
				goto l23050346;
		}
		else
		{
			word32 a5_284;
			word32 a7_285;
			word32 s2_286;
			word32 s4_288;
			word32 s3_287;
			word32 s6_290;
			word32 s5_289;
			word32 s7_291;
			word32 a2_283;
			word32 a1_282;
			word32 a0_281;
			word32 s1_280;
			word32 s8_292;
			word32 s9_293;
			word32 s10_294;
			word32 s11_295;
			word32 t4_296;
			ra = printf(ra, &g_t230BB10C, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_280, out a0_281, out a1_282, out a2_283, out a3, out a4, out a5_284, out a7_285, out s2_286, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295, out t4_296);
			s1_131.u0 = ~0x15;
		}
l2305034A:
		0x00 = (int8) dwArg0128;
		a0Out = s1_131;
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
	else
	{
l23050346:
		s1_131.u0 = ~0x15;
		if (s0_17 == 0x00)
		{
			word32 s2_84 = (word32) g_b4200DD67;
			s1_131.u0 = ~0x0B;
			if (s2_84 != 0x01)
			{
				g_b4200DD67 = (byte) (s2_84 + 1);
				if (s2_84 == 0x00 && atomic_test_bit(0x4200DDCC, 0x01, out a2) == 0x00)
				{
					word32 s8_277;
					word32 s4_276;
					word32 a5_275;
					word32 a4_274;
					word32 a3_273;
					word32 a1_272;
					word32 a0_271;
					atomic_or(0x4200DDCC, 0x08, a3, a4, mstatus, out a0_271, out a1_272, out a2, out a3_273, out a4_274, out a5_275, out s4_276, out s8_277);
				}
				id_create.isra.25(s2_84, s3_115, a2);
			}
		}
		goto l2305034A;
	}
}

// 230503EA: Register Eq_2 bt_setup_id_addr(Register Eq_2 ra, Register (ptr32 Eq_64398) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      init_work
Eq_2 bt_setup_id_addr(Eq_2 ra, struct Eq_64398 * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a0_11;
	ptr32 a3_14;
	ptr32 a4_15;
	Eq_2 ra_18 = bt_id_create(ra, 0x00, 0x00, a2, a3, a4, mstatus, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0128, out a0_11, out a3_14, out a4_15);
	a0Out = a0_11;
	a3Out = a3_14;
	a4Out = a4_15;
	return ra_18;
}

// 230503F2: void init_work(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack word32 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void init_work(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, word32 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	word16 wLoc12_2389 = SLICE(dwLoc14, word16, 16);
	Eq_2 dwLoc1C_1521 = s0;
	word16 wLoc1A_2234 = SLICE(s0, word16, 16);
	Eq_2 a0_13;
	Eq_2 a4_106;
	Eq_2 a3_105;
	Eq_2 s1_1003;
	Eq_2 s2_1004;
	ptr32 mstatus_1000;
	Eq_2 ra_1001 = bl_onchiphci_interface_init(ra, s0, mstatus, dwLoc30, dwLoc2C, dwArgC8, dwArg0108, out s1_1003, out a0_13, out a3_105, out a4_106, out s2_1004, out mstatus_1000);
	Eq_2 s0_1018 = a0_13;
	if (a0_13 == 0x00)
	{
		ui32 a5_37 = g_ptr4200DE14->dw0008;
		Eq_2 a5_107 = a5_37 & 0x01;
		if ((a5_37 & 0x01) == 0x00)
		{
			Eq_2 a3_47;
			struct Eq_285149 * a5_49;
			word32 s0_2709;
			word32 s11_2718;
			word32 s7_2714;
			word32 s8_2715;
			word32 s4_2712;
			word32 a2_2710;
			word32 s3_2711;
			word32 s6_2713;
			word32 s9_2716;
			word32 s10_2717;
			Eq_2 a0_44;
			Eq_2 a1_45;
			Eq_2 a4_101;
			ra_1001 = bt_hci_cmd_send_sync(ra_1001, a0_13, 0x00FFFC03, 0x00, a3_105, a4_106, a5_37 & 0x01, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2709, out s1_1003, out a0_44, out a1_45, out a2_2710, out a3_47, out a4_101, out a5_49, out s2_1004, out s3_2711, out s4_2712, out s5, out s6_2713, out s7_2714, out s8_2715, out s9_2716, out s10_2717, out s11_2718, out mstatus_1000);
			s0_1018 = a0_44;
			if (a0_44 != 0x00)
				goto l23050590;
			if ((word32) *a5_49->ptr0008 == 0x00)
			{
				g_t4200F484.u0 = 0x00;
				Eq_2 a0_81 = atomic_get((word32) s1_1003 + 0x006C);
				word32 s8_2730;
				word32 a3_2728;
				word32 s4_2729;
				atomic_set(s1_1003, a0_81 & 0x0D, a3_47, a4_101, mstatus_1000, out a0_44, out a3_2728, out a4_101, out s4_2729, out s8_2730);
				a1_45 = a0_81 & 0x0D;
			}
			word32 s3_2724;
			word32 s4_2725;
			word32 a1_2721;
			word32 s1_2719;
			word32 a0_2720;
			word32 a2_2722;
			word32 s2_2723;
			word32 s6_2726;
			word32 s8_2727;
			ra_1001 = net_buf_unref(ra_1001, s1_1003, a0_44, a1_45, a4_101, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_1018, out s1_2719, out a0_2720, out a1_2721, out a2_2722, out a3_105, out a4_106, out a5_107, out s2_2723, out s3_2724, out s4_2725, out s5, out s6_2726, out s8_2727, out mstatus_1000);
		}
		Eq_2 a0_140;
		word32 a1_141;
		word32 s10_2707;
		word32 s6_2703;
		word32 s7_2704;
		word32 s8_2705;
		word32 s9_2706;
		word32 s3_2701;
		word32 s4_2702;
		word32 a5_2700;
		word32 a4_2699;
		word32 s0_2696;
		word32 s11_2708;
		word32 a2_2697;
		word32 a3_2698;
		ra_1001 = bt_hci_cmd_send_sync(ra_1001, s0_1018, 0x01000003, 0x00, a3_105, a4_106, a5_107, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2696, out s1_1003, out a0_140, out a1_141, out a2_2697, out a3_2698, out a4_2699, out a5_2700, out s2_1004, out s3_2701, out s4_2702, out s5, out s6_2703, out s7_2704, out s8_2705, out s9_2706, out s10_2707, out s11_2708, out mstatus_1000);
		s0_1018 = a0_140;
		if (a0_140 != 0x00)
			goto l23050590;
		Eq_2 a4_175;
		Eq_2 a1_178;
		word32 a3_2732;
		word32 a6_2734;
		word32 a2_2731;
		word32 a5_2733;
		word32 a7_2735;
		memcpy((word32) s1_1003 + 24, a1_141 + 0x01, 0x08, out a1_178, out a2_2731, out a3_2732, out a4_175, out a5_2733, out a6_2734, out a7_2735);
		Eq_2 a3_192;
		Eq_2 a4_193;
		Eq_2 a5_194;
		ptr32 mstatus_197;
		Eq_2 s0_199;
		word32 s2_201;
		Eq_2 s5_204;
		Eq_2 a0_217;
		Eq_2 a1_218;
		struct Eq_285287 * a5_222;
		word32 s11_2755;
		word32 s10_2754;
		word32 a1_2738;
		word32 a0_2737;
		word32 a2_2739;
		word32 s3_2740;
		word32 s8_2743;
		word32 s0_2744;
		word32 s4_2741;
		word32 s6_2742;
		word32 a4_2747;
		word32 a3_2746;
		word32 a2_2745;
		word32 s3_2748;
		word32 s4_2749;
		word32 s6_2750;
		word32 s7_2751;
		word32 s8_2752;
		word32 s9_2753;
		word32 s1_2736;
		ra_1001 = bt_hci_cmd_send_sync(net_buf_unref(ra_1001, s1_1003, (word32) s1_1003 + 24, a1_178, a4_175, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_199, out s1_2736, out a0_2737, out a1_2738, out a2_2739, out a3_192, out a4_193, out a5_194, out s2_201, out s3_2740, out s4_2741, out s5_204, out s6_2742, out s8_2743, out mstatus_197), s0_199, s2_201 + 1, 0x00, a3_192, a4_193, a5_194, s5_204, mstatus_197, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2744, out s1_1003, out a0_217, out a1_218, out a2_2745, out a3_2746, out a4_2747, out a5_222, out s2_1004, out s3_2748, out s4_2749, out s5, out s6_2750, out s7_2751, out s8_2752, out s9_2753, out s10_2754, out s11_2755, out mstatus_1000);
		s0_1018 = a0_217;
		if (a0_217 == 0x00)
		{
			Eq_2 a0_248 = a5_222->t0008;
			*((word32) s1_1003 + 16) = (byte) (word32) a5_222->b0001;
			*((word32) s1_1003 + 18) = (word16) ((word32) a5_222->b0003 << 8 | (word32) a5_222->b0002);
			*((word32) s1_1003 + 0x0011) = (byte) (word32) a5_222->b0004;
			*((word32) s1_1003 + 20) = (word16) ((word32) a5_222->t0008 << 8 | (word32) a5_222->b0007);
			Eq_2 a4_263 = (word32) a5_222->b0005;
			*((word32) s1_1003 + 22) = (word16) ((word32) a5_222->b0006 << 8 | a4_263);
			word32 s1_279;
			word32 s2_280;
			word32 a1_2757;
			word32 a2_2758;
			word32 s3_2759;
			word32 s6_2761;
			word32 s8_2762;
			word32 s4_2760;
			word32 a0_2756;
			Eq_2 s0_278;
			Eq_2 s5_283;
			Eq_2 a5_273;
			ptr32 mstatus_276;
			Eq_2 a4_272;
			Eq_2 a3_271;
			Eq_2 ra_277 = net_buf_unref(ra_1001, s1_1003, a0_248, a1_218, a4_263, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_278, out s1_279, out a0_2756, out a1_2757, out a2_2758, out a3_271, out a4_272, out a5_273, out s2_280, out s3_2759, out s4_2760, out s5_283, out s6_2761, out s8_2762, out mstatus_276);
			word32 a2_2763;
			if (atomic_test_bit(s1_279 + 0x006C, 0x03, out a2_2763) == 0x00)
			{
				Eq_2 a0_301;
				word32 s10_2789;
				word32 s11_2790;
				word32 s0_2777;
				word32 a1_2778;
				word32 a2_2779;
				word32 a3_2780;
				word32 a4_2781;
				word32 a5_2782;
				word32 s3_2783;
				word32 s4_2784;
				word32 s6_2785;
				word32 s8_2787;
				word32 s9_2788;
				word32 s7_2786;
				ra_1001 = bt_hci_cmd_send_sync(ra_277, s0_278, s2_280 + 9, 0x00, a3_271, a4_272, a5_273, s5_283, mstatus_276, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2777, out s1_1003, out a0_301, out a1_2778, out a2_2779, out a3_2780, out a4_2781, out a5_2782, out s2_1004, out s3_2783, out s4_2784, out s5, out s6_2785, out s7_2786, out s8_2787, out s9_2788, out s10_2789, out s11_2790, out mstatus_1000);
				s0_1018 = a0_301;
				if (a0_301 != 0x00)
					goto l23050590;
				dwLoc28.u0 = 0x00;
				word32 a2_2791;
				word32 a5_2793;
				word32 a3_2792;
				Eq_2 a1_343;
				Eq_2 a4_342;
				Eq_2 a0_339 = memcmp((word32) a0_301 + 1, fp + -32, 0x06, out a1_343, out a2_2791, out a3_2792, out a4_342, out a5_2793);
				dwLoc1C_1521 = SEQ(wLoc1A_2234, 0x00);
				if (a0_339 != 0x00)
				{
					word16 wLoc14_1627 = (word16) (word32) *((word32) *a4_342 + 4);
					dwLoc24 = a4_342;
					word32 a5_2805;
					word32 a2_2803;
					word32 a3_2804;
					a0_339 = memcmp((word32) a0_301 + 1, fp + -24, 0x06, out a1_343, out a2_2803, out a3_2804, out a4_342, out a5_2805);
					dwLoc14 = SEQ(wLoc12_2389, wLoc14_1627);
					if (a0_339 != 0x00)
					{
						word32 a3_2807;
						word32 a5_2808;
						word32 a6_2809;
						word32 a7_2810;
						word32 a2_2806;
						memcpy((word32) s1_1003 + 1, (word32) a0_301 + 1, 0x06, out a1_343, out a2_2806, out a3_2807, out a4_342, out a5_2808, out a6_2809, out a7_2810);
						*s1_1003 = 0x00;
						((word32) s1_1003 + 7)->u0 = 0x01;
						a0_339 = (word32) s1_1003 + 1;
					}
				}
				word32 s1_2794;
				word32 a0_2795;
				word32 a1_2796;
				word32 a2_2797;
				word32 s2_2798;
				word32 s3_2799;
				word32 s4_2800;
				word32 s6_2801;
				word32 s8_2802;
				ra_277 = net_buf_unref(ra_1001, s1_1003, a0_339, a1_343, a4_342, mstatus_1000, dwLoc30, dwLoc2C, 0x00, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_278, out s1_2794, out a0_2795, out a1_2796, out a2_2797, out a3_271, out a4_272, out a5_273, out s2_2798, out s3_2799, out s4_2800, out s5_283, out s6_2801, out s8_2802, out mstatus_276);
			}
			Eq_2 a0_425;
			word32 a1_426;
			word32 s8_2773;
			word32 s9_2774;
			word32 s10_2775;
			word32 s11_2776;
			word32 s7_2772;
			word32 s6_2771;
			word32 s0_2764;
			word32 a2_2765;
			word32 a3_2766;
			word32 a4_2767;
			word32 a5_2768;
			word32 s3_2769;
			word32 s4_2770;
			ra_1001 = bt_hci_cmd_send_sync(ra_277, s0_278, 0x01000002, 0x00, a3_271, a4_272, a5_273, s5_283, mstatus_276, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2764, out s1_1003, out a0_425, out a1_426, out a2_2765, out a3_2766, out a4_2767, out a5_2768, out s2_1004, out s3_2769, out s4_2770, out s5, out s6_2771, out s7_2772, out s8_2773, out s9_2774, out s10_2775, out s11_2776, out mstatus_1000);
			s0_1018 = a0_425;
			if (a0_425 != 0x00)
				goto l23050590;
			Eq_2 a4_460;
			Eq_2 a1_463;
			word32 a2_2811;
			word32 a3_2812;
			word32 a5_2813;
			word32 a6_2814;
			word32 a7_2815;
			memcpy((word32) s1_1003 + 32, a1_426 + 0x01, 64, out a1_463, out a2_2811, out a3_2812, out a4_460, out a5_2813, out a6_2814, out a7_2815);
			Eq_2 a3_477;
			Eq_2 a4_478;
			Eq_2 s0_484;
			struct Eq_285670 * s1_485;
			Eq_2 s5_489;
			word32 s3_2821;
			word32 s4_2822;
			word32 s6_2823;
			word32 s8_2824;
			word32 a0_2816;
			word32 a1_2817;
			word32 a2_2818;
			word32 a5_2819;
			word32 s2_2820;
			Eq_2 ra_483 = net_buf_unref(ra_1001, s1_1003, (word32) s1_1003 + 32, a1_463, a4_460, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_484, out s1_485, out a0_2816, out a1_2817, out a2_2818, out a3_477, out a4_478, out a5_2819, out s2_2820, out s3_2821, out s4_2822, out s5_489, out s6_2823, out s8_2824, out mstatus_1000);
			ui32 a5_499 = (word32) s1_485->b001C;
			if ((a5_499 & 64) == 0x00)
			{
				word32 a3_2841;
				word32 a4_2842;
				word32 a5_2843;
				word32 s3_2845;
				word32 s4_2846;
				word32 s6_2847;
				word32 s7_2848;
				word32 s8_2849;
				word32 s9_2850;
				word32 s10_2851;
				word32 s11_2852;
				word32 t4_2853;
				word32 a7_2844;
				word32 a2_2840;
				word32 a0_2838;
				word32 a1_2839;
				ra_1001 = printf(ra_483, &g_t230BB470, a3_477, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1003, out a0_2838, out a1_2839, out a2_2840, out a3_2841, out a4_2842, out a5_2843, out a7_2844, out s2_1004, out s3_2845, out s4_2846, out s5, out s6_2847, out s7_2848, out s8_2849, out s9_2850, out s10_2851, out s11_2852, out t4_2853);
				s0_1018.u0 = ~0x12;
				goto l23050590;
			}
			Eq_2 a0_505;
			word32 a1_506;
			word32 s11_2837;
			word32 s0_2825;
			word32 a2_2826;
			word32 a3_2827;
			word32 a4_2828;
			word32 a5_2829;
			word32 s3_2830;
			word32 s4_2831;
			word32 s6_2832;
			word32 s7_2833;
			word32 s9_2835;
			word32 s10_2836;
			word32 s8_2834;
			ra_1001 = bt_hci_cmd_send_sync(ra_483, s0_484, 0x02000003, 0x00, a3_477, a4_478, a5_499 & 64, s5_489, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2825, out s1_1003, out a0_505, out a1_506, out a2_2826, out a3_2827, out a4_2828, out a5_2829, out s2_1004, out s3_2830, out s4_2831, out s5, out s6_2832, out s7_2833, out s8_2834, out s9_2835, out s10_2836, out s11_2837, out mstatus_1000);
			s0_1018 = a0_505;
			if (a0_505 != 0x00)
				goto l23050590;
			Eq_2 a4_540;
			Eq_2 a1_543;
			word32 a6_2857;
			word32 a7_2858;
			word32 a3_2855;
			word32 a5_2856;
			word32 a2_2854;
			memcpy((word32) s1_1003 + 112, a1_506 + 0x01, 0x08, out a1_543, out a2_2854, out a3_2855, out a4_540, out a5_2856, out a6_2857, out a7_2858);
			Eq_2 a3_557;
			Eq_2 a4_558;
			Eq_2 a5_559;
			ptr32 mstatus_562;
			Eq_2 s0_564;
			word32 s2_566;
			Eq_2 s5_569;
			word32 s8_2875;
			word32 s9_2876;
			word32 s10_2877;
			word32 s11_2878;
			word32 s7_2874;
			word32 s6_2873;
			word32 s1_2859;
			word32 a1_2861;
			word32 a2_2862;
			word32 s3_2863;
			word32 s4_2864;
			word32 s6_2865;
			word32 s8_2866;
			word32 s0_2867;
			word32 a2_2868;
			word32 a3_2869;
			word32 s3_2871;
			word32 s4_2872;
			word32 a5_2870;
			word32 a0_2860;
			Eq_2 a0_582;
			Eq_2 a1_583;
			Eq_2 a4_586;
			ra_1001 = bt_hci_cmd_send_sync(net_buf_unref(ra_1001, s1_1003, (word32) s1_1003 + 112, a1_543, a4_540, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_564, out s1_2859, out a0_2860, out a1_2861, out a2_2862, out a3_557, out a4_558, out a5_559, out s2_566, out s3_2863, out s4_2864, out s5_569, out s6_2865, out s8_2866, out mstatus_562), s0_564, s2_566 + 2, 0x00, a3_557, a4_558, a5_559, s5_569, mstatus_562, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2867, out s1_1003, out a0_582, out a1_583, out a2_2868, out a3_2869, out a4_586, out a5_2870, out s2_1004, out s3_2871, out s4_2872, out s5, out s6_2873, out s7_2874, out s8_2875, out s9_2876, out s10_2877, out s11_2878, out mstatus_1000);
			s0_1018 = a0_582;
			if (a0_582 == 0x00)
			{
				Eq_2 a3_615 = (word32) *((word32) a4_586 + 1);
				Eq_2 a5_617 = (word32) *((word32) a4_586 + 2) << 8 | a3_615;
				*((word32) s1_1003 + 0x0080) = (word16) a5_617;
				if (a5_617 != 0x00)
				{
					Eq_2 a2_619 = (word32) *((word32) a4_586 + 3);
					word32 a3_2888;
					word32 a5_2889;
					word32 s2_2890;
					word32 s3_2891;
					word32 s4_2892;
					word32 s5_2893;
					word32 s6_2894;
					word32 s8_2896;
					word32 s7_2895;
					ra_1001 = k_sem_init(ra_1001, a0_582, (word32) s1_1003 + 0x0084, a2_619, a2_619, a3_615, a4_586, a5_617, mstatus_1000, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArgF8, out s1_1003, out a0_582, out a1_583, out a3_2888, out a4_586, out a5_2889, out s2_2890, out s3_2891, out s4_2892, out s5_2893, out s6_2894, out s7_2895, out s8_2896);
				}
				word32 a5_2882;
				word32 s2_2883;
				word32 s3_2884;
				word32 s6_2886;
				word32 s8_2887;
				word32 s4_2885;
				word32 a0_2879;
				word32 a1_2880;
				word32 a2_2881;
				Eq_2 a4_659;
				Eq_2 a3_658;
				ra_1001 = net_buf_unref(ra_1001, s1_1003, a0_582, a1_583, a4_586, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_1018, out s1_1003, out a0_2879, out a1_2880, out a2_2881, out a3_658, out a4_659, out a5_2882, out s2_2883, out s3_2884, out s4_2885, out s5, out s6_2886, out s8_2887, out mstatus_1000);
				ui32 a5_680 = (word32) *((word32) s1_1003 + 28);
				if ((a5_680 & 32) == 0x00)
				{
					Eq_2 a3_687;
					Eq_2 a4_688;
					word32 a1_2898;
					word32 a5_2899;
					word32 s3_2900;
					word32 s6_2902;
					word32 s8_2903;
					word32 s4_2901;
					word32 s0_2897;
					ra_1001 = bt_hci_cmd_create(ra_1001, 0x02, a3_658, a4_659, a5_680 & 32, mstatus_1000, ra, dwArg78, dwArgB8, dwArgD8, out s0_2897, out s1_1003, out a1_2898, out a3_687, out a4_688, out a5_2899, out s2_1004, out s3_2900, out s4_2901, out s5, out s6_2902, out s8_2903, out mstatus_1000);
					if (false)
						goto l230507FE;
					word32 a5_2957;
					word32 a1_2956;
					Eq_2 a0_712 = net_buf_simple_add(0x00FFFC75, 0x02, a4_688, out a1_2956, out a5_2957);
					*a0_712 = 0x01;
					*((word32) a0_712 + 1) = 0x00;
					Eq_2 a0_721;
					word32 s11_2969;
					word32 s0_2958;
					word32 a1_2959;
					word32 a2_2960;
					word32 a5_2961;
					word32 s3_2962;
					word32 s4_2963;
					word32 s6_2964;
					word32 s7_2965;
					word32 s9_2967;
					word32 s10_2968;
					word32 s8_2966;
					ra_1001 = bt_hci_cmd_send_sync(ra_1001, 0x00FFFC6D, (word32) s2_1004 - 0x0393, 0x00FFFC6D, a3_687, a4_688, 0x01, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2958, out s1_1003, out a0_721, out a1_2959, out a2_2960, out a3_658, out a4_659, out a5_2961, out s2_1004, out s3_2962, out s4_2963, out s5, out s6_2964, out s7_2965, out s8_2966, out s9_2967, out s10_2968, out s11_2969, out mstatus_1000);
					s0_1018 = a0_721;
					if (a0_721 != 0x00)
						goto l23050590;
				}
				ui32 a5_753 = (word32) *((word32) s1_1003 + 60);
				if ((a5_753 & 0x08) != 0x00)
				{
					Eq_2 a0_766;
					Eq_2 a1_767;
					struct Eq_286021 * a5_771;
					word32 s9_2913;
					word32 s10_2914;
					word32 s11_2915;
					word32 s0_2904;
					word32 a2_2905;
					word32 a3_2906;
					word32 a4_2907;
					word32 s3_2908;
					word32 s4_2909;
					word32 s7_2911;
					word32 s8_2912;
