pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
					word32 s6_2910;
					ra_1001 = bt_hci_cmd_send_sync(ra_1001, s0_1018, 0x0200001C, 0x00, a3_658, a4_659, a5_753 & 0x08, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2904, out s1_1003, out a0_766, out a1_767, out a2_2905, out a3_2906, out a4_2907, out a5_771, out s2_1004, out s3_2908, out s4_2909, out s5, out s6_2910, out s7_2911, out s8_2912, out s9_2913, out s10_2914, out s11_2915, out mstatus_1000);
					s0_1018 = a0_766;
					if (a0_766 != 0x00)
						goto l23050590;
					Eq_2 a0_797 = a5_771->t0008;
					Eq_2 a4_808 = (word32) a5_771->b0004 << 24 | (((word32) a5_771->b0002 << 8 | (word32) a5_771->b0001) | (word32) a5_771->b0003 << 16);
					ui32 a2_811 = (word32) a5_771->b0005 | (word32) a5_771->b0006 << 8;
					ui32 a3_812 = (word32) a5_771->b0007;
					ui32 a5_813 = (word32) a5_771->t0008;
					*((word32) a4_808 + 0x0078) = s1_1003;
					(a5_813 << 24 | (a3_812 << 16 | a2_811))->t007C = s1_1003;
					word32 a1_2917;
					word32 a2_2918;
					word32 a5_2919;
					word32 s2_2920;
					word32 s3_2921;
					word32 s4_2922;
					word32 s6_2923;
					word32 s8_2924;
					word32 a0_2916;
					ra_1001 = net_buf_unref(ra_1001, s1_1003, a0_797, a1_767, a4_808, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_1018, out s1_1003, out a0_2916, out a1_2917, out a2_2918, out a3_658, out a4_659, out a5_2919, out s2_2920, out s3_2921, out s4_2922, out s5, out s6_2923, out s8_2924, out mstatus_1000);
				}
				ui32 a5_847 = (word32) *((word32) s1_1003 + 112);
				Eq_2 a5_848 = a5_847 & 64;
				if ((a5_847 & 64) != 0x00)
				{
					Eq_2 a0_860;
					Eq_2 a1_861;
					Eq_2 a4_864;
					struct Eq_286193 * a5_865;
					word32 s10_2945;
					word32 s11_2946;
					word32 s0_2936;
					word32 a2_2937;
					word32 a3_2938;
					word32 s3_2939;
					word32 s4_2940;
					word32 s6_2941;
					word32 s8_2943;
					word32 s9_2944;
					word32 s7_2942;
					ra_1001 = bt_hci_cmd_send_sync(ra_1001, s0_1018, 0x0200002A, 0x00, a3_658, a4_659, a5_847 & 64, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2936, out s1_1003, out a0_860, out a1_861, out a2_2937, out a3_2938, out a4_864, out a5_865, out s2_1004, out s3_2939, out s4_2940, out s5, out s6_2941, out s7_2942, out s8_2943, out s9_2944, out s10_2945, out s11_2946, out mstatus_1000);
					s0_1018 = a0_860;
					if (a0_860 != 0x00)
						goto l23050590;
					Eq_2 a0_891 = a5_865->t0008;
					*((word32) s1_1003 + 144) = (byte) (word32) a5_865->b0001;
					word32 s4_2953;
					word32 s6_2954;
					word32 s8_2955;
					word32 s3_2952;
					word32 a1_2949;
					word32 a2_2950;
					word32 s2_2951;
					word32 s1_2947;
					word32 a0_2948;
					ra_1001 = net_buf_unref(ra_1001, s1_1003, a0_891, a1_861, a4_864, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_1018, out s1_2947, out a0_2948, out a1_2949, out a2_2950, out a3_658, out a4_659, out a5_848, out s2_2951, out s3_2952, out s4_2953, out s5, out s6_2954, out s8_2955, out mstatus_1000);
				}
				Eq_2 a0_932;
				Eq_2 a1_933;
				Eq_2 a4_936;
				struct Eq_286153 * a5_937;
				word32 s4_2929;
				word32 s6_2930;
				word32 s7_2931;
				word32 s9_2933;
				word32 s10_2934;
				word32 s11_2935;
				word32 s8_2932;
				word32 s0_2925;
				word32 a3_2927;
				word32 s3_2928;
				word32 a2_2926;
				ra_1001 = bt_hci_cmd_send_sync(ra_1001, s0_1018, 0x0200000F, 0x00, a3_658, a4_659, a5_848, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2925, out s1_1003, out a0_932, out a1_933, out a2_2926, out a3_2927, out a4_936, out a5_937, out s2_1004, out s3_2928, out s4_2929, out s5, out s6_2930, out s7_2931, out s8_2932, out s9_2933, out s10_2934, out s11_2935, out mstatus_1000);
				s0_1018 = a0_932;
				if (a0_932 != 0x00)
					goto l23050590;
				Eq_2 a0_963 = a5_937->t0008;
				*((word32) s1_1003 + 0x0092) = (byte) (word32) a5_937->b0001;
				Eq_2 a3_969;
				Eq_2 a4_970;
				Eq_2 a5_971;
				ptr32 mstatus_974;
				word32 s2_978;
				Eq_2 a4_996;
				word32 s8_2987;
				word32 s6_2986;
				word32 s4_2985;
				word32 s0_2970;
				word32 s1_2971;
				word32 a1_2973;
				word32 a2_2974;
				word32 s3_2975;
				word32 s4_2976;
				word32 s5_2977;
				word32 s6_2978;
				word32 s8_2979;
				word32 s0_2980;
				word32 a1_2981;
				word32 a5_2983;
				word32 s3_2984;
				word32 a3_2982;
				word32 a0_2972;
				ra_1001 = bt_hci_cmd_create(net_buf_unref(ra_1001, s1_1003, a0_963, a1_933, a4_936, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_2970, out s1_2971, out a0_2972, out a1_2973, out a2_2974, out a3_969, out a4_970, out a5_971, out s2_978, out s3_2975, out s4_2976, out s5_2977, out s6_2978, out s8_2979, out mstatus_974), 0x08, a3_969, a4_970, a5_971, mstatus_974, ra, dwArg78, dwArgB8, dwArgD8, out s0_2980, out s1_1003, out a1_2981, out a3_2982, out a4_996, out a5_2983, out s2_1004, out s3_2984, out s4_2985, out s5, out s6_2986, out s8_2987, out mstatus_1000);
				if (s2_978 != 0x01)
				{
					word32 a5_2989;
					word32 a1_2988;
					Eq_2 a0_1021 = net_buf_simple_add(s2_978 + 0x09, 0x08, a4_996, out a1_2988, out a5_2989);
					ui32 a4_1024 = (word32) *((word32) s1_1003 + 112);
					int32 a3_1026 = 0x0202;
					if ((a4_1024 & 64) == 0x00)
						a3_1026 = 0x03;
					Eq_275106 a0_1032 = a3_1026 | 44;
					if ((a4_1024 & 2) == 0x00)
						a0_1032 = a3_1026 | 0x0C;
					if ((a4_1024 & 0x01) != 0x00)
						a0_1032 |= 16;
					ui32 a4_1044 = (word32) *((word32) s1_1003 + 66);
					if ((a4_1044 & 0x06) == 0x06)
						a0_1032 |= 384;
					Eq_2 a0_1085;
					word32 s10_3000;
					word32 s11_3001;
					word32 s7_2997;
					word32 s8_2998;
					word32 s9_2999;
					word32 s6_2996;
					word32 s4_2995;
					word32 s3_2994;
					word32 a5_2993;
					word32 a2_2992;
					word32 a1_2991;
					word32 s0_2990;
					Eq_2 a4_1089;
					Eq_2 a3_1088;
					ra_1001 = bt_hci_cmd_send_sync(ra_1001, s2_978 + 1, 0x02000001, s2_978 + 1, 0x06, a4_1044 & 0x06, sys_put_le64(a0_1032, 0x00, a0_1021), s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_2990, out s1_1003, out a0_1085, out a1_2991, out a2_2992, out a3_1088, out a4_1089, out a5_2993, out s2_1004, out s3_2994, out s4_2995, out s5, out s6_2996, out s7_2997, out s8_2998, out s9_2999, out s10_3000, out s11_3001, out mstatus_1000);
					s0_1018 = a0_1085;
					if (a0_1085 == 0x00)
					{
						ui32 a5_1115 = (word32) *((word32) s1_1003 + 28);
						Eq_2 a5_1116 = a5_1115 & 32;
						if ((a5_1115 & 32) == 0x00)
						{
							a5_1116 = (word32) *((word32) s1_1003 + 0x0080);
							if (a5_1116 == 0x00)
							{
								word32 s9_3019;
								word32 s10_3020;
								word32 s11_3021;
								word32 s6_3016;
								word32 s7_3017;
								word32 s8_3018;
								word32 s0_3010;
								word32 a2_3011;
								word32 a3_3012;
								word32 s3_3014;
								word32 s4_3015;
								word32 a5_3013;
								Eq_2 a0_1122;
								Eq_2 a1_1123;
								Eq_2 a4_1126;
								ra_1001 = bt_hci_cmd_send_sync(ra_1001, a0_1085, 0x01000005, 0x00, a3_1088, a4_1089, a5_1116, s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_3010, out s1_1003, out a0_1122, out a1_1123, out a2_3011, out a3_3012, out a4_1126, out a5_3013, out s2_1004, out s3_3014, out s4_3015, out s5, out s6_3016, out s7_3017, out s8_3018, out s9_3019, out s10_3020, out s11_3021, out mstatus_1000);
								s0_1018 = a0_1122;
								if (a0_1122 != 0x00)
									goto l23050590;
								if ((word32) *((word32) s1_1003 + 0x0080) == 0x00)
								{
									Eq_2 a3_1157 = (word32) *((word32) a4_1126 + 1);
									*((word32) s1_1003 + 0x0080) = (word16) ((word32) *((word32) a4_1126 + 2) << 8 | a3_1157);
									Eq_2 a5_1162 = (word32) *((word32) a4_1126 + 4);
									Eq_2 a2_1164 = (word32) *((word32) a4_1126 + 5) << 8 | a5_1162;
									word32 s6_3039;
									word32 s7_3040;
									word32 s8_3041;
									word32 s5_3038;
									word32 s2_3035;
									word32 s3_3036;
									word32 s4_3037;
									word32 a3_3033;
									word32 a5_3034;
									ra_1001 = k_sem_init(ra_1001, a0_1122, (word32) s1_1003 + 0x0084, a2_1164, a2_1164, a3_1157, a4_1126, a5_1162, mstatus_1000, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArgF8, out s1_1003, out a0_1122, out a1_1123, out a3_3033, out a4_1126, out a5_3034, out s2_3035, out s3_3036, out s4_3037, out s5_3038, out s6_3039, out s7_3040, out s8_3041);
								}
								word32 s8_3032;
								word32 s4_3029;
								word32 s5_3030;
								word32 s6_3031;
								word32 s2_3027;
								word32 s3_3028;
								word32 a0_3024;
								word32 a1_3025;
								word32 a2_3026;
								word32 s1_3023;
								word32 s0_3022;
								ra_1001 = net_buf_unref(ra_1001, s1_1003, a0_1122, a1_1123, a4_1126, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_3022, out s1_3023, out a0_3024, out a1_3025, out a2_3026, out a3_1088, out a4_1089, out a5_1116, out s2_3027, out s3_3028, out s4_3029, out s5_3030, out s6_3031, out s8_3032, out mstatus_1000);
							}
						}
						Eq_2 a3_1236;
						Eq_2 a4_1237;
						word32 s0_3002;
						word32 a5_3004;
						word32 s2_3005;
						word32 s3_3006;
						word32 s4_3007;
						word32 s6_3008;
						word32 s8_3009;
						word32 a1_3003;
						ra_1001 = bt_hci_cmd_create(ra_1001, 0x08, a3_1088, a4_1089, a5_1116, mstatus_1000, ra, dwArg78, dwArgB8, dwArgD8, out s0_3002, out s1_1003, out a1_3003, out a3_1236, out a4_1237, out a5_3004, out s2_3005, out s3_3006, out s4_3007, out s5, out s6_3008, out s8_3009, out mstatus_1000);
						s2_1004.u0 = 0x00FFFC01;
						s0_1018.u0 = -55;
						if (false)
							goto l23050590;
						Eq_275107 a1_1270;
						Eq_275106 a0_1269;
						word32 a1_3042;
						word32 a5_3043;
						Eq_2 a0_1262 = net_buf_simple_add(0x00FFFC09, 0x08, a4_1237, out a1_3042, out a5_3043);
						if (((word32) *((word32) s1_1003 + 112) & 0x01) != 0x00)
						{
							a0_1269 = g_t230BB468;
							a1_1270 = g_t230BB46C;
						}
						else
						{
							a0_1269 = g_t230BB460;
							a1_1270 = g_t230BB464;
						}
						Eq_2 a0_1293;
						struct Eq_64398 * a2_1295;
						word32 s9_3068;
						word32 s10_3069;
						word32 s11_3070;
						word32 s6_3065;
						word32 s7_3066;
						word32 s8_3067;
						word32 s3_3063;
						word32 s4_3064;
						word32 a1_3061;
						word32 a5_3062;
						word32 s0_3060;
						Eq_2 a4_1297;
						Eq_2 a3_1296;
						ra_1001 = bt_hci_cmd_send_sync(ra_1001, -55, 0x00FFFC01, 0x00FFFC01, a3_1236, a4_1237, sys_put_le64(a0_1269, a1_1270, a0_1262), s5, mstatus_1000, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_3060, out s1_1003, out a0_1293, out a1_3061, out a2_1295, out a3_1296, out a4_1297, out a5_3062, out s2_1004, out s3_3063, out s4_3064, out s5, out s6_3065, out s7_3066, out s8_3067, out s9_3068, out s10_3069, out s11_3070, out mstatus_1000);
						s0_1018 = a0_1293;
						if (a0_1293 == 0x00)
						{
							if ((word32) *((word32) s1_1003 + 7) == 0x00)
							{
								Eq_2 a0_1324;
								ra_1001 = bt_setup_id_addr(ra_1001, a2_1295, a3_1296, a4_1297, mstatus_1000, dwArg10, dwArg14, dwArg38, dwArg5C, dwArgF8, out a0_1324, out a3_1296, out a4_1297);
								s0_1018 = a0_1324;
								if (a0_1324 != 0x00)
								{
									word32 t4_3059;
									word32 s9_3056;
									word32 s10_3057;
									word32 s11_3058;
									word32 s8_3055;
									word32 s4_3052;
									word32 s6_3053;
									word32 s7_3054;
									word32 a5_3049;
									word32 a7_3050;
									word32 s3_3051;
									word32 a4_3048;
									word32 a1_3045;
									word32 a2_3046;
									word32 a3_3047;
									word32 a0_3044;
									ra_1001 = printf(ra_1001, &g_t230BB498, a3_1296, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_1003, out a0_3044, out a1_3045, out a2_3046, out a3_3047, out a4_3048, out a5_3049, out a7_3050, out s2_1004, out s3_3051, out s4_3052, out s5, out s6_3053, out s7_3054, out s8_3055, out s9_3056, out s10_3057, out s11_3058, out t4_3059);
									goto l23050590;
								}
							}
							Eq_2 a3_1362;
							Eq_2 a4_1363;
							Eq_2 s3_1373;
							Eq_2 a0_1387;
							ra_1001 = bt_conn_init(ra_1001, s0_1018, a3_1296, a4_1297, mstatus_1000, dwLoc30, dwLoc2C, s2, dwLoc1C_1521, dwLoc18, dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0138, out s1_1003, out a0_1387, out a3_1362, out a4_1363, out s2_1004, out s3_1373, out s5, out mstatus_1000);
							s0_1018 = a0_1387;
							if (a0_1387 == 0x00)
								ra_1001 = bt_finalize_init(ra_1001, a0_1387, a3_1362, a4_1363, s2_1004, s3_1373, mstatus_1000, dwLoc30, dwLoc2C, dwLoc28, dwLoc24, s2, dwLoc1C_1521, dwLoc18, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_1018, out s1_1003, out s2_1004, out s5, out mstatus_1000);
							goto l23050590;
						}
					}
					goto l23050590;
				}
l230507FE:
				s0_1018.u0 = -55;
				goto l23050590;
			}
		}
	}
l23050590:
	Eq_2 a5_1470 = g_t4200F480;
	if (a5_1470 != 0x00)
	{
		word32 a7_1506;
		word32 s10_1507;
		word32 s11_1508;
		word32 s6_1509;
		word32 s7_1510;
		word32 s9_1511;
		word32 t4_1512;
		word32 t5_1513;
		word32 t6_1514;
		a5_1470();
	}
	0x00 = (int8) dwArg0128;
}

// 23050848: Register Eq_2 bt_addr_le_is_bonded(Register Eq_258169 a0, Register Eq_2 a1, Stack Eq_2 dwArg28, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_264735) s2Out)
// Called from:
//      disconnected_cb
//      bt_gatt_connected
//      bt_gatt_disconnected
Eq_2 bt_addr_le_is_bonded(Eq_258169 a0, Eq_2 a1, Eq_2 dwArg28, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_264735 & s2Out)
{
	ptr32 a0_17;
	struct Eq_286823 * a0_8;
	ptr32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	struct Eq_264735 * s2_15;
	word32 a2_41;
	Eq_2 s1_14 = bt_keys_find_addr(a0, a1, dwArg28, out a0_8, out a2_41, out a3_11, out a4_12, out a5_13, out s2_15);
	if (a0_8 != null)
		a0_17 = (word32) ((word32) a0_8->w000A != 0x00);
	else
		a0_17 = 0x00;
	a0Out = a0_17;
	a3Out = a3_11;
	a4Out = a4_12;
	a5Out = a5_13;
	s2Out = s2_15;
	return s1_14;
}

