pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23050864: Register Eq_2 bt_le_adv_start_internal(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg010C, Stack ptr32 dwArg0164, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_le_adv_start
Eq_2 bt_le_adv_start_internal(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a5, Eq_2 s2, Eq_2 s5, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg010C, ptr32 dwArg0164, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s2_10 = a0;
	Eq_2 s7_1411 = a1;
	ptr32 a1_116 = 0x01;
	word16 wLoc3A_1153 = SLICE(s8, word16, 16);
	word24 nLoc3B_1160 = SLICE(s8, word24, 8);
	Eq_2 s6_1409 = a3;
	Eq_2 s9_1426 = a4;
	Eq_2 s5_1406 = a5;
	word32 a2_1499;
	if (atomic_test_bit(0x4200DDCC, 0x01, out a2_1499) != 0x00)
	{
		struct Eq_286916 * s0_204 = &g_b4200DD60;
		up32 a0_49 = (word32) *a0;
		if (a0_49 >= (word32) g_b4200DD67)
		{
l230508B0:
			goto l230508B2;
		}
		dwLoc4C = 0x00;
		word32 a2_1500;
		word32 a5_1502;
		word32 a3_1501;
		if (memcmp(a0_49 + 0x4200DD67, fp + -72, 0x07, out a1_116, out a2_1500, out a3_1501, out a4, out a5_1502) == 0x00)
			goto l230508B0;
		ui32 a5_65 = (word32) *((word32) a0 + 1);
		s3 = 0x4200DDCC;
		if ((a5_65 & 1) == 0x00 && (word32) g_b4200DD70 <= 0x08)
		{
			a4.u0 = 0x009F;
			if ((word32) *((word32) a0 + 2) <= 0x009F)
				goto l230508B0;
		}
		a4 = (word32) g_b4200DDF3;
		if (a4 == 0x00)
		{
			a4 = a5_65 & 64;
			if ((a5_65 & 64) != 0x00)
				goto l230508B0;
			a4 = (int32) (byte) a5_65;
			if (a4 < 0x00)
				goto l230508B0;
		}
		if ((a5_65 & 0x10) != 0x00 || a5 == 0x00)
		{
			a4 = (word32) *((word32) a0 + 2);
			Eq_2 a5_90 = (word32) *((word32) a0 + 4);
			if (a5_90 < a4 || a4 <= 0x1F)
				goto l230508B0;
			a4.u0 = 0x04000000;
			if (a5_90 > 0x04000000)
				goto l230508B0;
		}
		word32 a2_1503;
		Eq_2 a0_99 = atomic_test_bit(0x4200DDCC, 0x06, out a2_1503);
		a1_116 = 0x06;
		Eq_2 s1_102 = a0_99;
		if (a0_99 == 0x00)
		{
			word32 a0_1505;
			word32 a2_1506;
			word32 a4_1507;
			word32 t1_1504;
			word32 a5_1508;
			Eq_2 a3_118;
			Eq_2 ra_121 = memset(ra, fp + -64, 0x00, 0x0F, out t1_1504, out a0_1505, out a1_116, out a2_1506, out a3_118, out a4_1507, out a5_1508);
			Eq_2 a4_130 = (word32) g_b4200DD68;
			Eq_2 dwLoc40_674 = SEQ((word16) (word32) *((word32) a0 + 4), (word16) (word32) *((word32) a0 + 2));
			if (a4_130 != (word32) (*a0))
			{
				word32 a2_1510;
				word32 a4_1511;
				word32 a0_1509;
				word32 s8_1514;
				word32 a5_1512;
				word32 s4_1513;
				s1_102 = atomic_and(0x4200DD60, ~0x10000000, a3_118, a4_130, mstatus, out a0_1509, out a1_116, out a2_1510, out a3_118, out a4_1511, out a5_1512, out s4_1513, out s8_1514);
			}
			ui32 a5_158 = (word32) *((word32) a0 + 1);
			a4 = (int32) (byte) a5_158;
			if ((a5_158 & 64) != 0x00 || a4 < 0x00)
				;
			Eq_2 dwLoc3C_1151;
			Eq_2 a5_238;
			struct Eq_287094 * s4_173 = (word32) *a0;
			g_b4200DD68 = (byte) s4_173;
			ui32 a5_178 = (word32) *((word32) a0 + 1);
			ui32 s10_179 = a5_178 & 1;
			if ((a5_178 & 1) != 0x00)
			{
				a4 = (word32) s4_173->b4200DD67;
				if (a4 == 0x01)
				{
					word32 a0_273;
					word32 a5_1541;
					word32 s1_1540;
					word32 s8_1542;
					word32 s11_1543;
					ra_121 = set_random_address(ra_121, s1_102, &s4_173->b4200DD67 + 1, mstatus, dwLoc40_674, s8, s2, s0, dwLoc28, dwLoc1C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg24, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_204, out s1_1540, out a0_273, out a1_116, out a3_118, out a4, out a5_1541, out s2_10, out s3, out s4_173, out s5_1406, out s6_1409, out s7_1411, out s8_1542, out s9_1426, out s10_179, out s11_1543, out mstatus);
					if (a0_273 != 0x00)
						goto l230508B2;
				}
				a5_238 = CONVERT(Mem177[s4_173 + 0x07 + s0_204:byte], byte, word32);
				byte bLoc3B_786 = (byte) a5_238;
				word24 nLoc3B_1154 = SEQ(wLoc3A_1153, bLoc3B_786);
				if (s5_1406 == 0x00)
					dwLoc3C_1151 = SEQ(nLoc3B_1154, 0x00);
				else
				{
					if (((word32) *((word32) s2_10 + 1) & 0x10) != 0x00)
						s10_179 = 0x04;
					word32 a5_1539;
					a3_118 = bt_addr_le_copy(fp + -58, s5_1406, out a4, out a5_1539);
					ui32 a5_330 = (word32) s0_204->t0070;
					byte bLoc3C_787 = (byte) s10_179;
					a5_238 = a5_330 & 64;
					dwLoc3C_1151 = SEQ(wLoc3A_1153, bLoc3B_786, bLoc3C_787);
					if ((a5_330 & 64) != 0x00)
					{
						ui32 a5_333 = (word32) *((word32) s2_10 + 1);
						a5_238 = a5_333 & 32;
						if ((a5_333 & 32) != 0x00)
						{
							ui32 a5_335 = (word32) bLoc3B_786;
							a5_238 = a5_335 | 2;
							dwLoc3C_1151 = SEQ(wLoc3A_1153, (byte) (a5_335 | 2), bLoc3C_787);
						}
					}
				}
			}
			else
			{
				if ((a5_178 & 0x04) != 0x00)
				{
					a4 = (word32) s4_173->b4200DD67;
					if (a4 == 0x01)
					{
						Eq_2 a0_211;
						word32 a5_1545;
						word32 s10_1547;
						word32 s1_1544;
						word32 s8_1546;
						word32 s11_1548;
						ra_121 = set_random_address(ra_121, s1_102, &s4_173->b4200DD67 + 1, mstatus, dwLoc40_674, s8, s2, s0, dwLoc28, dwLoc1C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg24, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_204, out s1_1544, out a0_211, out a1_116, out a3_118, out a4, out a5_1545, out s2_10, out s3, out s4_173, out s5_1406, out s6_1409, out s7_1411, out s8_1546, out s9_1426, out s10_1547, out s11_1548, out mstatus);
						s1_102 = a0_211;
					}
					nLoc3B_1160 = SEQ(wLoc3A_1153, SLICE(CONVERT(Mem177[s0_204 + (s4_173 + 0x07):byte], byte, word32), byte, 0));
					if (s1_102 != 0x00)
						goto l230508B2;
				}
				a5_238.u0 = 0x02;
				if (s6_1409 == 0x00)
					a5_238.u0 = 0x03;
				dwLoc3C_1151 = SEQ(nLoc3B_1160, (byte) a5_238);
			}
			word32 s4_385;
			word32 a3_1517;
			word32 s0_1515;
			word32 s1_1516;
			word32 s8_1519;
			word32 a5_1518;
			Eq_2 ra_380 = bt_hci_cmd_create(ra_121, 0x0F, a3_118, a4, a5_238, mstatus, s7, dwArg58, dwArg98, dwArgB8, out s0_1515, out s1_1516, out a1_116, out a3_1517, out a4, out a5_1518, out s2_10, out s3, out s4_385, out s5_1406, out s6_1409, out s8_1519, out mstatus);
			if (false)
				goto l230508B2;
			Eq_2 a3_404;
			Eq_2 a4_405;
			Eq_2 a5_406;
			word32 a1_1520;
			word32 a2_1521;
			net_buf_simple_add_mem(0x0200000E, fp + -64, 0x0F, a4, out a1_1520, out a2_1521, out a3_404, out a4_405, out a5_406);
			Eq_2 a0_418;
			Eq_2 s4_434;
			Eq_2 s8_438;
			word32 a2_1524;
			word32 s10_1525;
			word32 s0_1522;
			word32 s11_1526;
			word32 s1_1523;
			Eq_2 a5_423;
			Eq_2 a3_421;
			Eq_2 ra_427 = bt_hci_cmd_send_sync(ra_380, 0x02000006, s4_385 + 6, 0x02000006, a3_404, a4_405, a5_406, s5_1406, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_1522, out s1_1523, out a0_418, out a1_116, out a2_1524, out a3_421, out a4, out a5_423, out s2_10, out s3, out s4_434, out s5_1406, out s6_1409, out s7_1411, out s8_438, out s9_1426, out s10_1525, out s11_1526, out mstatus);
			Eq_2 s1_447 = a0_418;
			if (a0_418 == 0x00)
			{
				if (s5_1406 != 0x00)
				{
l23050A7A:
					word32 a0_495;
					Eq_2 a3_498;
					Eq_2 s0_505;
					word32 a5_1528;
					word32 s1_1527;
					word32 s4_1529;
					set_advertise_enable(ra_427, s1_447, a3_421, a4, a5_423, mstatus, dwLoc40_674, dwLoc3C_1151, s2, s0, dwLoc28, dwLoc1C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg24, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_505, out s1_1527, out a0_495, out a3_498, out a4, out a5_1528, out s2_10, out s3, out s4_1529, out s5_1406, out s6_1409, out s7_1411, out mstatus);
					if (a0_495 == 0x00)
					{
						Eq_2 a3_534;
						Eq_2 a4_535;
						word32 a5_1531;
						word32 a1_1530;
						word32 s4_1532;
						atomic_set_bit_to(s0_505, 0x09, ((word32) *((word32) s2_10 + 1) >> 1 ^ 1) & 0x01, a3_498, a4, mstatus, out a1_1530, out a3_534, out a4_535, out a5_1531, out s4_1532);
						Eq_2 a3_549;
						Eq_2 a4_550;
						word32 a5_1534;
						word32 s4_1535;
						word32 a1_1533;
						atomic_set_bit_to(s0_505, 0x07, (word32) *((word32) s2_10 + 1) >> 3 & 0x01, a3_534, a4_535, mstatus, out a1_1533, out a3_549, out a4_550, out a5_1534, out s4_1535);
						word32 a3_1536;
						word32 a5_1537;
						word32 s4_1538;
						atomic_set_bit_to(s0_505, 0x08, (word32) *((word32) s2_10 + 1) & 0x01, a3_549, a4_550, mstatus, out a1_116, out a3_1536, out a4, out a5_1537, out s4_1538);
					}
					goto l230508B2;
				}
				uint32 a4_448 = (word32) *((word32) s2_10 + 1);
				Eq_2 a0_484;
				ra_427 = le_adv_update(ra_427, s9_1426, a4_448 & 0x01, a4_448 >> 0x03 & 0x01, s4_434, s6_1409, s7_1411, s8_438, mstatus, dwLoc50, 0x00, dwLoc48, dwLoc28, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg18, dwArg28, dwArg38, s5, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArg0164, out a0_484, out a3_421, out a4, out a5_423, out mstatus);
				s1_447 = a0_484;
				if (a0_484 == 0x00)
					goto l23050A7A;
			}
		}
	}
l230508B2:
	0x00 = dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = dwLoc4C;
	a1Out = a1_116;
	a3Out = s2;
	a4Out = a4;
	s2Out = s2_10;
	s3Out = s3;
	s5Out = s5_1406;
	s6Out = s6_1409;
	s7Out = s7_1411;
	s8Out = dwArg0148;
	s9Out = s9_1426;
	mstatusOut = mstatus;
	return dwLoc08;
}

