pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23050B22: Register word32 set_adv_channel_map(Register word32 a0)
// Called from:
//      ble_set_adv_channel
word32 set_adv_channel_map(word32 a0)
{
	if ((a0 + -1 & 0x00FF) > 0x06)
		return ~0x00;
	g_b4200FC3C = (byte) a0;
	return 0x00;
}

// 23050B40: void bt_get_local_public_address(Register Eq_2 a0)
// Called from:
//      blemesh_init
//      ble_read_local_address
void bt_get_local_public_address(Eq_2 a0)
{
	word32 a4_27;
	word32 a5_28;
	bt_addr_le_copy(a0, 0x4200DD60, out a4_27, out a5_28);
}

// 23050B58: void bt_get_local_ramdon_address(Register Eq_2 a0)
// Called from:
//      ble_read_local_address
void bt_get_local_ramdon_address(Eq_2 a0)
{
	word32 a4_27;
	word32 a5_28;
	bt_addr_le_copy(a0, 0x4200DD69, out a4_27, out a5_28);
}

// 23050B70: Register Eq_2 bt_le_adv_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg010C, Stack ptr32 dwArg0164, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      adv_thread
//      bt_mesh_proxy_adv_start
//      ble_start_advertise
Eq_2 bt_le_adv_start(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, word32 dwArg010C, ptr32 dwArg0164, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ui32 a5_5 = (word32) *((word32) a0 + 1);
	if ((a5_5 & 0x10) != 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = ~0x15;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		ptr32 a0_16;
		ptr32 a1_17;
		Eq_2 a3_19;
		Eq_2 s0_22;
		ptr32 s1_23;
		Eq_2 s2_24;
		Eq_2 s5_26;
		ptr32 s6_27;
		Eq_2 s7_28;
		Eq_2 s8_29;
		ptr32 s9_30;
		ptr32 a4_34;
		ptr32 s3_36;
		ptr32 mstatus_38;
		Eq_2 ra_21 = bt_le_adv_start_internal(ra, s0, a0, a3, a5_5 & 0x10, s2, s5, s7, s8, mstatus, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg010C, dwArg0164, out s0_22, out s1_23, out a0_16, out a1_17, out a3_19, out a4_34, out s2_24, out s3_36, out s5_26, out s6_27, out s7_28, out s8_29, out s9_30, out mstatus_38);
		s0Out = s0_22;
		s1Out = s1_23;
		a0Out = a0_16;
		a1Out = a1_17;
		a3Out = a3_19;
		a4Out = a4_34;
		s2Out = s2_24;
		s3Out = s3_36;
		s5Out = s5_26;
		s6Out = s6_27;
		s7Out = s7_28;
		s8Out = s8_29;
		s9Out = s9_30;
		mstatusOut = mstatus_38;
		return ra_21;
	}
}

// 23050B80: Register Eq_2 bt_le_adv_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      adv_thread
//      bt_mesh_proxy_adv_stop
//      bt_conn_disconnect
//      ble_stop_advertise
Eq_2 bt_le_adv_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 s1_102;
	word32 a0_228;
	word32 a1_229;
	word32 a2_230;
	Eq_2 a4_155;
	Eq_2 a3_153;
	Eq_2 a5_157;
	ptr32 s4_181;
	ptr32 s8_192;
	Eq_2 s1_23 = atomic_and(0x4200DDCC, -513, a3, a4, mstatus, out a0_228, out a1_229, out a2_230, out a3_153, out a4_155, out a5_157, out s4_181, out s8_192);
	word32 a2_231;
	if (atomic_test_bit(0x4200DDCC, 0x06, out a2_231) != 0x00)
	{
		ptr32 a0_33;
		Eq_2 s0_43;
		word32 s1_232;
		ra = set_advertise_enable(ra, s1_23, a3_153, a4_155, a5_157, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg64, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_43, out s1_232, out a0_33, out a3_153, out a4_155, out a5_157, out s2, out s3, out s4_181, out s5, out s6, out s7, out mstatus);
		s1_102 = a0_33;
		if (a0_33 == 0x00)
		{
			word32 a2_233;
			if (atomic_test_bit(s0_43, 0x0A, out a2_233) == 0x00)
				goto l23050BA4;
			struct Eq_64398 * a2_71;
			if (atomic_test_bit(s0_43, 0x0C, out a2_71) == 0x00)
				goto l23050BA4;
			word32 a0_234;
			word32 a1_235;
			word32 s11_236;
			ra = le_set_private_addr.isra.19(ra, a2_71, mstatus, dwLoc10, s0, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_102, out a0_234, out a1_235, out a3_153, out a4_155, out a5_157, out s2, out s3, out s4_181, out s5, out s6, out s7, out s8_192, out s9, out s11_236, out mstatus);
		}
l23050BA6:
		s1Out = s1_102;
		a0Out = s1_102;
		a3Out = a3_153;
		a4Out = a4_155;
		a5Out = a5_157;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4_181;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8_192;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
l23050BA4:
		s1_102 = 0x00;
		goto l23050BA6;
	}
}

// 23050BD6: Register Eq_2 bt_le_scan_start(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_scan_enable
//      ble_start_scan
Eq_2 bt_le_scan_start(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 s3_162 = 0x4200DD60;
	Eq_2 s1_108 = a0;
	ptr32 a1_150 = 0x01;
	Eq_2 s0_107 = ~0x0A;
	word32 a2_415;
	if (atomic_test_bit(0x4200DDCC, 0x01, out a2_415) != 0x00)
	{
		a4 = (word32) *a0;
		s0_107.u0 = ~0x15;
		if (a4 > 0x01)
			goto l23050C88;
		ui32 a5_31 = (word32) *((word32) a0 + 1);
		a4 = a5_31 & -4;
		if ((a5_31 & -4) == 0x00)
		{
			a4 = (word32) g_b4200DDF3;
			s2.u0 = 0x4200DDCC;
			if (a4 == 0x00 && (a5_31 & 0x02) != 0x00)
				goto l23050C88;
			Eq_2 a2_39 = (word32) *((word32) a0 + 2);
			uint32 a4_43 = (word32) a2_39 - 4 << 16;
			a4 = a4_43 >> 16;
			s0_107.u0 = ~0x15;
			if (a4_43 >> 16 <= 0x03FFFFFC)
			{
				a3 = (word32) *((word32) a0 + 4);
				uint32 a4_48 = (word32) a3 - 4 << 16;
				a4 = a4_48 >> 16;
				if (a4_48 >> 16 > 0x03FFFFFC || a2_39 < a3)
					goto l23050C88;
				ui32 a0_57;
				Eq_2 a5_62;
				word32 s8_418;
				word32 s4_417;
				word32 a2_416;
				s1_108 = atomic_or(0x00FFF800, 0x00FFF800, a3, a4_48 >> 16, mstatus, out a0_57, out a1_150, out a2_416, out a3, out a4, out a5_62, out s4_417, out s8_418);
				s0_107.u0 = -69;
				if ((a0_57 & 0x00FFF800) == 0x00)
				{
					word32 a2_419;
					if (atomic_test_bit(0x4200DDCC, 0x0A, out a2_419) != 0x00)
					{
						Eq_2 a0_78;
						word32 s0_432;
						word32 a1_433;
						word32 a5_434;
						word32 s4_435;
						word32 s8_436;
						word32 s9_437;
						ra = set_le_scan_enable(ra, a3, a4, a5_62, 0x4200DD60, mstatus, dwLoc20, s4, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_432, out s1_108, out a0_78, out a1_433, out a3, out a4, out a5_434, out s2, out s3_162, out s4_435, out s5, out s6, out s7, out s8_436, out s9_437, out s11, out mstatus);
						s0_107 = a0_78;
						if (a0_78 != 0x00)
						{
l23050C7C:
							word32 a0_438;
							word32 a2_439;
							word32 a5_440;
							word32 s4_441;
							word32 s8_442;
							s1_108 = atomic_and(s0_107, ~0x00FFF800, a3, a4, mstatus, out a0_438, out a1_150, out a2_439, out a3, out a4, out a5_440, out s4_441, out s8_442);
							goto l23050C88;
						}
					}
					Eq_2 a3_122;
					Eq_2 a4_123;
					word32 s4_427;
					word32 a5_426;
					word32 a4_425;
					word32 a3_424;
					word32 a1_423;
					word32 s4_422;
					word32 a5_421;
					word32 a1_420;
					Eq_2 s1_140 = atomic_set_bit_to(s0_107, 0x0E, (word32) *((word32) atomic_set_bit_to(s0_107, 0x0D, (word32) *((word32) s1_108 + 1) & 0x01, a3, a4, mstatus, out a1_420, out a3_122, out a4_123, out a5_421, out s4_422) + 1) >> 1 & 0x01, a3_122, a4_123, mstatus, out a1_423, out a3_424, out a4_425, out a5_426, out s4_427);
					word32 a5_429;
					word32 s8_430;
					word32 s9_431;
					Eq_2 a0_149;
					Eq_2 s4_163;
					word32 s0_428;
					ra = start_le_scan(ra, s0_107, (word32) *s1_140, (word32) *((word32) s1_140 + 2), (word32) *((word32) s1_140 + 4), s2, mstatus, s4, s2, s0, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_428, out s1_108, out a0_149, out a1_150, out a3, out a4, out a5_429, out s2, out s3_162, out s4_163, out s5, out s6, out s7, out s8_430, out s9_431, out s11, out mstatus);
					s0_107 = a0_149;
					if (a0_149 != 0x00)
						goto l23050C7C;
					g_t4200F484 = s4_163;
				}
			}
		}
	}
l23050C88:
	s1Out = s1_108;
	a0Out = s0_107;
	a1Out = a1_150;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3_162;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23050CD6: Register Eq_2 bt_le_scan_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_196830 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_scan_disable
//      ble_stop_scan
Eq_2 bt_le_scan_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_196830 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ui32 a0_14;
	Eq_2 a3_17;
	Eq_2 a4_18;
	ptr32 s4_21;
	ptr32 s8_22;
	word32 a1_159;
	word32 a2_160;
	word32 a5_161;
	Eq_2 s1_20 = atomic_and(s0, ~0x00FFF800, a3, a4, mstatus, out a0_14, out a1_159, out a2_160, out a3_17, out a4_18, out a5_161, out s4_21, out s8_22);
	if (a0_14 << 0x14 >= 0x00)
	{
		s1Out = s1_20;
		a0Out.u0 = -69;
		a3Out = a3_17;
		a4Out = a4_18;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4_21;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8_22;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		g_t4200F484.u0 = 0x00;
		Eq_196830 a0_35;
		Eq_2 a3_38;
		Eq_2 a4_39;
		ptr32 mstatus_43;
		Eq_2 s1_45;
		Eq_2 s2_48;
		Eq_2 s3_49;
		ptr32 s4_50;
		ptr32 s5_51;
		ptr32 s6_52;
		ptr32 s7_53;
		ptr32 s8_54;
		ptr32 s9_55;
		word32 s0_162;
		word32 a5_163;
		Eq_2 ra_44 = bt_le_scan_update(ra, s0, a3_17, a4_18, 0x4200F000, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg54, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_162, out s1_45, out a0_35, out a3_38, out a4_39, out a5_163, out s2_48, out s3_49, out s4_50, out s5_51, out s6_52, out s7_53, out s8_54, out s9_55, out mstatus_43);
		s1Out = s1_45;
		a0Out = a0_35;
		a3Out = a3_38;
		a4Out = a4_39;
		s2Out = s2_48;
		s3Out = s3_49;
		s4Out = s4_50;
		s5Out = s5_51;
		s6Out = s6_52;
		s7Out = s7_53;
		s8Out = s8_54;
		s9Out = s9_55;
		mstatusOut = mstatus_43;
		return ra_44;
	}
}

// 23050D10: Register Eq_2 bt_set_tx_pwr(Register Eq_2 ra, Register Eq_2 s1, Register int32 a0, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_287965 a0Out, Register out ptr32 a3Out)
// Called from:
//      ble_set_tx_pwr
Eq_2 bt_set_tx_pwr(Eq_2 ra, Eq_2 s1, int32 a0, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_287965 & a0Out, ptr32 & a3Out)
{
	if ((a0 & 0x00FF) > 0x14)
	{
		a0Out.u0 = 0x12;
		a3Out = a3;
		return ra;
	}
	else
	{
		Eq_2 a3_21;
		Eq_2 a4_22;
		Eq_2 a5_23;
		Eq_2 a4_35;
		ptr32 mstatus_39;
		word32 s1_42;
		Eq_2 s5_46;
		word32 t1_226;
		word32 a0_227;
		word32 a1_228;
		word32 a2_229;
		word32 s0_230;
		word32 a1_231;
		word32 a5_232;
		word32 s2_233;
		word32 s3_234;
		word32 s4_235;
		word32 s6_236;
		word32 s8_237;
		ptr32 a3_156;
		Eq_2 ra_170 = bt_hci_cmd_create(memset(ra, fp + ~0x13, 0x00, 0x01, out t1_226, out a0_227, out a1_228, out a2_229, out a3_21, out a4_22, out a5_23), 0x01, a3_21, a4_22, a5_23, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_230, out s1_42, out a1_231, out a3_156, out a4_35, out a5_232, out s2_233, out s3_234, out s4_235, out s5_46, out s6_236, out s8_237, out mstatus_39);
		Eq_287965 a0_147 = -55;
		if (true)
		{
			Eq_2 a3_64;
			Eq_2 a4_65;
			Eq_2 a5_66;
			word32 a1_238;
			word32 a2_239;
			net_buf_simple_add_mem(0x0FFFFC69, fp + ~0x13, 0x01, a4_35, out a1_238, out a2_239, out a3_64, out a4_65, out a5_66);
			word32 s0_240;
			word32 s1_241;
			word32 a1_242;
			word32 a2_243;
			word32 a4_244;
			word32 a5_245;
			word32 s2_246;
			word32 s3_247;
			word32 s4_248;
			word32 s5_249;
			word32 s6_250;
			word32 s7_251;
			word32 s8_252;
			word32 s9_253;
			word32 s10_254;
			word32 s11_255;
			word32 mstatus_256;
			ra_170 = bt_hci_cmd_send_sync(ra_170, 0x0FFFFC61, s1_42 + -927, 0x0FFFFC61, a3_64, a4_65, a5_66, s5_46, mstatus_39, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_240, out s1_241, out a0_147, out a1_242, out a2_243, out a3_156, out a4_244, out a5_245, out s2_246, out s3_247, out s4_248, out s5_249, out s6_250, out s7_251, out s8_252, out s9_253, out s10_254, out s11_255, out mstatus_256);
		}
		a0Out = a0_147;
		a3Out = a3_156;
		return ra_170;
	}
}

// 23050D6C: Register word32 bt_buf_get_rx_avail_cnt(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bl_onchiphci_rx_packet_handler
word32 bt_buf_get_rx_avail_cnt(Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_16;
	ptr32 a4_17;
	word32 a0_14 = k_queue_get_cnt(1107357500, a3, a4, mstatus, out a3_16, out a4_17);
	ptr32 a5_19 = (word32) g_w4200EF4A;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_19;
	return a0_14 + a5_19;
}

// 23050D90: Register Eq_2 bt_buf_get_rx(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out (ptr32 byte) a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 byte) s4Out, Register out (ptr32 int32) s5Out, Register out ptr32 mstatusOut)
// Called from:
//      net_buf_unref
//      bl_onchiphci_rx_packet_handler
//      bt_buf_get_cmd_complete
Eq_2 bt_buf_get_rx(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_2 & a1Out, byte & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, byte & s4Out, int32 & s5Out, ptr32 & mstatusOut)
{
	struct Eq_288100 * a0_20;
	ptr32 a3_23;
	ptr32 a4_24;
	Eq_2 a5_25;
	ptr32 mstatus_28;
	ptr32 s1_31;
	ptr32 s2_32;
	byte * s4_34;
	int32 * s5_35;
	word32 s8_104;
	word32 s6_103;
	word32 s3_102;
	word32 s0_101;
	Eq_2 a1_21;
	Eq_2 ra_29 = net_buf_alloc_fixed(ra, a1, a3, a4, a5, s5, mstatus, dwArgA4, dwArgB8, dwArgF8, dwArg0118, out s0_101, out s1_31, out a0_20, out a1_21, out a3_23, out a4_24, out a5_25, out s2_32, out s3_102, out s4_34, out s5_35, out s6_103, out s8_104, out mstatus_28);
	if (a0_20 != null)
	{
		a1_21 = net_buf_simple_reserve((word32 *) 0x01, a5_25);
		a0_20->b0014 = (byte) s1_31;
	}
	s1Out = s1_31;
	a1Out = a1_21;
	a2Out = dwArg10;
	a3Out = a3_23;
	a4Out = a4_24;
	s2Out = s2_32;
	s4Out = s4_34;
	s5Out = s5_35;
	mstatusOut = mstatus_28;
	return ra_29;
}

