pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23050DC2: Register Eq_2 bt_buf_get_cmd_complete(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_255648) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_onchiphci_rx_packet_handler
Eq_2 bt_buf_get_cmd_complete(Eq_2 ra, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0118, union Eq_2 & s0Out, ptr32 & s1Out, struct Eq_255648 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	word32 a2_125;
	word32 a4_126;
	word32 a5_127;
	irq_lock(a4, mstatus, out a2_125, out a4_126, out a5_127);
	struct Eq_255648 * s0_18 = g_ptr4200DE04;
	g_ptr4200DE04 = null;
	Eq_2 a4_22;
	Eq_2 a5_23;
	Eq_2 a3_21 = irq_unlock(a3, mstatus, out a4_22, out a5_23);
	if (s0_18 != null)
	{
		s0_18->b0014 = 0x01;
		s0_18->w000C = 0x00;
		Eq_2 a1_31 = net_buf_simple_reserve((word32 *) 0x01, 0x01);
		s0Out.u0 = <invalid>;
		s1Out = s1;
		a0Out = s0_18;
		a1Out = a1_31;
		a2Out = dwArg44;
		a3Out = a3_21;
		a4Out = a4_22;
		s2Out = s2;
		s4Out = s4;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a1_42;
		ptr32 a2_43;
		Eq_2 a3_44;
		Eq_2 a4_45;
		ptr32 mstatus_49;
		ptr32 s1_51;
		ptr32 s2_52;
		ptr32 s4_54;
		Eq_2 s5_55;
		Eq_2 ra_50 = bt_buf_get_rx(ra, a1, a3_21, a4_22, a5_23, s5, mstatus, dwArgA4, dwArgB8, dwArgF8, dwArg0118, out s1_51, out a1_42, out a2_43, out a3_44, out a4_45, out s2_52, out s4_54, out s5_55, out mstatus_49);
		s0Out.u0 = <invalid>;
		s1Out = s1_51;
		a0Out = (struct Eq_255648 *) 0x01;
		a1Out = a1_42;
		a2Out = a2_43;
		a3Out = a3_44;
		a4Out = a4_45;
		s2Out = s2_52;
		s4Out = s4_54;
		s5Out = s5_55;
		mstatusOut = mstatus_49;
		return ra_50;
	}
}

// 23050E10: Register Eq_2 bt_pub_key_gen(Register Eq_2 ra, Register (ptr32 word32) a0, Register Eq_2 a3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s1Out, Register out Eq_227175 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_227175 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_mesh_pb_gatt_close
//      bt_smp_init
Eq_2 bt_pub_key_gen(Eq_2 ra, word32 * a0, Eq_2 a3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s1Out, union Eq_227175 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_227175 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, ptr32 & mstatusOut)
{
	ptr32 a5_140;
	Eq_2 a4_139;
	Eq_2 a3_138;
	Eq_2 s1_141;
	Eq_227175 s2_108;
	if (((word32) g_b4200DDA2 & 0x06) != 0x06)
	{
		word32 a0_354;
		word32 a2_356;
		word32 a1_355;
		word32 a7_357;
		word32 s2_358;
		word32 s4_359;
		word32 s6_360;
		word32 s7_361;
		word32 s8_362;
		word32 s9_363;
		word32 s10_364;
		word32 s11_365;
		word32 t4_366;
		ra = printf(ra, &g_t230BB1D8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_141, out a0_354, out a1_355, out a2_356, out a3_138, out a4_139, out a5_140, out a7_357, out s2_358, out s3, out s4_359, out s5, out s6_360, out s7_361, out s8_362, out s9_363, out s10_364, out s11_365, out t4_366);
		s2_108.u0 = -35;
	}
	else
	{
		if (g_dw4200F478 != 0x00)
		{
			struct Eq_288261 * a0_24 = *a3;
			do
			{
				if (a3 == 0x06)
					goto l23050E74;
				Eq_2 a5_29 = *(union Eq_2 *) 0x0A;
			} while (true);
			a0_24->t0004 = a5_29;
		}
		else
			*a0 = 0x4200F478;
l23050E74:
		ui32 a0_43;
		word32 a2_368;
		word32 s8_370;
		word32 a1_367;
		word32 s4_369;
		s1_141 = atomic_or(0x4200DDCC, 32, a3, 0x06, mstatus, out a0_43, out a1_367, out a2_368, out a3_138, out a4_139, out a5_140, out s4_369, out s8_370);
		s2_108.u0 = 0x00;
		if ((a0_43 & 32) == 0x00)
		{
			word32 s4_374;
			Eq_2 a3_60;
			Eq_2 a4_61;
			Eq_2 a5_62;
			word32 a0_371;
			word32 a2_373;
			word32 a1_372;
			word32 s8_375;
			atomic_and(0x4200DDCC, ~0x10, a3_138, a4_139, mstatus, out a0_371, out a1_372, out a2_373, out a3_60, out a4_61, out a5_62, out s4_374, out s8_375);
			Eq_227175 a0_79;
			Eq_2 s0_89;
			word32 a1_376;
			word32 a2_377;
			word32 s2_378;
			word32 s4_379;
			word32 s6_380;
			word32 s7_381;
			word32 s8_382;
			word32 s9_383;
			word32 s10_384;
			word32 s11_385;
			ra = bt_hci_cmd_send_sync(ra, 0x4200DDCC, 0x02000025, 0x00, a3_60, a4_61, a5_62, s5, mstatus, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg44, dwArg58, dwArg64, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_89, out s1_141, out a0_79, out a1_376, out a2_377, out a3_138, out a4_139, out a5_140, out s2_378, out s3, out s4_379, out s5, out s6_380, out s7_381, out s8_382, out s9_383, out s10_384, out s11_385, out mstatus);
			s2_108 = a0_79;
			if (a0_79 != 0x00)
			{
				Eq_2 a3_116;
				Eq_2 a4_117;
				word32 s1_386;
				word32 a0_387;
				word32 a1_388;
				word32 a2_389;
				word32 a5_390;
				word32 a7_391;
				word32 s4_392;
				word32 s6_393;
				word32 s7_394;
				word32 s8_395;
				word32 s9_396;
				word32 s10_397;
				word32 s11_398;
				word32 t4_399;
				ra = printf(ra, &g_t230BB1FC, a3_138, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_386, out a0_387, out a1_388, out a2_389, out a3_116, out a4_117, out a5_390, out a7_391, out s2_108, out s3, out s4_392, out s5, out s6_393, out s7_394, out s8_395, out s9_396, out s10_397, out s11_398, out t4_399);
				word32 a0_400;
				word32 a1_401;
				word32 a2_402;
				word32 s4_403;
				word32 s8_404;
				s1_141 = atomic_and(s0_89, -33, a3_116, a4_117, mstatus, out a0_400, out a1_401, out a2_402, out a3_138, out a4_139, out a5_140, out s4_403, out s8_404);
				*s1_141 = 0x00;
			}
		}
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_141;
	a0Out = s2_108;
	a3Out = a3_138;
	a4Out = a4_139;
	a5Out = a5_140;
	s2Out = s2_108;
	s3Out = s3;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 23050EC0: Register ptr32 bt_pub_key_get(Register out ptr32 a5Out)
// Called from:
//      prov_pub_key
//      send_pub_key
//      smp_init
ptr32 bt_pub_key_get(ptr32 & a5Out)
{
	ptr32 a5_12 = 0x00;
	word32 a2_27;
	if (atomic_test_bit(0x4200DDCC, 0x04, out a2_27) != 0x00)
		a5_12 = 1107388388;
	a5Out = a5_12;
	return a5_12;
}

