pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23050EE6: void bt_dh_key_gen(Register Eq_2 ra, Register Eq_2 s1, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 (ptr32 word32)) a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
// Called from:
//      pub_key_ready
void bt_dh_key_gen(Eq_2 ra, Eq_2 s1, word32 a1, Eq_2 a3, Eq_2 a4, word32 ** a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	word32 * s0_8 = *a5;
	if (a5 != null)
		return;
	word32 a2_233;
	if (atomic_test_bit(0x4200DDCC, 0x05, out a2_233) != 0x00)
		return;
	word32 a2_234;
	if (atomic_test_bit(0x4200DDCC, 0x04, out a2_234) != 0x00)
	{
		*s0_8 = a1;
		Eq_2 a4_44;
		ptr32 mstatus_48;
		Eq_2 s0_50;
		Eq_2 s2_52;
		word32 s3_53;
		Eq_2 s5_55;
		word32 s8_241;
		word32 s6_240;
		word32 s4_239;
		word32 a5_238;
		word32 a3_237;
		word32 a1_236;
		word32 s1_235;
		Eq_2 ra_49 = bt_hci_cmd_create(ra, 64, a3, a4, -49, mstatus, dwArg74, dwArg88, dwArgC8, dwArgE8, out s0_50, out s1_235, out a1_236, out a3_237, out a4_44, out a5_238, out s2_52, out s3_53, out s4_239, out s5_55, out s6_240, out s8_241, out mstatus_48);
		if (false)
			*s0_50 = 0x00;
		else
		{
			Eq_2 a4_73;
			Eq_2 a5_74;
			Eq_2 a3_78;
			word32 a7_247;
			word32 a6_246;
			word32 a2_245;
			word32 a1_244;
			word32 a5_243;
			word32 a1_242;
			memcpy(net_buf_simple_add(0x0200002E, 64, a4_44, out a1_242, out a5_243), s2_52, 64, out a1_244, out a2_245, out a3_78, out a4_73, out a5_74, out a6_246, out a7_247);
			word32 a0_89;
			word32 * s0_99;
			word32 s1_248;
			word32 a1_249;
			word32 a2_250;
			word32 a3_251;
			word32 a4_252;
			word32 a5_253;
			word32 s2_254;
			word32 s3_255;
			word32 s4_256;
			word32 s5_257;
			word32 s6_258;
			word32 s7_259;
			word32 s8_260;
			word32 s9_261;
			word32 s10_262;
			word32 s11_263;
			word32 mstatus_264;
			bt_hci_cmd_send_sync(ra_49, s0_50, s3_53 + 38, 0x02000026, a3_78, a4_73, a5_74, s5_55, mstatus_48, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_99, out s1_248, out a0_89, out a1_249, out a2_250, out a3_251, out a4_252, out a5_253, out s2_254, out s3_255, out s4_256, out s5_257, out s6_258, out s7_259, out s8_260, out s9_261, out s10_262, out s11_263, out mstatus_264);
			if (a0_89 != 0x00)
				*s0_99 = 0x00;
		}
	}
}

// 23050F7E: void sys_slist_remove(Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      __l2cap_lookup_ident
//      l2cap_remove_rx_cid
//      bt_l2cap_chan_remove
void sys_slist_remove(Eq_2 a1, Eq_2 a4, Eq_2 a5)
{
	Eq_2 a2_5 = *a5;
	if (a1 == 0x00)
	{
		Eq_2 a0_11 = *((word32) a4 + 4);
		*a5 = a0_11;
		if (a4 == a2_5)
			*((word32) a5 + 4) = a0_11;
	}
	else
	{
		*a5 = a1;
		Eq_2 a0_8 = *((word32) a5 + 4);
		if (a5 == a2_5)
			*((word32) a1 + 4) = a0_8;
	}
	*a2_5 = 0x00;
}

// 23050F9E: Register Eq_2 net_buf_frags_len(Register Eq_2 a0, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      l2cap_chan_le_send
//      l2cap_chan_le_send_sdu
//      l2cap_chan_le_recv_seg
Eq_2 net_buf_frags_len(Eq_2 a0, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_4 = a0;
	Eq_2 a0_10 = 0x00;
	while (a5_4 != 0x00)
	{
		a4 = (word32) *((word32) a5_4 + 0x0C);
		a5_4 = *a5_4;
		a0_10 = (word32) a0_10 + a4;
	}
	a4Out = a4;
	a5Out = a5_4;
	return a0_10;
}

// 23050FB0: Register word32 get_ident(Register out Eq_288614 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_conn_le_param_update
//      l2cap_chan_send_credits.isra.10
//      l2cap_le_conn_req
//      bt_l2cap_chan_disconnect
word32 get_ident(union Eq_288614 & a4Out, ptr32 & a5Out)
{
	Eq_288614 a4_10 = (word32) g_b4200F48C + 0x01 & 0x00FF;
	if (a4_10 == 0x00)
		a4_10.u0 = 0x01;
	g_b4200F48C = (byte) a4_10;
	word32 a0_13 = (word32) g_b4200F48C;
	a4Out = a4_10;
	a5Out = 0x4200F48C;
	return a0_13;
}

// 23050FD2: void __l2cap_lookup_ident(Register word32 s0, Register Eq_2 a1, Register word32 a2)
void __l2cap_lookup_ident(word32 s0, Eq_2 a1, word32 a2)
{
	if (s0 != 0x00)
	{
		struct Eq_288640 * s0_11 = s0 + ~0x07;
		Eq_2 a5_10 = 0x00;
		while (s0_11 != null)
		{
			Eq_2 a4_13 = (word32) s0_11->b003C;
			if (a4_13 == a1)
			{
				if (a2 != 0x00)
					sys_slist_remove(a5_10, a4_13, a5_10);
				return;
			}
			word32 s0_15 = *((word32) a4_13 + 8);
			if (a4_13 == 0x00)
				return;
			a5_10 = s0_15 + 8;
			s0_11 = (word32) a4_13 - 8;
		}
	}
}

// 23051016: void l2cap_server_lookup_psm(Register word32 a0)
void l2cap_server_lookup_psm(word32 a0)
{
	int32 a5_11 = g_dw4200F490;
	while (a5_11 != 0x00)
	{
		struct Eq_288672 * a5_7 = a5_11 + ~0x07;
		if (a5_7 == null || (word32) a5_7->w0000 == a0)
			return;
		a5_11 = a5_7->dw0008;
	}
}

// 23051034: void l2cap_remove_rx_cid(Register Eq_2 a1)
void l2cap_remove_rx_cid(Eq_2 a1)
{
	if ((word32) (word16) ((word32) a1 - 64) <= 63 && false)
	{
		struct Eq_288695 * s0_15 = (struct Eq_288695 *) ~0x07;
		Eq_2 a5_16 = 0x00;
		while (s0_15 != null)
		{
			Eq_2 a4_19 = (word32) s0_15[8];
			Eq_2 a2_20 = s0_15 + 1;
			if (a4_19 == a1)
			{
				sys_slist_remove(a5_16, a4_19, a5_16);
				return;
			}
			Eq_288702 s0_22 = s0_15[1];
			if (s0_22 == 0x00)
				return;
			s0_15 = (word32) s0_22.u2 - 8;
			a5_16 = a2_20;
		}
	}
}

// 23051080: void l2cap_chan_sdu_sent(Register (ptr32 Eq_288720) a5)
void l2cap_chan_sdu_sent(struct Eq_288720 * a5)
{
	word32 a1_5 = a5->dw0004;
	<anonymous> * t1_6 = a5->ptr0014;
	if (t1_6 == null)
		return;
	t1_6();
}

