pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23051090: void l2cap_alloc_frag(Register (ptr32 Eq_288731) a5)
void l2cap_alloc_frag(struct Eq_288731 * a5)
{
	word32 a1_5 = a5->dw0004;
	a5->ptr000C();
}

// 2305109A: void l2cap_connected()
void l2cap_connected()
{
}

// 2305109C: void l2cap_chan_destroy(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void l2cap_chan_destroy(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 ra_106;
	Eq_2 a0_16;
	Eq_2 a1_24;
	word32 s6_338;
	word32 s4_336;
	word32 s2_334;
	word32 a2_332;
	word32 s8_339;
	word32 s5_337;
	word32 s3_335;
	word32 a5_333;
	Eq_2 a4_101;
	Eq_2 a3_100;
	Eq_2 s1_21 = k_delayed_work_cancel(a0 + 0x10, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_16, out a1_24, out a2_332, out a3_100, out a4_101, out a5_333, out s2_334, out s3_335, out s4_336, out s5_337, out s6_338, out s8_339);
	Eq_2 s0_107 = *((word32) a0_16 + 116);
	ra_106 = ra;
	if (a0_16 != 0x00)
	{
		word32 s8_350;
		word32 s5_348;
		word32 s3_346;
		word32 a5_344;
		word32 a1_342;
		word32 s1_340;
		word32 s6_349;
		word32 s4_347;
		word32 s2_345;
		word32 a2_343;
		word32 a0_341;
		ra_106 = net_buf_unref(ra, s1_21, a0_16, a1_24, a4_101, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_107, out s1_340, out a0_341, out a1_342, out a2_343, out a3_100, out a4_101, out a5_344, out s2_345, out s3_346, out s4_347, out s5_348, out s6_349, out s8_350, out mstatus);
		((word32) s0_107 + 116)->u0 = 0x00;
	}
	Eq_2 s1_108 = (word32) s0_107 + 0x0068;
	while (true)
	{
		Eq_2 a0_77;
		Eq_2 a1_78;
		word32 a2_385;
		word32 a5_386;
		word32 s2_387;
		word32 s3_388;
		word32 s4_389;
		word32 s8_390;
		Eq_2 a4_129;
		Eq_2 a3_130;
		Eq_2 s1_85 = net_buf_get(ra_106, s0_107, s1_108, 0x00, a3_100, a4_101, mstatus, dwArg28, dwArgD8, dwArg0118, out a0_77, out a1_78, out a2_385, out a3_130, out a4_129, out a5_386, out s2_387, out s3_388, out s4_389, out s8_390);
		if (a0_77 == 0x00)
			break;
		word32 s3_356;
		word32 a5_354;
		word32 a1_352;
		word32 s5_358;
		word32 s6_359;
		word32 s8_360;
		word32 s4_357;
		word32 s2_355;
		word32 a2_353;
		word32 a0_351;
		ra_106 = net_buf_unref(ra_106, s1_85, a0_77, a1_78, a4_129, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_107, out s1_108, out a0_351, out a1_352, out a2_353, out a3_100, out a4_101, out a5_354, out s2_355, out s3_356, out s4_357, out s5_358, out s6_359, out s8_360, out mstatus);
	}
	Eq_2 s1_122 = (word32) s0_107 + 0x008C;
	while (true)
	{
		Eq_2 a0_133;
		Eq_2 a1_134;
		Eq_2 a4_137;
		word32 a2_391;
		word32 a3_392;
		word32 a5_393;
		word32 s2_394;
		word32 s3_395;
		word32 s4_396;
		word32 s8_397;
		Eq_2 s1_141 = net_buf_get(ra_106, s0_107, s1_122, 0x00, a3_130, a4_129, mstatus, dwArg28, dwArgD8, dwArg0118, out a0_133, out a1_134, out a2_391, out a3_392, out a4_137, out a5_393, out s2_394, out s3_395, out s4_396, out s8_397);
		if (a0_133 == 0x00)
			break;
		word32 a2_363;
		word32 a5_364;
		word32 s2_365;
		word32 s3_366;
		word32 a1_362;
		word32 a0_361;
		word32 s4_367;
		word32 s5_368;
		word32 s6_369;
		word32 s8_370;
		ra_106 = net_buf_unref(ra_106, s1_141, a0_133, a1_134, a4_137, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_107, out s1_122, out a0_361, out a1_362, out a2_363, out a3_130, out a4_129, out a5_364, out s2_365, out s3_366, out s4_367, out s5_368, out s6_369, out s8_370, out mstatus);
	}
	if (a0_133 != 0x00)
	{
		struct Eq_288902 * s0_189;
		word32 s1_371;
		word32 a0_372;
		word32 a1_373;
		word32 a2_374;
		word32 a3_375;
		word32 a4_376;
		word32 a5_377;
		word32 s2_378;
		word32 s3_379;
		word32 s4_380;
		word32 s5_381;
		word32 s6_382;
		word32 s8_383;
		word32 mstatus_384;
		net_buf_unref(ra_106, s1_141, a0_133, a1_134, a4_137, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_189, out s1_371, out a0_372, out a1_373, out a2_374, out a3_375, out a4_376, out a5_377, out s2_378, out s3_379, out s4_380, out s5_381, out s6_382, out s8_383, out mstatus_384);
		s0_189->dw0078 = 0x00;
		s0_189->w007C = 0x00;
	}
}

// 230510FA: void l2cap_chan_tx_init(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148)
void l2cap_chan_tx_init(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148)
{
	Eq_2 a3_16;
	Eq_2 a4_17;
	Eq_2 a5_18;
	Eq_2 a3_29;
	Eq_2 a4_30;
	Eq_2 a5_31;
	word32 t1_82;
	word32 a0_83;
	word32 a1_84;
	word32 a2_85;
	word32 s1_86;
	word32 a0_87;
	word32 a1_88;
	word32 s2_89;
	word32 s3_90;
	word32 s4_91;
	word32 s5_92;
	word32 s6_93;
	word32 s7_94;
	word32 s8_95;
	Eq_2 ra_41 = k_sem_init(memset(ra, (word32) a0 + 84, 0x00, 0x14, out t1_82, out a0_83, out a1_84, out a2_85, out a3_16, out a4_17, out a5_18), a0, (word32) a0 + 92, 0x00, ~0x00, a3_16, a4_17, a5_18, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgD8, dwArg0118, out s1_86, out a0_87, out a1_88, out a3_29, out a4_30, out a5_31, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95);
	word32 a3_96;
	word32 a4_97;
	word32 a5_98;
	word32 s2_99;
	word32 s3_100;
	k_queue_init(ra_41, 0x14, a3_29, a4_30, a5_31, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out a3_96, out a4_97, out a5_98, out s2_99, out s3_100);
}

// 2305112A: void l2cap_chan_rx_init(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_289067) a0, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void l2cap_chan_rx_init(Eq_2 ra, Eq_2 s0, struct Eq_289067 * a0, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	if ((word32) a0->w0042 == 0x00)
		a0->w0042 = 0xF5;
	struct Eq_289082 * a5_10 = (word32) a0->w0046;
	Eq_2 a4_11 = (word32) a0->w0042;
	if (a5_10 == null)
	{
		ui32 a5_14;
		a0 = a5_10->ptr0004;
		if (a5_10->dw000C != 0x00)
			a5_14 = (word32) a4_11 + 0x00F6 ^ 0x00F7;
		else
			a5_14 = 0x09;
		a0->w0046 = (word16) a5_14;
	}
	Eq_2 a5_24 = a4_11;
	if (a4_11 > 0x00F5)
		a5_24.u0 = 0x00F5;
	Eq_2 a5_27 = (word32) a5_24 + 2;
	a0->w0044 = (word16) a5_27;
	ptr32 a0_33 = &a0->w0046 + 1;
	word32 s7_125;
	word32 s5_123;
	word32 s4_122;
	word32 s8_126;
	word32 s6_124;
	word32 a4_118;
	word32 a5_119;
	word32 s3_121;
	word32 s2_120;
	word32 s1_114;
	word32 a0_115;
	word32 a3_117;
	word32 a1_116;
	k_sem_init(ra, s0, a0_33, 0x00, ~0x00, 0x00F5, a4_11, a5_27, mstatus, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArgE8, dwArg0128, out s1_114, out a0_115, out a1_116, out a3_117, out a4_118, out a5_119, out s2_120, out s3_121, out s4_122, out s5_123, out s6_124, out s7_125, out s8_126);
}

// 2305117C: void l2cap_accept(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void l2cap_accept(Eq_2 ra, word32 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 a4_10;
	struct Eq_289170 * a4_6 = *a3;
	if (a3 != 0x00)
	{
		if (a4_6->dw0098 != 0x00)
		{
			word32 s11_137;
			word32 s10_136;
			word32 s9_135;
			word32 s8_134;
			word32 s7_133;
			word32 s6_132;
			word32 s5_131;
			word32 s4_130;
			word32 s3_129;
			word32 s2_128;
			word32 a7_127;
			word32 a5_126;
			word32 a4_125;
			word32 a3_124;
			word32 a2_123;
			word32 a1_122;
			word32 a0_121;
			word32 s1_120;
			word32 t4_138;
			printf(ra, &g_t230BB6AC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out a7_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138);
			return;
		}
		a4_10 = 0x01;
	}
	else
		a4_10 = 0x00;
	struct Eq_289225 * a4_13 = a4_10 + 0x0098;
	g_dw4200DE8C = &a4_13->dw42016824;
	a4_13->dw42016824 = a1;
}

