pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230511CC: Register Eq_2 l2cap_create_le_sig_pdu.isra.7(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_289254 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_le_param_update
//      l2cap_chan_send_credits.isra.10
//      l2cap_le_conn_req
//      l2cap_send_reject
//      bt_l2cap_chan_disconnect
Eq_2 l2cap_create_le_sig_pdu.isra.7(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_289254 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_130;
	ptr32 a5_133;
	ptr32 mstatus_34;
	word32 s1_166;
	word32 a1_167;
	word32 a2_168;
	word32 s6_169;
	word32 s11_170;
	Eq_2 a4_132;
	Eq_2 a3_131;
	Eq_289254 s0_137;
	ptr32 s2_140;
	ptr32 s3_141;
	ptr32 s5_142;
	ptr32 s7_144;
	ptr32 s9_145;
	Eq_2 ra_136 = bt_conn_create_pdu_timeout(ra, 0x00, 2000, a3, a4, a5, s5, mstatus, s2, dwArg30, dwArg34, dwArg58, dwArg74, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s0_137, out s1_166, out a1_167, out a2_168, out a3_131, out a4_132, out s2_140, out s3_141, out s5_142, out s6_169, out s7_144, out s9_145, out s11_170, out mstatus_34);
	ptr32 s1_56 = 0x00;
	if (true)
	{
		word32 a0_171;
		word32 a2_172;
		word32 a7_173;
		word32 s4_174;
		word32 s6_175;
		word32 s8_176;
		word32 s10_177;
		word32 s11_178;
		word32 t4_179;
		ra_136 = printf(ra_136, &g_t230BB728, a3_131, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_56, out a0_171, out a1_130, out a2_172, out a3_131, out a4_132, out a5_133, out a7_173, out s2_140, out s3_141, out s4_174, out s5_142, out s6_175, out s7_144, out s8_176, out s9_145, out s10_177, out s11_178, out t4_179);
	}
	else
	{
		Eq_2 a0_59 = net_buf_simple_add(0x08, 0x04, a4_132, out a1_130, out a5_133);
		*((word32) a0_59 + 2) = (byte) s0_137;
		*a0_59 = (byte) s2_140;
		*((word32) a0_59 + 1) = (byte) s3_141;
		*((word32) a0_59 + 3) = (byte) (s0_137 >> 8);
		s0_137 >>= 8;
	}
	s0Out = s0_137;
	s1Out = s1_56;
	a0Out = s1_56;
	a1Out = a1_130;
	a3Out = a3_131;
	a4Out = a4_132;
	a5Out = a5_133;
	s2Out = s2_140;
	s3Out = s3_141;
	s4Out = dwArg04;
	s5Out = s5_142;
	s7Out = s7_144;
	s9Out = s9_145;
	mstatusOut = mstatus_34;
	return ra_136;
}

// 23051228: void l2cap_chan_tx_give_credits(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void l2cap_chan_tx_give_credits(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg00, word32 dwArg04, word32 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	Eq_2 s0_14 = a0;
	word32 s1_15 = 0x0FFFFFFF;
	Eq_2 s2_16 = (word32) a0 + 92;
	while ((word32) (word16) (a1 + ~0x00) != s1_15)
	{
		word32 s11_257;
		word32 s10_256;
		word32 s9_255;
		word32 s8_254;
		word32 s7_253;
		word32 s6_252;
		word32 s5_251;
		word32 s4_250;
		word32 s3_249;
		word32 a2_248;
		word32 a0_247;
		ra = k_sem_give(ra, s2_16, a3, a4, a5, mstatus, dwLoc0C, dwLoc08, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArgE8, dwArg0128, dwArg0168, out s0_14, out s1_15, out a0_247, out a1, out a2_248, out a3, out a4, out a5, out s2_16, out s3_249, out s4_250, out s5_251, out s6_252, out s7_253, out s8_254, out s9_255, out s10_256, out s11_257);
	}
	ui32 a0_64;
	struct Eq_289422 * a5_69;
	word32 s4_262;
	word32 s8_263;
	word32 a4_261;
	word32 a3_260;
	word32 a2_259;
	word32 a1_258;
	Eq_2 s1_70 = atomic_or(s0_14, 0x01, a3, a4, mstatus, out a0_64, out a1_258, out a2_259, out a3_260, out a4_261, out a5_69, out s4_262, out s8_263);
	if ((a0_64 & 0x01) == 0x00)
		return;
	word32 s0_76 = a5_69->dw0004;
	<anonymous> * t1_77 = a5_69->ptr0018;
	if (t1_77 == null)
		return;
	word32 a5_99;
	word32 t1_100;
	word32 mstatus_106;
	word32 a4_107;
	word32 a3_108;
	word32 a7_109;
	word32 s3_110;
	word32 s5_111;
	word32 s6_112;
	word32 t0_113;
	word32 t4_114;
	word32 t5_115;
	word32 t6_116;
	word32 tp_117;
	word32 s10_118;
	word32 s11_119;
	word32 s7_120;
	word32 s9_121;
	t1_77();
}

// 23051288: void l2cap_disconnected()
void l2cap_disconnected()
{
}

// 2305128A: Register Eq_2 bt_l2cap_chan_remove(Register Eq_2 a1, Register Eq_2 a5, Register out Eq_2 a5Out)
// Called from:
//      l2cap_rtx_timeout
//      bt_l2cap_encrypt_change
Eq_2 bt_l2cap_chan_remove(Eq_2 a1, Eq_2 a5, union Eq_2 & a5Out)
{
	if (a5 != 0x00)
	{
		a5 = (word32) a5 - 8;
		a4.u0 = 0x00;
		while (a5 != 0x00)
		{
			Eq_2 a2_9 = (word32) a5 + 8;
			if (a5 == a1)
			{
				sys_slist_remove(a4, a4, a5);
				a5Out = a5;
				return a4;
			}
			a5 = *((word32) a5 + 8);
			if (a5 == 0x00)
				break;
			a5 = (word32) a5 - 8;
			a4 = a2_9;
		}
	}
	a5Out = a5;
	return a4;
}

