pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230512B2: Register Eq_2 bt_l2cap_chan_del(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out)
// Called from:
//      l2cap_rtx_timeout
//      bt_l2cap_disconnected
//      bt_l2cap_encrypt_change
Eq_2 bt_l2cap_chan_del(Eq_2 ra, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s5Out)
{
	Eq_2 a0_11 = *a5;
	Eq_2 s0_10 = a0_11;
	if (a5 != 0x00)
	{
		a0_11 = *((word32) a5 + 4);
		a5 = *((word32) a5 + 4);
		if (a5 != 0x00)
		{
			word32 a6_85;
			word32 a1_83;
			word32 a7_86;
			word32 s3_89;
			word32 s4_90;
			word32 s6_92;
			word32 s8_93;
			word32 t0_94;
			word32 t1_95;
			word32 t3_96;
			word32 t4_97;
			word32 t5_98;
			word32 t6_99;
			word32 tp_100;
			a5();
		}
		*s0_10 = 0x00;
	}
	struct Eq_289525 * s0_24 = *((word32) a5 + 0x0C);
	s0_24->b0038 = 0x00;
	s0_24->w003A = 0x00;
	if (a5 != 0x00)
	{
		word32 a1_103;
		word32 a6_105;
		word32 a7_106;
		word32 s3_109;
		word32 s4_110;
		word32 s6_112;
		word32 s8_113;
		word32 t0_114;
		word32 t1_115;
		word32 t3_116;
		word32 t4_117;
		word32 t5_118;
		word32 t6_119;
		word32 tp_120;
		a5();
	}
	Eq_2 s0_40 = *((word32) a5 + 32);
	if (a5 == 0x00)
	{
		a0Out = a0_11;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s5Out = s5;
		return s1;
	}
	else
	{
		Eq_2 a0_57;
		ptr32 a3_60;
		Eq_2 a4_61;
		Eq_2 a5_62;
		ptr32 s2_66;
		ptr32 s5_69;
		word32 s6_259;
		word32 s8_260;
		word32 a2_256;
		word32 s3_257;
		word32 s4_258;
		Eq_2 s1_65 = k_delayed_work_del_timer((word32) s0_40 + 16, a4, a5, mstatus, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a0_57, out a2_256, out a3_60, out a4_61, out a5_62, out s2_66, out s3_257, out s4_258, out s5_69, out s6_259, out s8_260);
		a0Out = a0_57;
		a3Out = a3_60;
		a4Out = a4_61;
		a5Out = a5_62;
		s2Out = s2_66;
		s5Out = s5_69;
		return s1_65;
	}
}

// 230512F4: void l2cap_rtx_timeout(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128)
void l2cap_rtx_timeout(Eq_2 ra, word32 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgE8, Eq_2 dwArg0128)
{
	Eq_2 a5_18;
	word32 s1_90;
	word32 a0_91;
	word32 a1_92;
	word32 a2_93;
	word32 a3_94;
	word32 a4_95;
	word32 a7_96;
	word32 s2_97;
	word32 s3_98;
	word32 s4_99;
	word32 s5_100;
	word32 s6_101;
	word32 s7_102;
	word32 s8_103;
	word32 s9_104;
	word32 s10_105;
	word32 s11_106;
	word32 t4_107;
	Eq_2 ra_25 = printf(ra, &g_t230BB940, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_90, out a0_91, out a1_92, out a2_93, out a3_94, out a4_95, out a5_18, out a7_96, out s2_97, out s3_98, out s4_99, out s5_100, out s6_101, out s7_102, out s8_103, out s9_104, out s10_105, out s11_106, out t4_107);
	Eq_2 a5_45;
	Eq_2 a4_44 = bt_l2cap_chan_remove(a0 + -16, a5_18, out a5_45);
	word32 a0_108;
	word32 a3_109;
	word32 a4_110;
	word32 a5_111;
	word32 s2_112;
	word32 s5_113;
	bt_l2cap_chan_del(ra_25, a4_44, a5_45, mstatus, dwArg34, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a0_108, out a3_109, out a4_110, out a5_111, out s2_112, out s5_113);
}

// 23051328: Register ptr32 bt_l2cap_disconnected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 a3Out, Register out Eq_2 a4Out)
// Called from:
//      conn_update_timeout
ptr32 bt_l2cap_disconnected(Eq_2 ra, Eq_2 s0, Eq_2 a4, word32 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & a3Out, union Eq_2 & a4Out)
{
	if (a5 == 0x00 || a5 == ~0x07)
	{
		a3Out = a3;
		a4Out = a4;
		return s1;
	}
	else
	{
		Eq_2 a5_12 = *s0;
		if (s0 != 0x00)
			s0 = (word32) s0 - 8;
		while (true)
		{
			ptr32 a3_23;
			word32 s5_152;
			word32 s2_151;
			word32 a0_150;
			ptr32 s1_28 = bt_l2cap_chan_del(ra, a4, a5_12, mstatus, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_150, out a3_23, out a4, out a5_12, out s2_151, out s5_152);
			if (s0 == 0x00)
				break;
			if (a5_12 != 0x00)
				a5_12 = (word32) a5_12 - 8;
			s0 = a5_12;
		}
		a3Out = a3_23;
		a4Out = a4;
		return s1_28;
	}
}

// 2305135A: Register Eq_2 bt_l2cap_create_pdu_timeout(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out ptr32 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_create_pdu.isra.7
//      bt_att_create_pdu
Eq_2 bt_l2cap_create_pdu_timeout(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArg0108, ptr32 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a3_15;
	ptr32 a4_16;
	ptr32 mstatus_20;
	ptr32 s1_23;
	ptr32 s2_24;
	ptr32 s3_25;
	ptr32 s5_27;
	ptr32 s6_28;
	ptr32 a2_37;
	ptr32 s11_39;
	word32 s0_61;
	word32 a1_62;
	word32 s7_63;
	word32 s9_64;
	Eq_2 ra_21 = bt_conn_create_pdu_timeout(ra, a0, a2, a3, a4, a5, s5, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg94, dwArg9C, dwArgA8, dwArgE8, dwArg0108, out s0_61, out s1_23, out a1_62, out a2_37, out a3_15, out a4_16, out s2_24, out s3_25, out s5_27, out s6_28, out s7_63, out s9_64, out s11_39, out mstatus_20);
	s1Out = s1_23;
	a2Out = a2_37;
	a3Out = a3_15;
	a4Out = a4_16;
	s2Out = s2_24;
	s3Out = s3_25;
	s5Out = s5_27;
	s6Out = s6_28;
	s11Out = s11_39;
	mstatusOut = mstatus_20;
	return ra_21;
}

// 23051360: Register Eq_2 bt_l2cap_send_cb(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register uint32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_289825) s2Out, Register out (ptr32 Eq_289826) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_l2cap_send
//      l2cap_chan_le_send
//      smp_send.isra.9
//      smp_error
//      bt_smp_start_security
//      att_send
//      bt_att_encrypt_change
//      att_indicate
//      att_mtu_req
//      send_err_rsp.part.7
//      att_read_group_req
//      att_read_mult_req
//      att_read_req
//      att_read_type_req
//      att_find_type_req
//      att_find_info_req
//      att_signed_write_cmd
//      bt_att_req_send
Eq_2 bt_l2cap_send_cb(Eq_2 ra, Eq_2 s1, Eq_2 a0, uint32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_289825 & s2Out, struct Eq_289826 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a4_27;
	Eq_2 a0_25 = net_buf_simple_push(0x04, a5, out a4_27);
	word32 a5_29 = (word32) *((word32) a2 + 0x0C);
	*((word32) a0_25 + 2) = (byte) a1;
	uint32 a5_33 = a5_29 + ~0x03 << 16;
	*a0_25 = (byte) (a5_33 >> 16);
	*((word32) a0_25 + 1) = (byte) (a5_33 >> 24);
	*((word32) a0_25 + 3) = (byte) (a1 >> 8);
	ptr32 a0_50;
	ptr32 a1_51;
	ptr32 a3_53;
	ptr32 a4_54;
	ptr32 a5_55;
	ptr32 s0_59;
	ptr32 s1_60;
	ptr32 s10_61;
	ptr32 s11_62;
	struct Eq_289825 * s2_63;
	struct Eq_289826 * s3_64;
	ptr32 s4_65;
	ptr32 s5_66;
	ptr32 s6_67;
	ptr32 s7_68;
	ptr32 s8_69;
	ptr32 s9_70;
	ptr32 mstatus_78;
	Eq_2 ra_58 = bt_conn_send_cb(ra, dwArgA4, a0, a2, a3, a4_27, a4_27, mstatus, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, dwArg58, s1, dwArg74, dwArg7C, dwArg88, dwArg8C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_59, out s1_60, out a0_50, out a1_51, out a3_53, out a4_54, out a5_55, out s2_63, out s3_64, out s4_65, out s5_66, out s6_67, out s7_68, out s8_69, out s9_70, out s10_61, out s11_62, out mstatus_78);
	s0Out = s0_59;
	s1Out = s1_60;
	a0Out = a0_50;
	a1Out = a1_51;
	a3Out = a3_53;
	a4Out = a4_54;
	a5Out = a5_55;
	s2Out = s2_63;
	s3Out = s3_64;
	s4Out = s4_65;
	s5Out = s5_66;
	s6Out = s6_67;
	s7Out = s7_68;
	s8Out = s8_69;
	s9Out = s9_70;
	s10Out = s10_61;
	s11Out = s11_62;
	mstatusOut = mstatus_78;
	return ra_58;
}

// 230513B4: Register Eq_2 bt_l2cap_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register uint32 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_289945) s0Out, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_289951) s2Out, Register out Eq_289952 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_le_param_update
//      l2cap_chan_send_credits.isra.10
//      l2cap_le_conn_req
//      l2cap_send_reject
//      l2cap_chan_le_send
//      bt_l2cap_chan_disconnect
Eq_2 bt_l2cap_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, uint32 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, struct Eq_289945 & s0Out, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_289951 & s2Out, union Eq_289952 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a1_14;
	ptr32 a3_16;
	ptr32 a4_17;
	ptr32 a5_18;
	ptr32 mstatus_21;
	struct Eq_289945 * s0_23;
	ptr32 s1_24;
	struct Eq_289951 * s2_27;
	Eq_289952 s3_28;
	ptr32 s5_30;
	ptr32 s6_31;
	ptr32 s7_32;
	ptr32 s9_34;
	word32 a0_79;
	word32 s4_80;
	word32 s8_81;
	word32 s10_82;
	word32 s11_83;
	Eq_2 ra_22 = bt_l2cap_send_cb(ra, s1, a0, a1, a2, 0x00, a5, mstatus, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, dwArg58, dwArg74, dwArg7C, dwArg88, dwArg8C, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_23, out s1_24, out a0_79, out a1_14, out a3_16, out a4_17, out a5_18, out s2_27, out s3_28, out s4_80, out s5_30, out s6_31, out s7_32, out s8_81, out s9_34, out s10_82, out s11_83, out mstatus_21);
	s0Out = s0_23;
	s1Out = s1_24;
	a1Out = a1_14;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s2Out = s2_27;
	s3Out = s3_28;
	s5Out = s5_30;
	s6Out = s6_31;
	s7Out = s7_32;
	s9Out = s9_34;
	mstatusOut = mstatus_21;
	return ra_22;
}

