pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230513BC: Register Eq_2 l2cap_chan_send_credits.isra.10(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_290043) s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      l2cap_chan_le_recv_seg
//      l2cap_rx_process
Eq_2 l2cap_chan_send_credits.isra.10(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a1Out, union Eq_2 & a4Out, struct Eq_290043 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s0_17 = (word32) *((word32) a0 + 70);
	Eq_2 s2_18 = a0;
	if (a1 < s0_17)
		s0_17 = a1;
	word32 s1_25 = (word32) (word16) s0_17;
	word32 s3_26 = 0x0FFFFFFF;
	Eq_2 s4_28 = (word32) a0 + 72;
	ra_36 = ra;
	while (true)
	{
		Eq_2 ra_36;
		if ((word32) (word16) (s1_25 + ~0x00) == s3_26)
			break;
		word32 s11_347;
		word32 s9_345;
		word32 s10_346;
		word32 s7_343;
		word32 s8_344;
		word32 a2_341;
		word32 s6_342;
		word32 a0_339;
		word32 a1_340;
		word32 s0_338;
		ra_36 = k_sem_give(ra_36, s4_28, a3, a4, a5, mstatus, s0, dwLoc18, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_338, out s1_25, out a0_339, out a1_340, out a2_341, out a3, out a4, out a5, out s2_18, out s3_26, out s4_28, out s5, out s6_342, out s7_343, out s8_344, out s9_345, out s10_346, out s11_347);
	}
	Eq_2 a4_72;
	Eq_2 a5_73;
	get_ident(out a4_72, out a5_73);
	Eq_2 a0_81;
	ptr32 a1_82;
	Eq_2 a4_85;
	ptr32 mstatus_89;
	uint32 s0_91;
	Eq_2 s1_92;
	struct Eq_290043 * s2_95;
	ptr32 s7_100;
	ptr32 s9_102;
	word32 s4_351;
	word32 s5_352;
	word32 a5_349;
	word32 s3_350;
	word32 a3_348;
	Eq_2 ra_90 = l2cap_create_le_sig_pdu.isra.7(ra_36, a3, a4_72, a5_73, s2_18, s5, mstatus, dwLoc28, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg6C, dwArg98, dwArgB8, out s0_91, out s1_92, out a0_81, out a1_82, out a3_348, out a4_85, out a5_349, out s2_95, out s3_350, out s4_351, out s5_352, out s7_100, out s9_102, out mstatus_89);
	if (a0_81 == 0x00)
	{
		0x00 = (int8) dwArg0128;
		s1Out = s1_92;
		a1Out = a1_82;
		a4Out = a4_85;
		s2Out = s2_95;
		s7Out = s7_100;
		s9Out = s9_102;
		mstatusOut = mstatus_89;
		return ra_90;
	}
	else
	{
		word32 a1_353;
		word32 a5_354;
		Eq_2 a0_120 = net_buf_simple_add((word32) a0_81 + 8, 0x04, a4_85, out a1_353, out a5_354);
		uint32 a5_123 = (word32) s2_95->w0040;
		*((word32) a0_120 + 2) = (byte) s0_91;
		*a0_120 = (byte) a5_123;
		*((word32) a0_120 + 1) = (byte) (a5_123 >> 8);
		*((word32) a0_120 + 3) = (byte) (s0_91 >> 8);
		Eq_2 a0_132 = s2_95->t0000;
		0x00 = (int8) dwArg0128;
		ptr32 a1_140;
		Eq_2 a4_143;
		ptr32 mstatus_147;
		Eq_2 s1_150;
		struct Eq_290043 * s2_153;
		ptr32 s7_158;
		ptr32 s9_160;
		word32 s5_359;
		word32 s6_360;
		word32 a5_357;
		word32 s3_358;
		word32 s0_355;
		word32 a3_356;
		Eq_2 ra_148 = bt_l2cap_send(ra_90, s1_92, a0_132, 0x05, dwArg0100, a5_123 >> 8, mstatus_89, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, a0_81, dwArg58, dwArg74, dwArg7C, dwArg88, dwArg8C, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_355, out s1_150, out a1_140, out a3_356, out a4_143, out a5_357, out s2_153, out s3_358, out s5_359, out s6_360, out s7_158, out s9_160, out mstatus_147);
		s1Out = s1_150;
		a1Out = a1_140;
		a4Out = a4_143;
		s2Out = s2_153;
		s7Out = s7_158;
		s9Out = s9_160;
		mstatusOut = mstatus_147;
		return ra_148;
	}
}

// 23051454: Register Eq_2 l2cap_le_conn_req(Register Eq_2 ra, Register (ptr32 Eq_290215) a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_290251) a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_l2cap_encrypt_change
Eq_2 l2cap_le_conn_req(Eq_2 ra, struct Eq_290215 * a0, Eq_2 a3, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, struct Eq_290251 & a5Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	ptr32 a0_136;
	Eq_2 a4_11;
	Eq_2 a5_12;
	a0->b003C = (byte) get_ident(out a4_11, out a5_12);
	Eq_2 a0_21;
	Eq_2 a4_25;
	struct Eq_290268 * s0_31;
	word32 a1_212;
	word32 s3_213;
	word32 s4_214;
	word32 s7_215;
	word32 s9_216;
	Eq_2 a3_110;
	struct Eq_290251 * a5_112;
	ptr32 mstatus_115;
	ptr32 s1_118;
	ptr32 s2_121;
	ptr32 s5_124;
	Eq_2 ra_116 = l2cap_create_le_sig_pdu.isra.7(ra, a3, a4_11, a5_12, s2, s5, mstatus, dwLoc18, dwArg10, dwArg14, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg7C, dwArgA8, dwArgC8, out s0_31, out s1_118, out a0_21, out a1_212, out a3_110, out a4_25, out a5_112, out s2_121, out s3_213, out s4_214, out s5_124, out s7_215, out s9_216, out mstatus_115);
	if (a0_21 != 0x00)
	{
		word32 a1_217;
		word32 a5_218;
		Eq_2 a0_55 = net_buf_simple_add((word32) a0_21 + 8, 0x0A, a4_25, out a1_217, out a5_218);
		uint32 a5_58 = (word32) s0_31->w003A;
		*a0_55 = (byte) a5_58;
		*((word32) a0_55 + 1) = (byte) (a5_58 >> 8);
		uint32 a5_64 = (word32) s0_31->w0040;
		*((word32) a0_55 + 2) = (byte) a5_64;
		*((word32) a0_55 + 3) = (byte) (a5_64 >> 8);
		uint32 a5_68 = (word32) s0_31->w0042;
		*((word32) a0_55 + 4) = (byte) a5_68;
		*((word32) a0_55 + 5) = (byte) (a5_68 >> 8);
		uint32 a5_72 = (word32) s0_31->w0044;
		*((word32) a0_55 + 6) = (byte) a5_72;
		*((word32) a0_55 + 7) = (byte) (a5_72 >> 8);
		uint32 a5_76 = (word32) s0_31->w0046;
		*((word32) a0_55 + 8) = (byte) a5_76;
		*((word32) a0_55 + 9) = (byte) (a5_76 >> 8);
		Eq_2 a0_81;
		Eq_2 a5_85;
		Eq_2 s1_87;
		word32 a1_219;
		word32 a2_220;
		word32 a3_221;
		word32 a4_222;
		word32 s2_223;
		word32 s3_224;
		word32 s4_225;
		word32 s5_226;
		word32 s6_227;
		word32 s8_228;
		k_delayed_work_submit(0x09FFFC40, a3_110, a4_25, mstatus_115, dwLoc1C, dwLoc18, dwArg04, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_87, out a0_81, out a1_219, out a2_220, out a3_221, out a4_222, out a5_85, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s8_228);
		word32 s0_229;
		word32 a1_230;
		word32 a4_231;
		word32 s3_232;
		word32 s6_233;
		word32 s7_234;
		word32 s9_235;
		ra_116 = bt_l2cap_send(ra_116, s1_87, a0_81, 0x05, a0_21, a5_85, mstatus_115, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_229, out s1_118, out a1_230, out a3_110, out a4_231, out a5_112, out s2_121, out s3_232, out s5_124, out s6_233, out s7_234, out s9_235, out mstatus_115);
		a0_136 = 0x00;
	}
	else
		a0_136 = ~0x0B;
	s1Out = s1_118;
	a0Out = a0_136;
	a3Out = a3_110;
	a5Out = a5_112;
	s2Out = s2_121;
	s5Out = s5_124;
	mstatusOut = mstatus_115;
	return ra_116;
}

