pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230514E8: Register Eq_2 bt_l2cap_encrypt_change(Register Eq_2 ra, Register ptr32 a1, Register Eq_2 a3, Register (ptr32 Eq_273905) a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out ptr32 s1Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
Eq_2 bt_l2cap_encrypt_change(Eq_2 ra, ptr32 a1, Eq_2 a3, struct Eq_273905 * a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg38, ptr32 & s1Out, ptr32 & mstatusOut)
{
	struct Eq_290440 * a0_102 = a5->ptr0040;
	if (a5 != null)
	{
		struct Eq_290446 * sp_101 = fp + ~0x0F;
		ptr32 s1_105 = a1;
		struct Eq_290215 * s0_134 = (char *) a5 - 8;
		Eq_2 s2_106 = 0x01;
		while (s0_134 != null)
		{
			Eq_2 a5_21 = (word32) s0_134[7];
			if (a5_21 == s2_106)
			{
				a5_21 = (word32) s0_134->b003C;
				if (a5_21 == 0x00)
				{
					if (s1_105 != 0x00)
					{
						Eq_2 a5_67;
						word32 a4_312;
						s1_105 = bt_l2cap_chan_del(ra, bt_l2cap_chan_remove(a0_102->dw0000, a5_21, out a5_67), a5_67, mstatus, sp_101->dw0034, sp_101[21], sp_101[23], sp_101[29], sp_101[37], out a0_102, out a3, out a4_312, out a5_21, out s2_106, out s5);
					}
					else
						ra = l2cap_le_conn_req(ra, s0_134, a3, s2_106, s5, mstatus, sp_101->dw0004, sp_101[2], sp_101->dw0014, sp_101[4], sp_101->dw0024, sp_101[5], sp_101[6], sp_101->dw0034, sp_101[7], sp_101->dw0054, sp_101[11], sp_101->dw005C, sp_101[0x0D], sp_101[0x0F], sp_101->dw007C, sp_101->dw0084, sp_101[0x0011], sp_101[19], sp_101[21], sp_101[23], sp_101[25], sp_101[27], sp_101[29], sp_101[31], sp_101[33], sp_101[35], sp_101[37], sp_101[39], out s1_105, out a0_102, out a3, out a5_21, out s2_106, out s5, out mstatus);
				}
			}
			Eq_2 a3_113;
			ptr32 mstatus_112;
			Eq_2 s5_111;
			struct Eq_290469 * s0_104 = *((word32) a5_21 + 4);
			<anonymous> * a5_94 = *((word32) a5_21 + 8);
			if (a5_94 != null)
			{
				word32 a2_109;
				word32 tp_110;
				word32 a4_114;
				word32 a6_115;
				word32 a7_116;
				word32 s10_117;
				word32 s11_118;
				word32 s3_119;
				word32 s4_120;
				word32 s6_121;
				word32 s7_122;
				word32 s8_123;
				word32 s9_124;
				word32 t0_125;
				word32 t1_126;
				word32 t3_127;
				word32 t4_128;
				word32 t5_129;
				word32 t6_130;
				a5_94();
				s5 = s5_111;
				mstatus = mstatus_112;
				a3 = a3_113;
			}
			word32 s0_133 = s0_104[1];
			if (s0_133 == 0x00)
				break;
			s0_134 = s0_133 + ~0x07;
		}
		0x00 = (int8) dwArg38;
		s1Out = s1_105;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		s1Out = s1;
		mstatusOut = mstatus;
		return ra;
	}
}

// 23051548: void l2cap_send_reject(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
// Called from:
//      l2cap_recv
void l2cap_send_reject(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a0_30;
	Eq_2 a4_34;
	ptr32 mstatus_38;
	uint32 s0_40;
	Eq_2 s3_45;
	Eq_2 s4_46;
	Eq_2 s5_47;
	word32 s1_238;
	word32 a1_239;
	word32 a3_240;
	word32 a5_241;
	word32 s2_242;
	word32 s7_243;
	word32 s9_244;
	Eq_2 ra_39 = l2cap_create_le_sig_pdu.isra.7(ra, a3, a4, a5, s2, a0, mstatus, s2, dwArg10, dwArg14, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, dwArg7C, dwArgA8, dwArgC8, out s0_40, out s1_238, out a0_30, out a1_239, out a3_240, out a4_34, out a5_241, out s2_242, out s3_45, out s4_46, out s5_47, out s7_243, out s9_244, out mstatus_38);
	if (a0_30 == 0x00)
		return;
	word32 a1_245;
	Eq_2 a5_110;
	Eq_2 a0_71 = net_buf_simple_add((word32) a0_30 + 8, 0x02, a4_34, out a1_245, out a5_110);
	*a0_71 = (byte) s0_40;
	*((word32) a0_71 + 1) = (byte) (s0_40 >> 8);
	if (s3_45 != 0x00)
	{
		word32 a1_246;
		word32 a2_247;
		word32 a3_248;
		word32 a4_249;
		net_buf_simple_add_mem((word32) a0_30 + 8, s3_45, s4_46, a4_34, out a1_246, out a2_247, out a3_248, out a4_249, out a5_110);
	}
	word32 s0_250;
	word32 s1_251;
	word32 a1_252;
	word32 a3_253;
	word32 a4_254;
	word32 a5_255;
	word32 s2_256;
	word32 s3_257;
	word32 s5_258;
	word32 s6_259;
	word32 s7_260;
	word32 s9_261;
	word32 mstatus_262;
	bt_l2cap_send(ra_39, a0_30, s5_47, 0x05, a0_30, a5_110, mstatus_38, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, dwArg58, dwArg74, dwArg7C, dwArg88, dwArg8C, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_250, out s1_251, out a1_252, out a3_253, out a4_254, out a5_255, out s2_256, out s3_257, out s5_258, out s6_259, out s7_260, out s9_261, out mstatus_262);
}

// 230515BE: Register Eq_2 l2cap_chan_le_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out (ptr32 Eq_2) a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_290819) s2Out, Register out (ptr32 Eq_2) s3Out, Register out Eq_290821 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      l2cap_chan_le_send_sdu
Eq_2 l2cap_chan_le_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s0Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_290819 & s2Out, union Eq_2 & s3Out, union Eq_290821 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & mstatusOut)
{
	union Eq_2 * s3_288;
	Eq_2 s6_113 = (word32) a0 + 92;
	word32 a0_33;
	up32 s3_43;
	word32 a5_1003;
	word32 s4_1004;
	word32 s8_1005;
	word32 s1_1002;
	struct Eq_290819 * s2_109;
	Eq_2 a4_101;
	Eq_2 a1_200;
	Eq_2 a3_100;
	Eq_2 s0_175 = k_sem_take((word32) a0 + 92, 0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_1002, out a0_33, out a1_200, out a3_100, out a4_101, out a5_1003, out s2_109, out s3_43, out s4_1004, out s8_1005);
	if (a0_33 != 0x00)
	{
		s3_288 = (union Eq_2 *) ~0x0A;
		goto l23051630;
	}
	Eq_2 s1_132;
	a4_101 = (word32) s2_109->w0058;
	if (a4_101 >= (word32) (*((word32) s0_175 + 0x0C)) + s3_43)
	{
		uint32 a5_56 = s3_43 + 9 << 16;
		if (net_buf_simple_headroom(a4_101) >= a5_56 >> 16)
		{
			s0_175 = *(a5_56 >> 16);
			if (a5_56 >> 16 == 0x00)
			{
				if (s3_43 != 0x00)
				{
					struct Eq_253562 * a5_205;
					word32 a4_1011;
					a1_200 = net_buf_simple_push_le16((word32) (word16) net_buf_frags_len(s0_175, out a4_1011, out a5_205), a5_205, out a4_101);
				}
				net_buf_ref(s0_175);
				s1_132 = s0_175;
				if (s0_175 == 0x00)
				{
l2305162E:
					s3_288 = (union Eq_2 *) ~0x0B;
					goto l23051630;
				}
				goto l230516BC;
			}
		}
	}
	Eq_2 a5_63;
	net_buf_pool_get((word32) *((word32) s0_175 + 6), out a5_63);
	Eq_2 a0_71;
	Eq_2 a3_74;
	Eq_2 a4_75;
	Eq_2 a5_76;
	Eq_2 s5_86;
	word32 s4_1008;
	word32 s1_1006;
	word32 s6_1009;
	word32 a1_1007;
	word32 s8_1010;
	word32 s3_110;
	Eq_2 s0_107;
	ra = net_buf_alloc_fixed(ra, 0x00, a3_100, a4_101, a5_63, s5, mstatus, dwArg94, dwArgA8, dwArgE8, dwArg0108, out s0_107, out s1_1006, out a0_71, out a1_1007, out a3_74, out a4_75, out a5_76, out s2_109, out s3_110, out s4_1008, out s5_86, out s6_1009, out s8_1010, out mstatus);
	if (a0_71 != 0x00)
		net_buf_simple_reserve((word32 *) 0x09, a5_76);
	else
	{
		word32 s1_1020;
		word32 a2_1021;
		word32 s9_1023;
		word32 s7_1022;
		word32 s11_1024;
		ra = bt_conn_create_pdu_timeout(ra, a0_71, ~0x00, a3_74, a4_75, a5_76, s5_86, mstatus, s2, dwArg30, dwArg34, dwArg58, dwArg74, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s0_107, out s1_1020, out a1_200, out a2_1021, out a3_100, out a4_101, out s2_109, out s3_110, out s5, out s6_113, out s7_1022, out s9_1023, out s11_1024, out mstatus);
		if (a0_71 == 0x00)
			goto l2305162E;
	}
	s1_132 = a0_71;
	if (s3_110 != 0x00)
	{
		Eq_2 a5_139;
		word32 a4_1025;
		word32 a5_1027;
		word32 a4_1026;
		net_buf_simple_add_le16((word32) a0_71 + 8, (word32) (word16) net_buf_frags_len(s0_107, out a4_1025, out a5_139), a5_139, out a4_1026, out a5_1027);
	}
	uint32 a0_159;
	Eq_2 a4_150;
	Eq_2 a0_149 = net_buf_simple_tailroom((word32) a0_71 + 8, out a4_150);
	Eq_2 a5_158 = (word32) s2_109->w0058 - s3_110;
	if (a0_149 < a5_158)
		a0_159 = net_buf_simple_tailroom((word32) a0_71 + 8, out a4_150) << 16;
	else
		a0_159 = a5_158 << 0x10;
	Eq_2 a1_168 = (word32) *((word32) s0_107 + 0x0C);
	Eq_2 a0_170 = a0_159 >> 16;
	if (a0_170 < a1_168)
		a1_168 = a0_170;
	uint32 s4_173 = a1_168 << 0x10;
	s0_175 = *((word32) a1_168 + 8);
	word32 a2_1047;
	word32 a5_1049;
	word32 a3_1048;
	word32 a1_1046;
	net_buf_simple_add_mem((word32) a0_71 + 8, a1_168, s4_173 >> 0x10, a4_150, out a1_1046, out a2_1047, out a3_1048, out a4_101, out a5_1049);
	word32 a5_1050;
	net_buf_simple_pull((word32) s0_175 + 8, s4_173 >> 0x10, out a1_200, out a5_1050);
l230516BC:
	Eq_2 a0_222 = s2_109->t0000;
	if (a0_222 == 0x00)
	{
		word32 s4_1018;
		word32 s1_1013;
		word32 a2_1015;
		word32 a0_1014;
		word32 s8_1019;
		word32 s3_1017;
		word32 a5_1016;
		word32 s0_1012;
		ra = net_buf_unref(ra, s1_132, s0_175, a1_200, a4_101, mstatus, s6, s4, s2, dwArg08, dwArg58, s3, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_1012, out s1_1013, out a0_1014, out a1_200, out a2_1015, out a3_100, out a4_101, out a5_1016, out s2_109, out s3_1017, out s4_1018, out s5, out s6_113, out s8_1019, out mstatus);
		s3_288 = (union Eq_2 *) -54;
		goto l23051630;
	}
	Eq_2 a3_276;
	Eq_2 a4_277;
	Eq_2 a5_235;
	uint32 a1_228 = (word32) s2_109->w0054;
	if (s0_175 != s1_132)
	{
		a5_235 = (word32) *((word32) s0_175 + 0x0C);
		if (a5_235 != 0x00)
		{
l23051738:
			word32 s1_1029;
			word32 s9_1032;
			word32 a5_1030;
			word32 s7_1031;
			word32 s0_1028;
			ra = bt_l2cap_send(ra, s1_132, a0_222, a1_228, s1_132, a5_235, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_1028, out s1_1029, out a1_200, out a3_276, out a4_277, out a5_1030, out s2_109, out s3_288, out s5, out s6_113, out s7_1031, out s9_1032, out mstatus);
			goto l23051710;
		}
	}
	a5_235 = s2_109->ptr0004->t0014;
	if (a5_235 != 0x00)
	{
		word32 s11_1042;
		word32 s10_1041;
		word32 s8_1039;
		word32 s9_1040;
		word32 s7_1038;
		word32 s0_1033;
		word32 s1_1034;
		word32 a0_1035;
		word32 a5_1036;
		word32 s4_1037;
		ra = bt_l2cap_send_cb(ra, s1_132, a0_222, a1_228, s1_132, 0x23051080, a5_235, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_1033, out s1_1034, out a0_1035, out a1_200, out a3_276, out a4_277, out a5_1036, out s2_109, out s3_288, out s4_1037, out s5, out s6_113, out s7_1038, out s8_1039, out s9_1040, out s10_1041, out s11_1042, out mstatus);
l23051710:
		word32 a2_1051;
		if (k_sem_count_get(s6_113, a3_276, a4_277, mstatus, out a2_1051, out a3_100, out a4_101) == 0x00)
		{
			Eq_2 s0_346 = (char *) &s2_109->ptr0004 + 48;
			word32 a2_351;
			word32 s4_356;
			word32 a5_1044;
			word32 s8_1045;
			word32 a0_1043;
			Eq_2 s1_355 = atomic_and(s0_346, ~0x01, a3_100, a4_101, mstatus, out a0_1043, out a1_200, out a2_351, out a3_100, out a4_101, out a5_1044, out s4_356, out s8_1045);
			<anonymous> * a5_361 = s2_109->ptr0004->ptr0018;
			if (a5_361 != null)
			{
				word32 a7_388;
				word32 t0_389;
				word32 t1_390;
				word32 t4_391;
				word32 t5_392;
				word32 t6_393;
				word32 s10_394;
				word32 s11_395;
				word32 s7_396;
				word32 s9_397;
				a5_361();
			}
		}
l23051630:
		0x00 = (int8) dwArgA8;
		s0Out = s1;
		a0Out = s3_288;
		a1Out = a1_200;
		a3Out = a3_100;
		a4Out = a4_101;
		s2Out = s2_109;
		s3Out = s3_288;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6_113;
		mstatusOut = mstatus;
		return ra;
	}
	goto l23051738;
}

// 23051744: void l2cap_chan_le_send_sdu(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void l2cap_chan_le_send_sdu(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	word16 wLoc22_261 = (word16) a2;
	Eq_2 a1_146 = *s0;
	Eq_2 a5_26 = (word32) wLoc22_261;
	Eq_2 s2_109 = a0;
	Eq_2 s3_110 = a1_146;
	word32 a4_574;
	word32 a5_575;
	word32 s4_111 = a5_26 + net_buf_frags_len(s0, out a4_574, out a5_575);
	if ((word32) *((word32) a0 + 86) >= s4_111)
	{
		Eq_2 s0_152;
		Eq_2 a4_102 = (word32) *((word32) s0 + 0x0C);
		s0_152 = s0;
		if (a4_102 == 0x00)
		{
			s0_152 = *a4_102;
			if (a4_102 != 0x00)
				s0_152 = a4_102;
		}
		Eq_2 ra_107;
		Eq_2 s1_108;
		ra_107 = ra;
		if (a5_26 == 0x00)
		{
			Eq_2 a0_54;
			ra_107 = l2cap_chan_le_send(ra, -36, a0, 0x02, a3, a4_102, a5_26, a0, a1_146, s4_111, s5, s6, mstatus, dwLoc28, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg4C, dwArg54, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_152, out a0_54, out a1_146, out a3, out a4_102, out s2_109, out s3_110, out s4_111, out s5, out s6, out mstatus);
			s1_108 = a0_54;
			if (a0_54 < 0x00)
			{
l23051794:
				if (s1_108 == ~0x0A)
				{
					word32 a2_577;
					word32 a3_578;
					word32 a5_580;
					word32 a6_581;
					word32 a1_576;
					word32 a4_579;
					word32 a7_582;
					memcpy((word32) s0_152 + 20, fp + -0x0022, 0x02, out a1_576, out a2_577, out a3_578, out a4_579, out a5_580, out a6_581, out a7_582);
				}
				*s3_110 = s0_152;
				goto l230517AC;
			}
			wLoc22_261 = (word16) a0_54;
		}
		s1_108.u0 = 0x00;
		while ((word32) wLoc22_261 < s4_111)
		{
			Eq_2 a5_103 = (word32) *((word32) s0_152 + 0x0C);
			if (a5_103 == 0x00)
				ra_107 = net_buf_frag_del(ra_107, s0_152, s1_108, 0x00, a4_102, a5_103, mstatus, dwLoc18, dwArg38, dwArg58, ra, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s1_108, out a3, out a4_102, out a5_103, out s2_109, out s3_110, out s4_111, out s5, out s6, out mstatus);
			Eq_2 a0_145;
			ra_107 = l2cap_chan_le_send(ra_107, s1_108, s2_109, 0x00, a3, a4_102, a5_103, s2_109, s3_110, s4_111, s5, s6, mstatus, dwLoc28, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg4C, dwArg54, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_152, out a0_145, out a1_146, out a3, out a4_102, out s2_109, out s3_110, out s4_111, out s5, out s6, out mstatus);
			s1_108 = a0_145;
			if (a0_145 < 0x00)
				goto l23051794;
			wLoc22_261 = (word16) ((word32) a0_145 + (word32) wLoc22_261);
		}
		word32 s0_583;
		word32 s1_584;
		word32 a2_587;
		word32 s6_595;
		word32 s8_596;
		word32 mstatus_597;
		word32 s5_594;
		word32 a5_590;
		word32 s3_592;
		word32 s4_593;
		word32 s2_591;
		word32 a3_588;
		word32 a4_589;
		word32 a0_585;
		word32 a1_586;
		net_buf_unref(ra_107, s1_108, s0_152, a1_146, a4_102, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_583, out s1_584, out a0_585, out a1_586, out a2_587, out a3_588, out a4_589, out a5_590, out s2_591, out s3_592, out s4_593, out s5_594, out s6_595, out s8_596, out mstatus_597);
	}
l230517AC:
	0x00 = (int8) dwArg0128;
}

// 23051800: Register Eq_2 bt_l2cap_le_lookup_tx_cid(Register Eq_2 a0, Register word32 a1)
// Called from:
//      smp_ident_sent
//      att_req_sent
//      att_rsp_sent
Eq_2 bt_l2cap_le_lookup_tx_cid(Eq_2 a0, word32 a1)
{
	Eq_2 a0_11 = *((word32) a0 + 64);
	while (a0_11 != 0x00)
	{
		a0_11 = (word32) a0_11 - 8;
		if (a0_11 == 0x00 || (word32) (*((word32) a0_11 + 84)) == a1)
			return a0_11;
		a0_11 = *((word32) a0_11 + 8);
	}
	return a0_11;
}

