pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23051816: Register Eq_2 bt_l2cap_le_lookup_rx_cid(Register Eq_2 a0, Register Eq_291434 a1, Register out Eq_291434 a5Out)
// Called from:
//      l2cap_chan_add
//      bt_l2cap_recv
//      smp_chan_get
//      att_chan_get
Eq_2 bt_l2cap_le_lookup_rx_cid(Eq_2 a0, Eq_291434 a1, union Eq_291434 & a5Out)
{
	Eq_2 a0_11 = *((word32) a0 + 64);
	while (a0_11 != 0x00)
	{
		a0_11 = (word32) a0_11 - 8;
		if (a0_11 == 0x00)
			break;
		a5 = (word32) *((word32) a0_11 + 64);
		if (a5 == a1)
			break;
		a0_11 = *((word32) a0_11 + 8);
	}
	a5Out = a5;
	return a0_11;
}

// 2305182C: Register Eq_2 l2cap_chan_add(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out (ptr32 uint16) s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_291477 a4Out, Register out Eq_291478 a5Out, Register out (ptr32 Eq_291479) s2Out)
// Called from:
//      bt_l2cap_connected
Eq_2 l2cap_chan_add(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, uint16 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_291477 & a4Out, union Eq_291478 & a5Out, struct Eq_291479 & s2Out)
{
	Eq_2 a3_152;
	Eq_291478 a5_126;
	Eq_291477 a4_127;
	struct Eq_291479 * s2_103;
	Eq_2 s1_128;
	if (a1 != 0x00 && (word32) (*((word32) a1 + 64)) != 0x00)
	{
l23051860:
		word32 a0_371;
		word32 a4_372;
		word32 s3_104;
		word32 s5_375;
		word32 a5_373;
		word32 s4_374;
		k_delayed_work_init(ra, a1, (word32) a1 + 16, a3, a4, mstatus, dwArg74, dwArgA8, dwArgC8, dwArg0108, out a0_371, out a3_152, out a4_372, out a5_373, out s2_103, out s3_104, out s4_374, out s5_375);
		*((word32) a1 + 8) = null;
		word32 * a4_111 = s2_103->ptr0044;
		if (a4_111 == null)
		{
			s2_103->ptr0044 = (word32) a1 + 8;
			s2_103->ptr0040 = (word32) a1 + 8;
		}
		else
		{
			*((word32) a1 + 8) = a4_111;
			s2_103->ptr0044 = (word32) a1 + 8;
		}
		word32 a5_119 = (word32) *((word32) a1 + 64);
		*a1 = s2_103;
		*((word32) a1 + 0x0C) = s3_104;
		uint32 a5_125 = a5_119 + -64 << 16;
		a5_126 = a5_125 >> 16;
		a4_127.u0 = 63;
		s1_128.u0 = 0x01;
		if (a5_125 >> 16 <= 63)
		{
			Eq_2 a3_137;
			Eq_2 a4_138;
			Eq_2 a5_139;
			k_work_init((word32) a1 + 0x0080, a3_152, 63, mstatus, out a3_137, out a4_138, out a5_139);
			word32 s3_392;
			s1_128 = k_queue_init(ra, 0x14, a3_137, a4_138, a5_139, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a3_152, out a4_127, out a5_126, out s2_103, out s3_392);
			*((word32) a1 + 56) = (byte) s1_128;
		}
	}
	else
	{
		Eq_291434 s1_23 = 64;
		do
		{
			if (a1 != 0x00)
			{
				word32 a5_376;
				if (bt_l2cap_le_lookup_rx_cid(a0, s1_23, out a5_376) == null)
				{
					*((word32) a1 + 64) = (word16) s1_23;
					goto l23051860;
				}
			}
			s1_23 = (word32) (word16) ((word32) s1_23.u0 + 1);
		} while (s1_23 != 0x0080);
		word32 s1_377;
		word32 a7_381;
		word32 a0_378;
		word32 a1_379;
		word32 s3_382;
		word32 a2_380;
		word32 s6_385;
		word32 s8_387;
		word32 s7_386;
		word32 t4_391;
		word32 s5_384;
		word32 s4_383;
		word32 s10_389;
		word32 s11_390;
		word32 s9_388;
		ra = printf(ra, &g_t230BB6D8, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_377, out a0_378, out a1_379, out a2_380, out a3_152, out a4_127, out a5_126, out a7_381, out s2_103, out s3_382, out s4_383, out s5_384, out s6_385, out s7_386, out s8_387, out s9_388, out s10_389, out s11_390, out t4_391);
		s1_128.u0 = 0x00;
	}
	s0Out = s1;
	s1Out = s1_128;
	a0Out = s1_128;
	a3Out = a3_152;
	a4Out = a4_127;
	a5Out = a5_126;
	s2Out = s2_103;
	return ra;
}

// 230518F6: void bt_l2cap_connected(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 code) a5, Register ptr32 mstatus)
void bt_l2cap_connected(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, <anonymous> * a5, ptr32 mstatus)
{
	struct Eq_291651 * sp_105 = fp + ~0x1F;
	Eq_2 s2_129 = a0;
	Eq_2 s0_159 = 0x4200EF84;
	Eq_2 s1_121 = 0x4200EFA8;
	while (s0_159 < s1_121)
	{
		Eq_2 a4_146;
		ptr32 mstatus_145;
		Eq_2 a3_144;
		<anonymous> * a5_141;
		int32 a0_33;
		<anonymous> * a5_38;
		Eq_2 a1_39;
		word32 a2_40;
		word32 a7_187;
		word32 s10_188;
		word32 s11_189;
		word32 s3_190;
		word32 s5_191;
		word32 s6_192;
		word32 s7_193;
		word32 s9_194;
		word32 t0_195;
		word32 t4_196;
		word32 tp_197;
		Eq_2 s0_111;
		a5();
		a5 = a5_38;
		if (a0_33 >= 0x00)
		{
			word32 a5_42 = (word32) *s0_111;
			*((word32) a1_39 + 64) = (word16) a5_42;
			*((word32) a1_39 + 84) = (word16) a5_42;
			word32 a0_50;
			struct Eq_291698 * a5_55;
			word32 s1_60;
			Eq_2 a4_113;
			Eq_2 a3_114;
			ra = l2cap_chan_add(ra, s2_129, a1_39, a3, a4, s2_129, mstatus, sp_105->t0008, sp_105->t0050, sp_105->t0054, sp_105->t0074, sp_105->t0078, sp_105->t009C, sp_105->t00A8, sp_105->t00C8, sp_105->t00E8, sp_105->t0108, sp_105->t0128, out s0_111, out s1_60, out a0_50, out a3_114, out a4_113, out a5_55, out s2_129);
			if (a0_50 == 0x00)
				return;
			Eq_2 a4_93;
			ptr32 mstatus_92;
			Eq_2 a3_91;
			word32 a0_76 = a5_55->dw0004;
			<anonymous> * a5_77 = a5_55->ptr0000;
			if (a5_77 != null)
			{
				word32 a5_88;
				word32 a1_89;
				word32 a2_90;
				word32 a7_94;
				word32 s10_95;
				word32 s11_96;
				word32 s3_97;
				word32 s5_98;
				word32 s6_99;
				word32 s7_100;
				word32 s9_101;
				word32 t0_102;
				word32 t4_103;
				word32 tp_104;
				a5_77();
				mstatus = mstatus_92;
				a4_113 = a4_93;
				a3_114 = a3_91;
			}
			struct Eq_291760 * a5_120;
			word32 s8_296;
			word32 a0_292;
			word32 a1_293;
			word32 a2_294;
			word32 s4_295;
			s1_121 = atomic_or(s0_111, 0x01, a3_114, a4_113, mstatus, out a0_292, out a1_293, out a2_294, out a3, out a4, out a5_120, out s4_295, out s8_296);
			word32 a0_126 = a5_120->dw0004;
			a5 = a5_120->ptr0018;
			if (a5 != null)
			{
				word32 a2_143;
				word32 a7_147;
				word32 s10_148;
				word32 s11_149;
				word32 s3_150;
				word32 s5_151;
				word32 s6_152;
				word32 s7_153;
				word32 s9_154;
				word32 t0_155;
				word32 t4_156;
				word32 tp_157;
				a5();
				a5 = a5_141;
				a3 = a3_144;
				mstatus = mstatus_145;
				a4 = a4_146;
			}
		}
		s0_159 = (word32) s0_111 + 0x0C;
	}
}

