pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305196E: Register Eq_2 bt_l2cap_recv(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_recv
Eq_2 bt_l2cap_recv(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, word32 dwArg10, word32 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a4_117;
	Eq_2 a1_114;
	Eq_2 s1_120;
	Eq_2 ra_119;
	Eq_2 s0_15 = a1;
	if ((word32) *((word32) a1 + 0x0C) <= 0x03)
	{
		word32 s8_320;
		word32 s7_319;
		word32 s6_318;
		word32 s5_317;
		word32 s4_316;
		word32 s3_315;
		word32 s2_314;
		word32 a7_313;
		word32 a5_312;
		word32 a3_311;
		word32 a2_310;
		word32 a0_309;
		word32 s9_321;
		word32 s10_322;
		word32 s11_323;
		word32 t4_324;
		ra_119 = printf(ra, &g_t230BB664, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_309, out a1_114, out a2_310, out a3_311, out a4_117, out a5_312, out a7_313, out s2_314, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320, out s9_321, out s10_322, out s11_323, out t4_324);
	}
	else
	{
		word32 a5_307;
		word32 a4_306;
		word32 a1_305;
		Eq_2 a0_20 = net_buf_simple_pull_mem((word32) a1 + 8, 0x04, out a1_305, out a4_306, out a5_307);
		Eq_291434 s1_28 = (word32) *((word32) a0_20 + 3) << 8 | (word32) (*((word32) a0_20 + 2));
		word32 a5_308;
		struct Eq_291533 * a0_30 = bt_l2cap_le_lookup_rx_cid(a0, s1_28, out a5_308);
		if (a0_30 == null)
		{
			word32 a0_336;
			word32 a2_337;
			word32 a3_338;
			word32 a5_339;
			word32 a7_340;
			word32 s2_341;
			word32 s3_342;
			word32 s4_343;
			word32 s5_344;
			word32 s6_345;
			word32 s7_346;
			word32 s8_347;
			word32 s9_348;
			word32 s10_349;
			word32 s11_350;
			word32 t4_351;
			ra_119 = printf(ra, &g_t230BB684, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_336, out a1_114, out a2_337, out a3_338, out a4_117, out a5_339, out a7_340, out s2_341, out s3_342, out s4_343, out s5_344, out s6_345, out s7_346, out s8_347, out s9_348, out s10_349, out s11_350, out t4_351);
		}
		else
		{
			uint32 a5_36 = (word32) a0_30->w0040 + -64 << 16;
			if (a5_36 >> 16 <= 63)
			{
				Eq_2 a3_60;
				Eq_2 a4_61;
				word32 s2_66;
				word32 a0_352;
				word32 a1_353;
				word32 a5_354;
				word32 s3_355;
				word32 s4_356;
				word32 s5_357;
				word32 s6_358;
				word32 s8_359;
				net_buf_put(ra, a1, &a0_30->w0040 + 38, a1, 63, net_buf_ref(a1), mstatus, dwArgD8, dwArg0118, dwArg0158, out a0_352, out a1_353, out a3_60, out a4_61, out a5_354, out s2_66, out s3_355, out s4_356, out s5_357, out s6_358, out s8_359);
				0x00 = dwArg38;
				ptr32 a3_87;
				ptr32 a4_88;
				word32 s1_360;
				word32 a0_361;
				word32 a1_362;
				word32 a5_363;
				word32 s2_364;
				word32 s3_365;
				word32 s4_366;
				word32 s5_367;
				word32 s6_368;
				word32 s8_369;
				s0Out = k_work_submit(s2_66 + 0x0080, a3_60, a4_61, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_360, out a0_361, out a1_362, out a3_87, out a4_88, out a5_363, out s2_364, out s3_365, out s4_366, out s5_367, out s6_368, out s8_369);
				a3Out = a3_87;
				a4Out = a4_88;
				mstatusOut = mstatus;
				return ra;
			}
			word32 s10_214;
			word32 s11_215;
			word32 s7_216;
			word32 s9_217;
			(a5_36 >> 16)->ptr0010();
		}
	}
	0x00 = dwArg38;
	ptr32 a3_173;
	ptr32 a4_174;
	ptr32 mstatus_178;
	Eq_2 s0_180;
	word32 s1_325;
	word32 a0_326;
	word32 a1_327;
	word32 a2_328;
	word32 a5_329;
	word32 s2_330;
	word32 s3_331;
	word32 s4_332;
	word32 s5_333;
	word32 s6_334;
	word32 s8_335;
	Eq_2 ra_179 = net_buf_unref(ra_119, s1_120, s0_15, a1_114, a4_117, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg78, dwArg84, dwArg98, dwArgA4, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, out s0_180, out s1_325, out a0_326, out a1_327, out a2_328, out a3_173, out a4_174, out a5_329, out s2_330, out s3_331, out s4_332, out s5_333, out s6_334, out s8_335, out mstatus_178);
	s0Out = s0_180;
	a3Out = a3_173;
	a4Out = a4_174;
	mstatusOut = mstatus_178;
	return ra_179;
}

// 23051A14: Register (ptr32 Eq_292045) bt_l2cap_update_conn_param(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_le_param_update
//      le_conn_update_complete
struct Eq_292045 * bt_l2cap_update_conn_param(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	Eq_2 a4_15;
	Eq_2 a5_16;
	get_ident(out a4_15, out a5_16);
	Eq_2 a0_24;
	Eq_2 s1_35;
	word32 a1_181;
	word32 a5_182;
	word32 s2_183;
	word32 s3_184;
	word32 s4_185;
	word32 s5_186;
	word32 s7_187;
	word32 s9_188;
	ptr32 a3_155;
	Eq_2 a4_156;
	ptr32 mstatus_160;
	struct Eq_292045 * s0_162;
	Eq_2 ra_33 = l2cap_create_le_sig_pdu.isra.7(ra, a3, a4_15, a5_16, s2, s5, mstatus, dwLoc18, dwArg10, dwArg14, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, dwArg7C, dwArgA8, dwArgC8, out s0_162, out s1_35, out a0_24, out a1_181, out a3_155, out a4_156, out a5_182, out s2_183, out s3_184, out s4_185, out s5_186, out s7_187, out s9_188, out mstatus_160);
	if (a0_24 != 0x00)
	{
		word32 a1_189;
		word32 a5_190;
		Eq_2 a0_58 = net_buf_simple_add((word32) a0_24 + 8, 0x08, a4_156, out a1_189, out a5_190);
		uint32 a5_61 = (word32) s0_162->w0000;
		*a0_58 = (byte) a5_61;
		*((word32) a0_58 + 1) = (byte) (a5_61 >> 8);
		uint32 a5_67 = (word32) s0_162->w0002;
		*((word32) a0_58 + 2) = (byte) a5_67;
		*((word32) a0_58 + 3) = (byte) (a5_67 >> 8);
		uint32 a5_71 = (word32) s0_162->w0004;
		*((word32) a0_58 + 4) = (byte) a5_71;
		*((word32) a0_58 + 5) = (byte) (a5_71 >> 8);
		uint32 a5_75 = (word32) s0_162->w0006;
		*((word32) a0_58 + 6) = (byte) a5_75;
		*((word32) a0_58 + 7) = (byte) (a5_75 >> 8);
		word32 s1_191;
		word32 a1_192;
		word32 a5_193;
		word32 s2_194;
		word32 s3_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s9_199;
		bt_l2cap_send(ra_33, s1_35, s1_35, 0x05, a0_24, a5_75 >> 8, mstatus_160, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_162, out s1_191, out a1_192, out a3_155, out a4_156, out a5_193, out s2_194, out s3_195, out s5_196, out s6_197, out s7_198, out s9_199, out mstatus_160);
	}
	a3Out = a3_155;
	a4Out = a4_156;
	mstatusOut = mstatus_160;
	return s0_162;
}

// 23051A8E: void bt_l2cap_init()
// Called from:
//      bt_conn_init
void bt_l2cap_init()
{
}

// 23051A90: Register Eq_2 bt_l2cap_chan_disconnect(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_292223)) a5, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out (ptr32 Eq_292216) s1Out, Register out ptr32 a1Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      l2cap_chan_le_recv_seg
//      l2cap_rx_process
Eq_2 bt_l2cap_chan_disconnect(Eq_2 ra, Eq_2 a3, struct Eq_292223 ** a5, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, struct Eq_292216 & s1Out, ptr32 & a1Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	struct Eq_292223 * a0_5 = *a5;
	if (a5 == null)
	{
		s1Out = s1;
		a1Out = a1;
		a4Out = a4;
		s2Out = s2;
		s7Out = s7;
		s9Out = s9;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a4_14;
		Eq_2 a5_15;
		a0_5->b003C = (byte) get_ident(out a4_14, out a5_15);
		Eq_2 a0_24;
		Eq_2 a3_27;
		struct Eq_292246 * s0_34;
		word32 a5_255;
		word32 s3_256;
		word32 s4_257;
		word32 s5_258;
		ptr32 a1_174;
		Eq_2 a4_101;
		ptr32 mstatus_105;
		struct Eq_292216 * s1_108;
		Eq_2 s2_111;
		ptr32 s7_116;
		ptr32 s9_118;
		Eq_2 ra_106 = l2cap_create_le_sig_pdu.isra.7(ra, a3, a4_14, a5_15, s2, s5, mstatus, dwLoc18, dwArg10, dwArg14, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg7C, dwArgA8, dwArgC8, out s0_34, out s1_108, out a0_24, out a1_174, out a3_27, out a4_101, out a5_255, out s2_111, out s3_256, out s4_257, out s5_258, out s7_116, out s9_118, out mstatus_105);
		if (a0_24 != 0x00)
		{
			word32 a1_259;
			word32 a5_260;
			Eq_2 a0_58 = net_buf_simple_add((word32) a0_24 + 8, 0x04, a4_101, out a1_259, out a5_260);
			uint32 a5_61 = (word32) s0_34->w0040;
			*a0_58 = (byte) a5_61;
			*((word32) a0_58 + 1) = (byte) (a5_61 >> 8);
			uint32 a5_66 = (word32) s0_34->w0054;
			*((word32) a0_58 + 2) = (byte) a5_66;
			*((word32) a0_58 + 3) = (byte) (a5_66 >> 8);
			Eq_2 a0_71;
			Eq_2 a5_75;
			Eq_2 s1_77;
			word32 a1_261;
			word32 a2_262;
			word32 a3_263;
			word32 a4_264;
			word32 s2_265;
			word32 s3_266;
			word32 s4_267;
			word32 s5_268;
			word32 s6_269;
			word32 s8_270;
			k_delayed_work_submit(2000, a3_27, a4_101, mstatus_105, dwLoc1C, dwLoc18, dwArg04, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_77, out a0_71, out a1_261, out a2_262, out a3_263, out a4_264, out a5_75, out s2_265, out s3_266, out s4_267, out s5_268, out s6_269, out s8_270);
			struct Eq_292348 * s0_107;
			word32 a3_271;
			word32 a5_272;
			word32 s3_273;
			word32 s5_274;
			word32 s6_275;
			ra_106 = bt_l2cap_send(ra_106, s1_77, a0_71, 0x05, a0_24, a5_75, mstatus_105, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_107, out s1_108, out a1_174, out a3_271, out a4_101, out a5_272, out s2_111, out s3_273, out s5_274, out s6_275, out s7_116, out s9_118, out mstatus_105);
			s0_107->b0038 = 0x04;
		}
		s1Out = s1_108;
		a1Out = a1_174;
		a4Out = a4_101;
		s2Out = s2_111;
		s7Out = s7_116;
		s9Out = s9_118;
		mstatusOut = mstatus_105;
		return ra_106;
	}
}

// 23051B08: Register Eq_2 l2cap_chan_le_recv_seg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      l2cap_rx_process
Eq_2 l2cap_chan_le_recv_seg(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	struct Eq_290939 * a0_29;
	Eq_2 s3_15 = *((word32) a0 + 0x0078);
	word32 a5_593;
	word32 a4_592;
	struct Eq_290939 * a0_21 = net_buf_frags_len(s3_15, out a4_592, out a5_593);
	a0_29 = a0_21;
	if ((word32) (word16) a0_21 != 0x00)
	{
		word32 a2_595;
		word32 a5_597;
		word32 a1_594;
		word32 a4_596;
		word32 a7_599;
		word32 a6_598;
		memcpy(fp + -0x0022, (word32) s3_15 + 20, 0x02, out a1_594, out a2_595, out a3, out a4_596, out a5_597, out a6_598, out a7_599);
		a0_29 = fp + -0x0022;
	}
	Eq_2 a1_149;
	Eq_2 a4_135;
	Eq_2 s1_125;
	Eq_2 s2_126;
	ptr32 s7_147;
	struct Eq_274 * a0_332;
	if ((word32) *((word32) a0 + 0x007C) < (word32) (*((word32) a1 + 0x0C)) + (word16) a0_21)
	{
		a0_332 = (struct Eq_274 *) &g_t230BB6F8;
		goto l23051B58;
	}
	Eq_2 a0_59 = (char *) &a0_29->ptr0010 + 4;
	word32 a7_606;
	word32 a6_605;
	word32 a5_604;
	word32 a4_603;
	word32 a3_602;
	word32 a1_600;
	word32 a2_601;
	memcpy(a0_59, fp + -0x0022, 0x02, out a1_600, out a2_601, out a3_602, out a4_603, out a5_604, out a6_605, out a7_606);
	word32 a0_82;
	word32 s3_93;
	Eq_2 s5_95;
	ra = net_buf_append_bytes(ra, a0_59, (word32) *((word32) a1 + 0x0C), *((word32) a1 + 8), 0x00, &g_t23051090, *((word32) a0_59 + 0x0078), dwArgF8, out s1_125, out a0_82, out a1_149, out a3, out s2_126, out s3_93, out s5_95, out s7_147);
	if ((word32) *((word32) s2_126 + 0x0C) != (word32) ((word16) a0_82))
	{
		a0_332 = (struct Eq_274 *) &g_t230BB710;
l23051B58:
		struct Eq_292223 ** a5_343;
		Eq_2 a3_347;
		Eq_2 s2_354;
		Eq_2 s5_357;
		word32 t4_622;
		word32 s11_621;
		word32 s10_620;
		word32 s9_619;
		word32 s8_618;
		word32 s7_617;
		word32 s6_616;
		word32 s4_615;
		word32 s3_614;
		word32 a7_613;
		word32 a4_612;
		word32 a2_611;
		word32 a1_610;
		word32 a0_609;
		word32 s1_608;
		ra = bt_l2cap_chan_disconnect(printf(ra, a0_332, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_608, out a0_609, out a1_610, out a2_611, out a3_347, out a4_612, out a5_343, out a7_613, out s2_354, out s3_614, out s4_615, out s5_357, out s6_616, out s7_617, out s8_618, out s9_619, out s10_620, out s11_621, out t4_622), a3_347, a5_343, s2_354, s5_357, mstatus, dwLoc2C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg4C, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_125, out a1_149, out a4_135, out s2_126, out s7_147, out s9, out mstatus);
		goto l23051B62;
	}
	Eq_2 s0_110 = *((word32) s1_125 + 0x0078);
	Eq_2 a4_113;
	word32 a5_607;
	struct Eq_290939 * a0_112 = net_buf_frags_len(s1_125, out a4_113, out a5_607);
	struct Eq_290939 * a5_115 = (word32) *((word32) s0_110 + 0x007C);
	if (a0_112 < a5_115)
	{
		Eq_2 a3_275;
		word32 a2_623;
		if (k_sem_count_get((word32) s0_110 + 72, a3, a4_113, mstatus, out a2_623, out a3_275, out a4_135) == 0x00)
		{
			a4_135 = (word32) *((word32) s0_110 + 70);
			if (a4_135 == 0x01)
			{
				word32 a5_624;
				Eq_2 a4_282;
				struct Eq_290939 * a0_281 = net_buf_frags_len(s2_126, out a4_282, out a5_624);
				word32 a1_284 = (word32) *((word32) s0_110 + 0x0044);
				s1_125 = (word32) *((word32) s0_110 + 0x007C) + a1_284 + ~0x00 - a0_281 >> a1_284;
				word32 a2_625;
				Eq_2 a3_293;
				a1_149 = (word32) (word16) (s1_125 - k_sem_count_get((word32) s0_110 + 72, a3_275, a4_282, mstatus, out a2_625, out a3_293, out a4_135));
				Eq_2 a5_300 = (int32) (word16) a1_149;
				if (a5_300 > 0x00)
					ra = l2cap_chan_send_credits.isra.10(ra, s0_110, s0_110, a1_149, a3_293, a4_135, a5_300, s5_95, mstatus, dwLoc30, dwLoc2C, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg3C, dwArg44, dwArg4C, dwArg58, s3, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s1_125, out a1_149, out a4_135, out s2_126, out s7_147, out s9, out mstatus);
			}
		}
		goto l23051B62;
	}
	Eq_2 a4_158;
	ptr32 mstatus_162;
	Eq_2 a1_155;
	Eq_2 ra_163;
	Eq_2 s1_165;
	struct Eq_292612 * s0_116 = a5_115->ptr0004;
	s0_116->dw0078 = 0x00;
	s0_116->w007C = 0x00;
	struct Eq_292624 * sp_123;
	Eq_2 s0_124;
	Eq_2 a0_129;
	Eq_2 a5_131;
	Eq_2 a3_136;
	Eq_2 s5_145;
	word32 s10_414;
	word32 s11_415;
	a5_115->ptr0010();
	a1_149 = a0_129;
	if (a0_129 < 0x00)
	{
		if (a0_129 == -0x0044)
			goto l23051B62;
		struct Eq_292223 ** a5_187;
		Eq_2 a3_191;
		Eq_2 s2_198;
		Eq_2 s5_201;
		word32 s1_627;
		word32 a0_628;
		word32 a1_629;
		word32 a2_630;
		word32 a4_631;
		word32 a7_632;
		word32 s3_633;
		word32 s4_634;
		word32 s6_635;
		word32 s7_636;
		word32 s8_637;
		word32 s9_638;
		word32 s10_639;
		word32 s11_640;
		word32 t4_641;
		word32 s2_642;
		ra_163 = bt_l2cap_chan_disconnect(printf(ra, &g_t230B7874, a3_136, sp_123->t0008, sp_123->t0028, sp_123->t0070, sp_123->t0074, sp_123->t0098, sp_123->t00BC, out s1_627, out a0_628, out a1_629, out a2_630, out a3_191, out a4_631, out a5_187, out a7_632, out s2_198, out s3_633, out s4_634, out s5_201, out s6_635, out s7_636, out s8_637, out s9_638, out s10_639, out s11_640, out t4_641), a3_191, a5_187, s2_198, s5_201, mstatus, sp_123->t0004, sp_123->t0010, sp_123->t0014, sp_123->t0020, sp_123->t0024, sp_123->t0028, sp_123->t0030, sp_123->t0034, sp_123->t0038, sp_123->t0054, sp_123->t0058, sp_123->t005C, sp_123->t0068, sp_123->t0078, sp_123->t007C, sp_123->t0084, sp_123->t0088, sp_123->t0098, sp_123->t00A8, sp_123->t00B8, sp_123->t00C8, sp_123->t00D8, sp_123->t00E8, sp_123->t00F8, sp_123->t0108, sp_123->t0118, sp_123->t0128, sp_123->t0138, out s1_165, out a1_155, out a4_158, out s2_642, out s7_147, out s9, out mstatus_162);
	}
	else
	{
		word32 s2_626;
		ra_163 = l2cap_chan_send_credits.isra.10(ra, s0_124, s0_124, s2_126, a3_136, a4_135, a5_131, s5_145, mstatus, sp_123->t0000, sp_123->t0004, sp_123->t0020, sp_123->t0024, sp_123->t0028, sp_123->t0030, sp_123->t0034, sp_123->t0040, sp_123->t0044, sp_123->t0048, sp_123->t004C, sp_123->t0058, sp_123->t006C, sp_123->t0074, sp_123->t007C, sp_123->t0088, sp_123->t008C, sp_123->t0098, sp_123->t00A4, sp_123->t00A8, sp_123->t00B8, sp_123->t00C8, sp_123->t00D8, sp_123->t00E8, sp_123->t00F8, sp_123->t0100, sp_123->t0108, sp_123->t0118, sp_123->t0128, sp_123->t0138, sp_123->t0148, sp_123->t0158, out s1_165, out a1_155, out a4_158, out s2_626, out s7_147, out s9, out mstatus_162);
	}
	word32 s0_643;
	word32 a0_644;
	word32 a2_645;
	word32 a3_646;
	word32 a5_647;
	word32 s3_648;
	word32 s4_649;
	word32 s5_650;
	word32 s6_651;
	word32 s8_652;
	ra = net_buf_unref(ra_163, s1_165, s1_165, a1_155, a4_158, mstatus_162, sp_123->t0000, sp_123->t0004, sp_123->t0008, sp_123->t0028, sp_123->t0078, sp_123->t0084, sp_123->t0098, sp_123->t00A4, sp_123->t00B8, sp_123->t00D8, sp_123->t00E8, sp_123->t00F8, sp_123->t0118, sp_123->t0138, sp_123->t0158, sp_123->t0178, out s0_643, out s1_125, out a0_644, out a1_149, out a2_645, out a3_646, out a4_135, out a5_647, out s2_126, out s3_648, out s4_649, out s5_650, out s6_651, out s8_652, out mstatus);
l23051B62:
	0x00 = (int8) dwArg0128;
	s1Out = s1_125;
	a1Out = a1_149;
	a4Out = a4_135;
	s2Out = s2_126;
	s7Out = s7_147;
	s9Out = s9;
	mstatusOut = mstatus;
	return ra;
}

