pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23051C62: void l2cap_rx_process(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
void l2cap_rx_process(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128)
{
	Eq_2 s0_30 = a0 + -0x0080;
	Eq_2 s3_31 = a0 + 0x0C;
	int32 s5_101 = -0x0044;
	word32 s6_102 = 0x230B8000;
	word32 s7_103 = 0x230BC000;
	word32 s9_104 = 0x230BC000;
	ra_324 = ra;
	while (true)
	{
		Eq_2 ra_324;
		word32 a0_48;
		Eq_2 a2_50;
		Eq_2 a3_51;
		Eq_2 a4_52;
		Eq_2 a5_53;
		union Eq_2 * s4_59;
		word32 s2_627;
		word32 s3_628;
		word32 s8_629;
		word32 a1_626;
		net_buf_get(ra_324, s0_30, s3_31, 0x00, a3, a4, mstatus, dwArg08, dwArgB8, dwArgF8, out a0_48, out a1_626, out a2_50, out a3_51, out a4_52, out a5_53, out s2_627, out s3_628, out s4_59, out s8_629);
		struct Eq_293165 * sp_105 = fp - 48;
		if (a0_48 == 0x00)
			break;
		Eq_2 a4_141;
		ptr32 mstatus_145;
		Eq_2 a1_134;
		Eq_2 s1_107;
		Eq_2 ra_115;
		Eq_2 s2_116;
		Eq_2 a3_172;
		Eq_2 s5_182;
		Eq_2 s2_179;
		Eq_2 ra_175;
		struct Eq_292223 ** a5_168;
		struct Eq_274 * a0_197;
		ptr32 mstatus_126;
		Eq_2 a4_125;
		word32 a0_71;
		Eq_2 a3_74;
		struct Eq_293108 * s1_79;
		Eq_2 s2_80;
		Eq_2 s3_81;
		word32 s4_82;
		word32 s8_83;
		word32 a1_623;
		word32 a4_624;
		word32 a5_625;
		Eq_2 s0_78 = k_sem_take(s4_59, 0x00, a2_50, a3_51, a4_52, a5_53, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_79, out a0_71, out a1_623, out a3_74, out a4_624, out a5_625, out s2_80, out s3_81, out s4_82, out s8_83);
		if (a0_71 != 0x00)
		{
			a0_197 = s9_104 + -0x06AC;
			goto l23051CD4;
		}
		Eq_2 a5_86 = s1_79->tFFFFFFF8;
		if (a5_86 != 0x00)
		{
l23051CEC:
			ra_115 = l2cap_chan_le_recv_seg(ra_324, s0_78, s0_78, s2_80, a3_74, s2_80, s3_81, mstatus, s10, s8, s6, s2, s0, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg44, dwArg48, s5, s3, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1_107, out a1_134, out a4_141, out s2_116, out s7_103, out s9_104, out mstatus_145);
			goto l23051CDE;
		}
		struct Eq_293171 * a4_91;
		word32 a2_631;
		word32 a5_632;
		word32 a1_630;
		Eq_2 a0_88 = net_buf_simple_pull_le16(a5_86, out a1_630, out a2_631, out a4_91, out a5_632);
		a0_197 = s8_83 + -1676;
		if ((word32) s1_79->wFFFFFFC2 >= a0_88)
		{
			struct Eq_293313 * a5_97 = a4_91->ptr000C;
			if (a4_91 == null)
			{
				Eq_2 s0_106;
				Eq_2 s5_110;
				word32 s6_111;
				Eq_2 a0_118;
				Eq_2 a5_124;
				Eq_2 a3_127;
				word32 s11_368;
				a5_97->ptr0010();
				a1_134 = a0_118;
				if (a0_118 != 0x00)
				{
					mstatus_145 = mstatus_126;
					a4_141 = a4_125;
					if (a0_118 == s5_110)
						goto l23051CDE;
					word32 s11_669;
					word32 s7_665;
					word32 s3_662;
					word32 a1_658;
					word32 t4_670;
					word32 s8_666;
					word32 s9_667;
					word32 s10_668;
					word32 s4_663;
					word32 s6_664;
					word32 a2_659;
					word32 a4_660;
					word32 a7_661;
					word32 s1_656;
					word32 a0_657;
					ra_175 = printf(ra_115, s6_111 + -0x078C, a3_127, sp_105->dw0008, sp_105->dw0028, sp_105->dw0070, sp_105->dw0074, sp_105->dw0098, sp_105->dw00BC, out s1_656, out a0_657, out a1_658, out a2_659, out a3_172, out a4_660, out a5_168, out a7_661, out s2_179, out s3_662, out s4_663, out s5_182, out s6_664, out s7_665, out s8_666, out s9_667, out s10_668, out s11_669, out t4_670);
					mstatus = mstatus_126;
					goto l23051CD8;
				}
				ra_115 = l2cap_chan_send_credits.isra.10(ra_115, s0_106, s0_106, 0x01, a3_127, a4_125, a5_124, s5_110, mstatus_126, sp_105->dw0000, sp_105->dw0004, sp_105->dw0020, sp_105->dw0024, sp_105->dw0028, sp_105->dw0030, sp_105->dw0034, sp_105->dw0040, sp_105->dw0044, sp_105->dw0048, sp_105->dw004C, sp_105->dw0058, sp_105->dw006C, sp_105->dw0074, sp_105->dw007C, sp_105->dw0088, sp_105->dw008C, sp_105->dw0098, sp_105->dw00A4, sp_105->dw00A8, sp_105->dw00B8, sp_105->dw00C8, sp_105->dw00D8, sp_105->dw00E8, sp_105->dw00F8, sp_105->dw0100, sp_105->dw0108, sp_105->dw0118, sp_105->dw0128, sp_105->dw0138, sp_105->dw0148, sp_105->dw0158, out s1_107, out a1_134, out a4_141, out s2_116, out s7_103, out s9_104, out mstatus_145);
				goto l23051CDE;
			}
			word32 a0_190;
			a4_91();
			s1_79->dw0FF8 = a0_190;
			if (a0_190 == 0x00)
			{
				a0_197 = s7_103 + -0x0674;
				goto l23051CD4;
			}
			s1_79->w0FFC = (word16) a0_88;
			goto l23051CEC;
		}
l23051CD4:
		word32 s11_654;
		word32 s7_650;
		word32 a7_646;
		word32 a1_643;
		word32 t4_655;
		word32 s8_651;
		word32 s9_652;
		word32 s10_653;
		word32 s3_647;
		word32 s4_648;
		word32 s6_649;
		word32 a2_644;
		word32 a4_645;
		word32 s1_641;
		word32 a0_642;
		ra_175 = printf(ra_324, a0_197, a3_74, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_641, out a0_642, out a1_643, out a2_644, out a3_172, out a4_645, out a5_168, out a7_646, out s2_179, out s3_647, out s4_648, out s5_182, out s6_649, out s7_650, out s8_651, out s9_652, out s10_653, out s11_654, out t4_655);
l23051CD8:
		ra_115 = bt_l2cap_chan_disconnect(ra_175, a3_172, a5_168, s2_179, s5_182, mstatus, sp_105->dw0004, sp_105->dw0010, sp_105->dw0014, sp_105->dw0020, sp_105->dw0024, sp_105->dw0028, sp_105->dw0030, sp_105->dw0034, sp_105->dw0038, sp_105->dw0054, sp_105->dw0058, sp_105->dw005C, sp_105->dw0068, sp_105->dw0078, sp_105->dw007C, sp_105->dw0084, sp_105->dw0088, sp_105->dw0098, sp_105->dw00A8, sp_105->dw00B8, sp_105->dw00C8, sp_105->dw00D8, sp_105->dw00E8, sp_105->dw00F8, sp_105->dw0108, sp_105->dw0118, sp_105->dw0128, sp_105->dw0138, out s1_107, out a1_134, out a4_141, out s2_116, out s7_103, out s9_104, out mstatus_145);
l23051CDE:
		word32 s4_639;
		word32 a1_635;
		word32 s8_640;
		word32 a2_636;
		word32 a5_637;
		word32 s2_638;
		word32 s1_633;
		word32 a0_634;
		ra_324 = net_buf_unref(ra_115, s1_107, s2_116, a1_134, a4_141, mstatus_145, sp_105->dw0000, sp_105->dw0004, sp_105->dw0008, sp_105->dw0028, sp_105->dw0078, sp_105->dw0084, sp_105->dw0098, sp_105->dw00A4, sp_105->dw00B8, sp_105->dw00D8, sp_105->dw00E8, sp_105->dw00F8, sp_105->dw0118, sp_105->dw0138, sp_105->dw0158, sp_105->dw0178, out s0_30, out s1_633, out a0_634, out a1_635, out a2_636, out a3, out a4, out a5_637, out s2_638, out s3_31, out s4_639, out s5_101, out s6_102, out s8_640, out mstatus);
	}
	0x00 = dwArg0128;
	0x00 = (int8) dwArg1C;
}

// 23051D4E: void l2cap_recv(Register Eq_2 ra, Register (ptr32 Eq_293600) a1, Register Eq_2 a3, Register Eq_2 s5, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void l2cap_recv(Eq_2 ra, struct Eq_293600 * a1, Eq_2 a3, Eq_2 s5, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	struct Eq_274 * a0_114;
	if ((word32) a1->w000C <= 0x03)
		a0_114 = (struct Eq_274 *) &g_t230BB754;
	else
	{
		word32 a1_286;
		word32 a4_287;
		word32 a5_288;
		Eq_2 a0_34 = net_buf_simple_pull_mem((char *) a1 + 8, 0x04, out a1_286, out a4_287, out a5_288);
		if (((word32) *((word32) a0_34 + 3) << 8 | (word32) (*((word32) a0_34 + 2))) != (word32) a1->w000C)
		{
			word32 a3_293;
			word32 a2_292;
			word32 a1_291;
			word32 a0_290;
			word32 s1_289;
			word32 a4_294;
			word32 a5_295;
			word32 a7_296;
			word32 s2_297;
			word32 s3_298;
			word32 s4_299;
			word32 s5_300;
			word32 s6_301;
			word32 s7_302;
			word32 s8_303;
			word32 s9_304;
			word32 s10_305;
			word32 s11_306;
			word32 t4_307;
			printf(ra, &g_t230BB774, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_289, out a0_290, out a1_291, out a2_292, out a3_293, out a4_294, out a5_295, out a7_296, out s2_297, out s3_298, out s4_299, out s5_300, out s6_301, out s7_302, out s8_303, out s9_304, out s10_305, out s11_306, out t4_307);
			return;
		}
		if ((word32) *((word32) a0_34 + 1) != 0x00)
		{
			if (((word32) *a0_34 + -1 & 0x00FF) > 0x15)
			{
				Eq_2 a5_52;
				Eq_2 s1_60;
				Eq_2 s2_63;
				word32 a0_327;
				word32 a1_328;
				word32 a2_329;
				word32 a3_330;
				word32 a4_331;
				word32 a7_332;
				word32 s3_333;
				word32 s4_334;
				word32 s5_335;
				word32 s6_336;
				word32 s7_337;
				word32 s8_338;
				word32 s9_339;
				word32 s10_340;
				word32 s11_341;
				word32 t4_342;
				Eq_2 ra_59 = printf(ra, &g_t230BB920, 0x15, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_60, out a0_327, out a1_328, out a2_329, out a3_330, out a4_331, out a5_52, out a7_332, out s2_63, out s3_333, out s4_334, out s5_335, out s6_336, out s7_337, out s8_338, out s9_339, out s10_340, out s11_341, out t4_342);
				Eq_2 a0_77 = *s2_63;
				l2cap_send_reject(ra_59, s1_60, a0_77, 0x00, 0x00, a5_52, s2_63, mstatus, dwLoc40, s8, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg24, dwArg2C, dwArg38, dwArg3C, ra, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108);
				return;
			}
		}
		a0_114 = (struct Eq_274 *) &g_t230BB798;
	}
	word32 s1_308;
	word32 a0_309;
	word32 a1_310;
	word32 a2_311;
	word32 a3_312;
	word32 a4_313;
	word32 a5_314;
	word32 a7_315;
	word32 s2_316;
	word32 s3_317;
	word32 s4_318;
	word32 s5_319;
	word32 s6_320;
	word32 s7_321;
	word32 s8_322;
	word32 s9_323;
	word32 s10_324;
	word32 s11_325;
	word32 t4_326;
	printf(ra, a0_114, a3, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_308, out a0_309, out a1_310, out a2_311, out a3_312, out a4_313, out a5_314, out a7_315, out s2_316, out s3_317, out s4_318, out s5_319, out s6_320, out s7_321, out s8_322, out s9_323, out s10_324, out s11_325, out t4_326);
}

