pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23052310: Register word32 uuid_to_uuid128(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      bt_uuid_cmp
word32 uuid_to_uuid128(Eq_2 a0, Eq_2 a1)
{
	word32 a4_9 = (word32) *a0;
	if (a4_9 == 0x01)
	{
		uint32 a4_18;
		word32 a1_129;
		word32 a2_130;
		word32 a3_131;
		word32 a5_132;
		word32 a7_133;
		memcpy(a1, 0x230BB9D0, 0x11, out a1_129, out a2_130, out a3_131, out a4_18, out a5_132, out a6, out a7_133);
		*((word32) a1 + 0x0D) = (byte) a4_18;
		*((word32) a1 + 0x0F) = (byte) (a4_18 >> 16);
		*((word32) a1 + 0x0E) = (byte) ((word32) (word16) a4_18 >> 8);
		*((word32) a1 + 16) = (byte) (a4_18 >> 24);
		return a6;
	}
	else if (a4_9 == 0x00)
	{
		word32 a1_134;
		word32 a2_135;
		word32 a3_136;
		word32 a4_137;
		word32 a5_138;
		word32 a7_139;
		memcpy(a1, 0x230BB9D0, 0x11, out a1_134, out a2_135, out a3_136, out a4_137, out a5_138, out a6, out a7_139);
		uint32 a4_58 = (word32) *((word32) a0 + 2);
		*((word32) a1 + 0x0D) = (byte) a4_58;
		*((word32) a1 + 0x0E) = (byte) (a4_58 >> 8);
		return a6;
	}
	else
	{
		if (a4_9 != 0x02)
			return a6;
		word32 a6_75;
		word32 a1_140;
		word32 a2_141;
		word32 a3_142;
		word32 a4_143;
		word32 a5_144;
		word32 a7_145;
		memcpy(a1, a0, 0x11, out a1_140, out a2_141, out a3_142, out a4_143, out a5_144, out a6_75, out a7_145);
		return a6_75;
	}
}

// 23052394: Register Eq_2 bt_uuid_cmp(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_266697 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out (ptr32 code) s8Out)
// Called from:
//      bt_gatt_foreach_attr
//      bt_gatt_service_register
//      bt_gatt_notify_cb
//      bt_gatt_indicate
//      gatt_read_type_rsp
//      read_included_uuid_cb
//      gatt_find_info_rsp
//      read_group_cb
//      read_type_cb
//      find_type_cb
//      att_read_group_req
//      att_find_type_req
Eq_2 bt_uuid_cmp(Eq_2 a0, Eq_2 a1, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_266697 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, <anonymous> & s8Out)
{
	Eq_2 a5_14;
	ptr32 a3_13;
	Eq_2 a1_16;
	Eq_2 a0_21;
	Eq_2 a1_25;
	Eq_2 a0_26;
	Eq_266697 a4_11 = (word32) *a1;
	if (a4_11 == (word32) (*a0))
	{
		Eq_2 a0_15;
		a3_13 = 0x01;
		a5_14 = a0;
		if (a4_11 != 0x01)
		{
			if (a4_11 != 0x00)
			{
				a3_13 = 0x02;
				a0_21.u0 = ~0x15;
				a1_16 = a1;
				if (a4_11 != 0x02)
					goto l230523EC;
				a1_25 = (word32) a1 + 1;
				a0_26 = (word32) a0 + 1;
l230523C0:
				a0_21 = memcmp(a0_26, a1_25, 0x10, out a1_16, out a2, out a3_13, out a4_11, out a5_14);
				goto l230523EC;
			}
			a0_15 = (word32) *((word32) a0 + 2);
			a5_14 = (word32) *((word32) a1 + 2);
			a1_16 = a1;
		}
		else
		{
			a0_15 = *((word32) a0 + 4);
			a1_16 = *((word32) a0 + 4);
		}
		a0_21 = a0_15 - a5_14;
l230523EC:
		a0Out = a0_21;
		a1Out = a1_16;
		a2Out = a2;
		a3Out = a3_13;
		a4Out = a4_11;
		a5Out = a5_14;
		a6Out = a6;
		s8Out = dwArgD4;
		return a1;
	}
	else
	{
		uuid_to_uuid128(a0, fp + -56);
		a6 = uuid_to_uuid128(a1, fp + -36);
		a1_25 = fp + -35;
		a0_26 = fp + -55;
		goto l230523C0;
	}
}

// 230523FA: Register (ptr32 Eq_293996) bt_uuid_create(Register (ptr32 Eq_293996) a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a3Out)
// Called from:
//      find_type_cb
//      att_read_group_req
//      att_read_type_req
struct Eq_293996 * bt_uuid_create(struct Eq_293996 * a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a3Out)
{
	Eq_2 a3_16;
	struct Eq_293996 * a5_46;
	if (a2 != 0x04)
	{
		a3_16 = a2;
		if (a2 == 0x10)
		{
			a0->b0000 = 0x02;
			Eq_2 a3_33;
			word32 a7_114;
			word32 a5_112;
			word32 a6_113;
			word32 a2_110;
			word32 a4_111;
			word32 a1_109;
			memcpy(&a0->b0000 + 1, a1, a2, out a1_109, out a2_110, out a3_33, out a4_111, out a5_112, out a6_113, out a7_114);
			a3Out = a3_33;
			return (struct Eq_293996 *) 0x01;
		}
		a5_46 = null;
		if (a2 != 0x02)
		{
l23052426:
			a3Out = a3_16;
			return a5_46;
		}
		a0->b0000 = 0x00;
		a0->w0002 = (word16) ((word32) *((word32) a1 + 1) << 8 | (word32) (*a1));
	}
	else
	{
		a0->b0000 = 0x01;
		ui32 a3_14 = (word32) *((word32) a1 + 1);
		(((word32) *((word32) a1 + 3) << 8 | (word32) (*((word32) a1 + 2))) << 16 | ((word32) (*a1) | a3_14 << 8))->ptr0004 = a0;
		a3_16 = a3_14 << 8;
	}
	a5_46 = (struct Eq_293996 *) 0x01;
	goto l23052426;
}

// 2305246A: Register Eq_2 bt_uuid_to_str(Register Eq_2 ra, Register (ptr32 byte) a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a3Out)
// Called from:
//      discover_func
Eq_2 bt_uuid_to_str(Eq_2 ra, byte * a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArg0128, union Eq_2 & s1Out, ptr32 & a3Out)
{
	ptr32 a3_166;
	Eq_2 ra_170;
	word32 a5_13 = (word32) *a0;
	Eq_2 s1_17 = a1;
	if (a5_13 != 0x01 && a5_13 != 0x00)
	{
		if (a5_13 != 0x02)
		{
			word32 t1_346;
			word32 a0_347;
			word32 a1_348;
			word32 a2_349;
			word32 a4_350;
			word32 a5_351;
			ra_170 = memset(ra, a1, 0x00, a2, out t1_346, out a0_347, out a1_348, out a2_349, out a3_166, out a4_350, out a5_351);
		}
		else
		{
			word32 a2_288;
			word32 a1_287;
			word32 a3_289;
			word32 a4_290;
			word32 a5_291;
			word32 a6_292;
			word32 a7_293;
			memcpy(fp + -32, a0 + 1, 0x02, out a1_287, out a2_288, out a3_289, out a4_290, out a5_291, out a6_292, out a7_293);
			word32 a1_294;
			word32 a2_295;
			word32 a3_296;
			word32 a4_297;
			word32 a5_298;
			word32 a6_299;
			word32 a7_300;
			memcpy(fp + -24, a0 + 3, 0x04, out a1_294, out a2_295, out a3_296, out a4_297, out a5_298, out a6_299, out a7_300);
			word32 a1_301;
			word32 a2_302;
			word32 a3_303;
			word32 a4_304;
			word32 a5_305;
			word32 a6_306;
			word32 a7_307;
			memcpy(fp + -30, a0 + 7, 0x02, out a1_301, out a2_302, out a3_303, out a4_304, out a5_305, out a6_306, out a7_307);
			word32 a1_308;
			word32 a2_309;
			word32 a3_310;
			word32 a4_311;
			word32 a5_312;
			word32 a6_313;
			word32 a7_314;
			memcpy(fp + -28, a0 + 9, 0x02, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out a6_313, out a7_314);
			word32 a1_315;
			word32 a2_316;
			word32 a3_317;
			word32 a4_318;
			word32 a5_319;
			word32 a6_320;
			word32 a7_321;
			memcpy(fp + -26, a0 + 11, 0x02, out a1_315, out a2_316, out a3_317, out a4_318, out a5_319, out a6_320, out a7_321);
			word32 a1_322;
			word32 a2_323;
			word32 a3_324;
			word32 a4_325;
			word32 a5_326;
			word32 a6_327;
			word32 a7_328;
			memcpy(fp + -20, a0 + 0x0D, 0x04, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a6_327, out a7_328);
			word32 s0_329;
			word32 a0_330;
			word32 a1_331;
			word32 a2_332;
			word32 a4_333;
			word32 a5_334;
			word32 a7_335;
			word32 s2_336;
			word32 s3_337;
			word32 s4_338;
			word32 s5_339;
			word32 s6_340;
			word32 s7_341;
			word32 s8_342;
			word32 s9_343;
			word32 s10_344;
			word32 s11_345;
			ra_170 = snprintf(ra, a1, a2, &g_t230BB9B0, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_329, out s1_17, out a0_330, out a1_331, out a2_332, out a3_166, out a4_333, out a5_334, out a7_335, out s2_336, out s3_337, out s4_338, out s5_339, out s6_340, out s7_341, out s8_342, out s9_343, out s10_344, out s11_345);
		}
	}
	else
	{
		word32 s0_352;
		word32 a0_353;
		word32 a1_354;
		word32 a2_355;
		word32 a4_356;
		word32 a5_357;
		word32 a7_358;
		word32 s2_359;
		word32 s3_360;
		word32 s4_361;
		word32 s5_362;
		word32 s6_363;
		word32 s7_364;
		word32 s8_365;
		word32 s9_366;
		word32 s10_367;
		word32 s11_368;
		ra_170 = snprintf(ra, a1, a2, &g_t230BB9C8, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_352, out s1_17, out a0_353, out a1_354, out a2_355, out a3_166, out a4_356, out a5_357, out a7_358, out s2_359, out s3_360, out s4_361, out s5_362, out s6_363, out s7_364, out s8_365, out s9_366, out s10_367, out s11_368);
	}
	0x00 = dwArg0128;
	s1Out = s1_17;
	a3Out = a3_166;
	return ra_170;
}

