pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305252E: Register word32 sys_memcpy_swap(Register (ptr32 Eq_294337) a0, Register Eq_2 a1, Register int32 a2)
// Called from:
//      smp_sign_buf
//      smp_f4
//      smp_f5
//      smp_f6
//      smp_g2
word32 sys_memcpy_swap(struct Eq_294337 * a0, Eq_2 a1, int32 a2)
{
	struct Eq_294340 * a1_10 = (word32) a1 + (a2 + -1);
	struct Eq_294337 * a2_8 = a0 + a2;
	do
	{
		a1_10 = (struct Eq_294340 *) ((char *) a1_10 - 1);
		word32 a5_12 = (word32) a1_10[1];
		++a0;
		a0[0x0FFF] = (struct Eq_294337) (byte) a5_12;
	} while (a2_8 != a0);
	return a5_12;
}

// 23052548: Register Eq_2 sys_mem_swap(Register Eq_2 a0, Register Eq_2 a1, Register out ptr32 a4Out, Register out (ptr32 Eq_294363) a5Out)
// Called from:
//      smp_sign_buf
//      smp_f4
//      smp_f5
//      smp_f6
Eq_2 sys_mem_swap(Eq_2 a0, Eq_2 a1, ptr32 & a4Out, struct Eq_294363 & a5Out)
{
	word32 a5_16 = a0 + a1;
	Eq_2 a1_7 = (word32) a0 + (a1 >> 1);
	do
	{
		ptr32 a4_12 = (word32) *a0;
		a0 = (word32) a0 + 1;
		*((word32) a0 + 0x0FFF) = (byte) (word32) a5_16->bFFFFFFFF;
		a5_16[0x0FFF] = (struct Eq_294363) (byte) a4_12;
		a5_16 = (struct Eq_294363 *) &a5_16->bFFFFFFFF;
	} while (a0 != a1_7);
	a4Out = a4_12;
	a5Out = a5_16;
	return a1_7;
}

// 2305256A: Register word32 get_io_capa(Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a3Out)
// Called from:
//      get_auth.isra.0
//      sec_level_reachable.isra.1
//      get_pair_method
//      smp_security_request
//      smp_pairing_req
//      bt_smp_start_security
word32 get_io_capa(Eq_2 a3, Eq_2 a4, union Eq_2 & a3Out)
{
	word32 a0_16 = 0x03;
	if (g_t42026610 != 0x00)
	{
		struct Eq_294402 * a5_10 = *a4;
		if (a4 != 0x00)
		{
			a5_10 = (struct Eq_294402 *) *((word32) a3 + 4);
			if (a3 != 0x00)
			{
				a5_10 = (struct Eq_294402 *) *((word32) a3 + 8);
				a0_16 = 0x04;
				if (a3 != 0x00)
					goto l230525AE;
				a3 = (word32) g_b4200F4A0;
				if (a3 == 0x00)
				{
					a3Out = a3;
					return 0x04;
				}
				goto l230525A2;
			}
		}
		a3 = (word32) g_b4200F4A0;
		if (a3 == 0x00 || a4 == 0x00)
			goto l230525A2;
		a5_10 = (struct Eq_294402 *) *((word32) a3 + 8);
		a0_16 = 0x01;
		if (a3 == 0x00)
		{
l230525A2:
			a0_16 = 0x02;
			if (a5_10->dw0004 == 0x00)
			{
				a0_16 = 0x03;
				if (a4 != 0x00)
					a0_16 = 0x00;
			}
			goto l230525AE;
		}
	}
l230525AE:
	a3Out = a3;
	return a0_16;
}

// 230525B0: Register Eq_2 smp_chan_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_294461) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      bt_smp_request_ltk
//      bt_smp_auth_passkey_entry
//      bt_smp_start_security
//      bt_smp_update_keys
//      ble_auth_pairing_confirm
//      ble_auth_passkey_confirm
//      ble_auth_cancel
Eq_2 smp_chan_get(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, struct Eq_294461 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	ptr32 a5_11;
	if (bt_l2cap_le_lookup_rx_cid(a0, 0x06, out a5_11) == null)
	{
		word32 a0_100;
		word32 a1_101;
		word32 a2_102;
		word32 a7_103;
		word32 s6_104;
		word32 s7_105;
		word32 s8_106;
		word32 s9_107;
		word32 s10_108;
		word32 s11_109;
		word32 t4_110;
		ra = printf(ra, &g_t230BBE1C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_100, out a1_101, out a2_102, out a3, out a4, out a5_11, out a7_103, out s2, out s3, out s4, out s5, out s6_104, out s7_105, out s8_106, out s9_107, out s10_108, out s11_109, out t4_110);
	}
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_11;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	return ra;
}

// 230525D6: Register Eq_2 atomic_set_bit(Register Eq_2 s0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_294520 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      smp_pairing_complete
//      display_passkey
//      smp_timeout
//      smp_ident_info
//      smp_encrypt_info
//      legacy_request_tk
//      smp_create_pdu.isra.7
//      smp_dhkey_check
//      smp_master_ident
//      smp_init
//      smp_security_request
//      smp_pairing_req
//      bt_smp_dhkey_ready
//      bt_smp_encrypt_change
//      legacy_pairing_confirm
//      smp_pairing_confirm
//      smp_pairing_rsp
//      smp_ident_addr_info
//      smp_public_key
//      bt_smp_pkey_ready
//      smp_pairing_random
//      bt_smp_request_ltk
//      bt_smp_auth_passkey_entry
//      bt_smp_start_security
//      ble_auth_pairing_confirm
//      ble_auth_passkey_confirm
Eq_2 atomic_set_bit(Eq_2 s0, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_294520 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	Eq_2 a1_5 = 0x01 << a1;
	ptr32 a0_10;
	ptr32 a2_12;
	ptr32 a3_13;
	Eq_294520 a4_14;
	ptr32 a5_15;
	ptr32 s4_17;
	word32 a1_26;
	word32 s8_27;
	Eq_2 s1_16 = atomic_or(s0, a1_5, a3, a4, mstatus, out a0_10, out a1_26, out a2_12, out a3_13, out a4_14, out a5_15, out s4_17, out s8_27);
	a0Out = a0_10;
	a2Out = a2_12;
	a3Out = a3_13;
	a4Out = a4_14;
	a5Out = a5_15;
	s4Out = s4_17;
	return s1_16;
}

// 230525E0: Register Eq_2 atomic_test_bit(Register Eq_2 a0, Register word32 a1, Register out ptr32 a2Out)
// Called from:
//      smp_pairing_complete
//      update_keys_check
//      smp_pairing_failed
//      smp_timeout
//      smp_ident_info
//      smp_encrypt_info
//      get_pair_method
//      smp_create_pdu.isra.7
//      smp_dhkey_check
//      bt_smp_distribute_keys
//      smp_signing_info
//      smp_master_ident
//      smp_security_request
//      smp_pairing_req
//      bt_smp_dhkey_ready
//      bt_smp_recv
//      bt_smp_encrypt_change
//      legacy_pairing_confirm
//      smp_pairing_confirm
//      smp_pairing_rsp
//      smp_ident_addr_info
//      bt_smp_pkey_ready
//      smp_pairing_random
//      bt_smp_request_ltk
//      bt_smp_auth_passkey_entry
//      bt_smp_start_security
//      bt_smp_update_keys
//      ble_auth_pairing_confirm
//      ble_auth_passkey_confirm
Eq_2 atomic_test_bit(Eq_2 a0, word32 a1, ptr32 & a2Out)
{
	Eq_2 a0_13 = atomic_get(a0) >> a1 & 0x01;
	a2Out = dwArg44;
	return a0_13;
}

// 230525F8: Register Eq_2 smp_reset(Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out Eq_294568 a4Out, Register out ptr32 a5Out, Register out ptr32 s5Out)
// Called from:
//      smp_pairing_complete
//      bt_smp_connected
//      bt_smp_encrypt_change
//      bt_smp_request_ltk
Eq_2 smp_reset(Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118, union Eq_294568 & a4Out, ptr32 & a5Out, ptr32 & s5Out)
{
	Eq_2 a3_21;
	Eq_2 a4_22;
	ptr32 s5_32;
	word32 s6_151;
	word32 s8_152;
	word32 s3_149;
	word32 s4_150;
	word32 a5_147;
	word32 s2_148;
	word32 a1_145;
	word32 a2_146;
	word32 a0_144;
	Eq_2 s1_24 = k_delayed_work_cancel((word32) *s1 + 388, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_144, out a1_145, out a2_146, out a3_21, out a4_22, out a5_147, out s2_148, out s3_149, out s4_150, out s5_32, out s6_151, out s8_152);
	((word32) a0 + 0x00A0)->u0 = 0x00;
	Eq_2 a3_47;
	Eq_2 a4_48;
	word32 s4_154;
	word32 a0_153;
	word32 s8_155;
	atomic_set(s1_24, null, a3_21, a4_22, mstatus, out a0_153, out a3_47, out a4_48, out s4_154, out s8_155);
	Eq_2 a3_58;
	word32 a0_156;
	word32 a4_157;
	word32 s4_158;
	word32 s8_159;
	atomic_set(s1_24, null, a3_47, a4_48, mstatus, out a0_156, out a3_58, out a4_157, out s4_158, out s8_159);
	Eq_2 a5_65 = (word32) *((word32) s1_24 + 9);
	Eq_2 a4_66 = (word32) *((word32) s1_24 + 0x0A);
	if (a4_66 != a5_65)
		*((word32) s1_24 + 0x0A) = (byte) a5_65;
	word32 a1_71 = 11;
	if ((word32) *((word32) s1_24 + 3) != 0x00)
		a1_71 = 0x01;
	0x00 = (int8) dwArg38;
	Eq_2 a3_93;
	Eq_294568 a4_94;
	ptr32 a5_95;
	word32 a0_160;
	word32 a2_161;
	word32 s4_162;
	atomic_set_bit(s0, a1_71, a3_58, a4_66, mstatus, out a0_160, out a2_161, out a3_93, out a4_94, out a5_95, out s4_162);
	a4Out = a4_94;
	a5Out = a5_95;
	s5Out = s5_32;
	return a3_93;
}

// 23052652: Register Eq_2 smp_pairing_complete(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s5Out)
// Called from:
//      smp_pairing_failed
//      smp_timeout
//      smp_signing_info
//      smp_master_ident
//      smp_error
//      bt_smp_encrypt_change
//      smp_ident_sent
//      smp_ident_addr_info
Eq_2 smp_pairing_complete(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s5Out)
{
	Eq_2 a1_52;
	<anonymous> * a5_50;
	Eq_2 a0_27;
	Eq_2 s0_13 = a0;
	struct Eq_294696 * s2_14 = &g_dw42026000;
	if (a1 == 0x00)
	{
		word32 a2_205;
		a0_27 = atomic_test_bit((word32) a0 + 0x009C, 0x0C, out a2_205);
		Eq_2 a5_57 = g_t42026610;
		if (a5_57 == 0x00)
			goto l2305267C;
		a5_50 = (<anonymous> *) *((word32) a5_57 + 24);
		a1_52 = (word32) (a0_27 != 0x00);
		if (a5_50 == null)
		{
l2305267C:
			0x00 = (int8) dwArg38;
			ptr32 a4_113;
			ptr32 a5_114;
			ptr32 s5_121;
			Eq_2 a3_112 = smp_reset(s0, s1, s0_13, a3, a4, mstatus, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_113, out a5_114, out s5_121);
			a4Out = a4_113;
			a5Out = a5_114;
			s5Out = s5_121;
			return a3_112;
		}
	}
	else
	{
		struct Eq_294700 * a1_18 = (word32) a1 - 1 & 0x00FF;
		s1.u0 = 0x08;
		if (a1_18 <= (struct Eq_294700 *) 0x0D)
			s1 = (word32) a1_18->b230BBABC;
		word32 a2_206;
		a0_27 = atomic_test_bit((word32) a0 + 0x009C, 0x02, out a2_206);
		if (a0_27 == 0x00)
		{
			s0_13 = *a0_27;
			ra = bt_conn_security_changed(ra, a0_27, s1, dwArg18, dwArg28, out s1, out a0_27, out a3, out a4, out s2_14);
		}
		struct Eq_294742 * a5_49 = s2_14->ptr0610;
		if (a5_49 == null)
			goto l2305267C;
		a5_50 = a5_49->ptr001C;
		if (a5_50 == null)
			goto l2305267C;
		a1_52 = s1;
	}
	a5_50();
	goto l2305267C;
}

// 230526CA: Register Eq_2 bt_smp_aes_cmac(Register Eq_2 ra, Register Eq_2 a0, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_197405) a4Out, Register out Eq_2 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      smp_sign_buf
//      smp_f4
//      smp_f5
//      smp_f6
//      smp_g2
Eq_2 bt_smp_aes_cmac(Eq_2 ra, Eq_2 a0, ptr32 & a1Out, ptr32 & a3Out, struct Eq_197405 & a4Out, union Eq_2 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a5_104;
	word32 a0_22;
	struct Eq_214946 * a5_23;
	Eq_2 s1_31;
	Eq_2 s2_32;
	word32 a2_161;
	word32 s8_162;
	struct Eq_197405 * a4_126;
	ptr32 a3_124;
	ptr32 a1_120;
	ptr32 s3_132;
	ptr32 s4_134;
	ptr32 s5_136;
	Eq_2 ra_30 = tc_cmac_setup(ra, fp + -0x0118, a0, fp + -0x00C0, dwLocE8, out s1_31, out a0_22, out a1_120, out a2_161, out a3_124, out a4_126, out a5_23, out s2_32, out s3_132, out s4_134, out s5_136, out s8_162);
	if (a0_22 != 0x00)
	{
		word32 a0_47;
		Eq_2 s0_50;
		word32 s1_163;
		word32 a2_164;
		word32 a5_165;
		word32 s2_166;
		word32 s8_167;
		Eq_2 ra_61 = tc_cmac_update(ra_30, fp + -0x0118, s1_31, s2_32, a4_126, a5_23, out s0_50, out s1_163, out a0_47, out a1_120, out a2_164, out a3_124, out a4_126, out a5_165, out s2_166, out s3_132, out s4_134, out s5_136, out s8_167);
		if (a0_47 != 0x00)
		{
			a5_104.u0 = 0x00;
			word32 a2_168;
			word32 s8_169;
			if (tc_cmac_final(ra_61, s0_50, fp + -0x0118, out a1_120, out a2_168, out a3_124, out a4_126, out s3_132, out s4_134, out s5_136, out s8_169) != 0x00)
			{
l23052708:
				a1Out = a1_120;
				a3Out = a3_124;
				a4Out = a4_126;
				a5Out = a5_104;
				s3Out = s3_132;
				s4Out = s4_134;
				s5Out = s5_136;
				return a5_104;
			}
		}
	}
	a5_104.u0 = ~0x04;
	goto l23052708;
}

// 2305271E: Register Eq_2 smp_sign_buf(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 s11Out)
// Called from:
//      bt_smp_sign_verify
//      bt_smp_sign
Eq_2 smp_sign_buf(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & s11Out)
{
	ptr32 a1_106;
	ptr32 a5_104;
	word32 a4_205;
	word32 a5_206;
	sys_mem_swap(a1, a2 + 4, out a4_205, out a5_206);
	sys_memcpy_swap(fp + -64, a0, 0x10);
	Eq_2 a3_53;
	word32 a1_207;
	word32 a4_208;
	word32 a5_209;
	word32 s3_210;
	word32 s4_211;
	word32 s5_212;
	ptr32 a0_50 = bt_smp_aes_cmac(ra, fp + -64, out a1_207, out a3_53, out a4_208, out a5_209, out s3_210, out s4_211, out s5_212);
	Eq_2 s1_14 = (word32) a1 + a2;
	Eq_2 s2_130 = a1;
	ptr32 s3_131 = a0_50;
	if (a0_50 != 0x00)
	{
		word32 s1_229;
		word32 a0_230;
		word32 a2_231;
		word32 a3_232;
		word32 a4_233;
		word32 a7_234;
		word32 s4_235;
		word32 s5_236;
		word32 s7_237;
		word32 s8_238;
		word32 s9_239;
		word32 s10_240;
		word32 t4_241;
		printf(ra, &g_t230BBEE0, a3_53, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_229, out a0_230, out a1_106, out a2_231, out a3_232, out a4_233, out a5_104, out a7_234, out s2_130, out s3_131, out s4_235, out s5_236, out s6, out s7_237, out s8_238, out s9_239, out s10_240, out s11, out t4_241);
	}
	else
	{
		word32 a4_213;
		word32 a5_214;
		sys_mem_swap(fp + -48, 0x10, out a4_213, out a5_214);
		word32 a1_215;
		word32 a2_216;
		word32 a3_217;
		word32 a4_218;
		word32 a5_219;
		word32 a6_220;
		word32 a7_221;
		memcpy(fp + -44, fp + -0x0044, 0x04, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out a6_220, out a7_221);
		word32 a4_222;
		word32 a5_223;
		sys_mem_swap(a1, a2 + 4, out a4_222, out a5_223);
		word32 a2_224;
		word32 a3_225;
		word32 a4_226;
		word32 a6_227;
		word32 a7_228;
		memcpy(s1_14, fp + -44, 0x0C, out a1_106, out a2_224, out a3_225, out a4_226, out a5_104, out a6_227, out a7_228);
	}
	s0Out = a2 + 4;
	a0Out = s3_131;
	a1Out = a1_106;
	a3Out = s2;
	a5Out = a5_104;
	s2Out = s2_130;
	s3Out = s3_131;
	s6Out = s6;
	s11Out = s11;
	return dwLoc08;
}

// 230527B8: Register Eq_2 smp_f4(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out)
// Called from:
//      smp_send_pairing_confirm
Eq_2 smp_f4(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 & a1Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out)
{
	sys_memcpy_swap(fp + -84, a0, 32);
	sys_memcpy_swap(fp + -52, a1, 32);
	sys_memcpy_swap(fp + -100, a2, 0x10);
	word32 s5_123;
	word32 s4_122;
	word32 s3_121;
	word32 a3_120;
	ptr32 a4_102;
	ptr32 a1_49;
	ptr32 a5_103;
	if (bt_smp_aes_cmac(ra, fp + -100, out a1_49, out a3_120, out a4_102, out a5_103, out s3_121, out s4_122, out s5_123) == 0x00)
		a1_49 = sys_mem_swap(a4, 0x10, out a4_102, out a5_103);
	a1Out = a1_49;
	a4Out = a4_102;
	a5Out = a5_103;
	s2Out = a1;
	return a4;
}

