pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305281A: Register (ptr32 Eq_295071) sc_smp_check_confirm(Register (ptr32 Eq_295071) a0)
// Called from:
//      smp_pairing_random
struct Eq_295071 * sc_smp_check_confirm(struct Eq_295071 * a0)
{
	uint32 a5_5 = (word32) a0->b00A0;
	if (a5_5 > 0x05)
		return (struct Eq_295071 *) 0x08;
	<anonymous> * a5_13 = *((char *) g_a230BB9E4 + a5_5 * 0x04);
	struct Eq_295071 * a0_16;
	a5_13();
	return a0_16;
}

// 23052896: void smp_f5(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a6)
void smp_f5(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a6)
{
	word32 a1_247;
	word32 a0_246;
	word32 t1_245;
	word32 a2_248;
	word32 a3_249;
	word32 a4_250;
	word32 a5_251;
	Eq_2 ra_45 = memset(ra, fp + -0x0068, 0x00, 53, out t1_245, out a0_246, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251);
	sys_memcpy_swap(fp + -0x0088, a0, 32);
	word32 s4_78;
	word32 s5_79;
	word32 a1_252;
	word32 a3_253;
	word32 a4_254;
	word32 a5_255;
	word32 s3_256;
	if (bt_smp_aes_cmac(ra_45, 0x230BBDCC, out a1_252, out a3_253, out a4_254, out a5_255, out s3_256, out s4_78, out s5_79) == 0x00)
	{
		sys_memcpy_swap(fp + -99, a1, 0x10);
		sys_memcpy_swap(fp + -83, a2, 0x10);
		sys_memcpy_swap(fp + -66, s5_79 + 1, 0x06);
		sys_memcpy_swap(fp + -59, s4_78 + 1, 0x06);
		Eq_2 s3_133;
		word32 a1_257;
		word32 a3_258;
		word32 a4_259;
		word32 a5_260;
		word32 s4_261;
		word32 s5_262;
		if (bt_smp_aes_cmac(ra_45, fp + -0x0098, out a1_257, out a3_258, out a4_259, out a5_260, out s3_133, out s4_261, out s5_262) == 0x00)
		{
			word32 a4_263;
			word32 a5_264;
			sys_mem_swap(s3_133, 0x10, out a4_263, out a5_264);
			word32 a1_265;
			word32 a3_266;
			word32 a4_267;
			word32 a5_268;
			word32 s3_269;
			word32 s4_270;
			word32 s5_271;
			if (bt_smp_aes_cmac(ra_45, fp + -0x0098, out a1_265, out a3_266, out a4_267, out a5_268, out s3_269, out s4_270, out s5_271) == 0x00)
			{
				word32 a4_272;
				word32 a5_273;
				sys_mem_swap(a6, 0x10, out a4_272, out a5_273);
			}
		}
	}
}

// 2305299C: void smp_f6(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a7)
void smp_f6(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a7)
{
	sys_memcpy_swap(fp + -84, a1, 0x10);
	sys_memcpy_swap(fp + -0x0044, a2, 0x10);
	sys_memcpy_swap(fp + -52, a3, 0x10);
	word32 a5_55 = sys_memcpy_swap(fp + -36, a4, 0x03);
	word32 a6_69;
	word32 a7_200;
	word32 a5_199;
	word32 a4_198;
	word32 a3_197;
	word32 a2_196;
	word32 a1_195;
	memcpy(fp + -32, a5_55 + 1, 0x06, out a1_195, out a2_196, out a3_197, out a4_198, out a5_199, out a6_69, out a7_200);
	sys_memcpy_swap(fp + -32, a5_55 + 1, 0x06);
	0x00 = dwLoc78;
	word32 a7_207;
	word32 a6_206;
	word32 a5_205;
	word32 a4_204;
	word32 a3_203;
	word32 a2_202;
	word32 a1_201;
	memcpy(fp + -25, a6_69 + 1, 0x06, out a1_201, out a2_202, out a3_203, out a4_204, out a5_205, out a6_206, out a7_207);
	sys_memcpy_swap(fp + -25, a6_69 + 1, 0x06);
	sys_memcpy_swap(fp + -100, a0, 0x10);
	word32 a1_208;
	word32 a3_209;
	word32 a4_210;
	word32 a5_211;
	word32 s3_212;
	word32 s4_213;
	word32 s5_214;
	if (bt_smp_aes_cmac(ra, fp + -100, out a1_208, out a3_209, out a4_210, out a5_211, out s3_212, out s4_213, out s5_214) == 0x00)
	{
		word32 a4_215;
		word32 a5_216;
		sys_mem_swap(a7, 0x10, out a4_215, out a5_216);
	}
}

// 23052A58: void smp_g2(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4)
void smp_g2(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4)
{
	sys_memcpy_swap(fp + -96, a0, 32);
	sys_memcpy_swap(fp + -64, a1, 32);
	sys_memcpy_swap(fp + -32, a3, 0x10);
	sys_memcpy_swap(fp + -112, a2, 0x10);
	word32 s3_151;
	word32 a5_150;
	word32 a4_149;
	word32 a3_148;
	word32 a1_147;
	word32 s4_152;
	word32 s5_153;
	if (bt_smp_aes_cmac(ra, fp + -112, out a1_147, out a3_148, out a4_149, out a5_150, out s3_151, out s4_152, out s5_153) == 0x00)
	{
		word32 * a3_82;
		word32 a1_154;
		word32 a2_155;
		word32 a4_156;
		word32 a5_157;
		word32 a6_158;
		word32 a7_159;
		memcpy(a4, fp + -100, 0x04, out a1_154, out a2_155, out a3_82, out a4_156, out a5_157, out a6_158, out a7_159);
		*((a3_82 >> 0x18 | a3_82 << 0x18 | a3_82 >> 0x08 & 0x0FFFFF00 | a3_82 << 8 & 0x00FF0000) & 1000000) = *a3_82;
	}
}

// 23052AF4: Register Eq_2 atomic_test_and_clear_bit(Register uint32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      smp_pairing_failed
//      bt_smp_dhkey_ready
//      bt_smp_recv
//      bt_smp_auth_passkey_entry
//      ble_auth_pairing_confirm
//      ble_auth_passkey_confirm
//      ble_auth_cancel
Eq_2 atomic_test_and_clear_bit(uint32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	Eq_2 s0_8 = 0x01 << a1;
	ui32 a0_19;
	ptr32 a1_20;
	ptr32 a3_22;
	ptr32 a4_23;
	ptr32 a5_24;
	ptr32 s4_26;
	word32 a2_43;
	word32 s8_44;
	Eq_2 s1_25 = atomic_and(s0_8, ~s0_8, a3, a4, mstatus, out a0_19, out a1_20, out a2_43, out a3_22, out a4_23, out a5_24, out s4_26, out s8_44);
	a0Out = (word32) ((a0_19 & s0_8) != 0x00);
	a1Out = a1_20;
	a3Out = a3_22;
	a4Out = a4_23;
	a5Out = a5_24;
	s4Out = s4_26;
	return s1_25;
}

// 23052B1E: void display_passkey(Register word32 ra, Register Eq_2 a0, Register (ptr32 Eq_64398) a2, Register ptr32 mstatus, Stack word32 dwArg38)
void display_passkey(word32 ra, Eq_2 a0, struct Eq_64398 * a2, ptr32 mstatus, word32 dwArg38)
{
	word32 a0_17;
	Eq_2 a3_20;
	word32 s4_104;
	word32 a5_103;
	word32 a4_102;
	word32 a1_101;
	word32 s8_105;
	bt_rand((word32) a0 + 368, 0x04, a2, out a0_17, out a1_101, out a3_20, out a4_102, out a5_103, out s4_104, out s8_105);
	if (a0_17 == 0x00)
	{
		Eq_2 a5_29 = *((word32) a0 + 368);
		*((word32) a0 + 372) = 0x00;
		*((word32) a0 + 368) = a5_29 & 1000000;
		Eq_2 a5_37 = g_t42026610;
		if (a5_37 != 0x00 && *a5_37 != 0x00)
		{
			word32 a0_42;
			word32 a2_44;
			word32 a3_106;
			word32 a4_107;
			word32 a5_108;
			word32 s4_109;
			Eq_2 s1_48 = atomic_set_bit(a0, 0x0A, a3_20, 1000000, mstatus, out a0_42, out a2_44, out a3_106, out a4_107, out a5_108, out s4_109);
			<anonymous> * a5_55 = *g_t42026610;
			a5_55();
		}
	}
	0x00 = dwArg38;
}

// 23052B86: Register word32 update_keys_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 a3Out, Register out Eq_295564 a4Out)
// Called from:
//      smp_pairing_req
//      smp_pairing_rsp
word32 update_keys_check(Eq_2 ra, Eq_2 s0, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & a3Out, union Eq_295564 & a4Out)
{
	Eq_2 s1_11 = *s0;
	if (*((word32) s0 + 0x009C) == 0x00)
	{
		Eq_2 a0_19;
		word32 s4_309;
		word32 mstatus_311;
		word32 s5_310;
		word32 a3_306;
		word32 s2_307;
		word32 s3_308;
		bt_keys_get_addr(ra, s0, (word32) *((word32) s0 + 8), (word32) s0 + 112, s2, s3, s4, mstatus, dwLoc10, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0, out s1_11, out a0_19, out a3_306, out a4, out s2_307, out s3_308, out s4_309, out s5_310, out mstatus_311);
		*((word32) s0 + 0x009C) = a0_19;
	}
	word32 a0_144;
	Eq_2 a3_152 = *((word32) s0 + 0x009C);
	if (a3_152 == 0x00)
	{
l23052BAE:
		a0_144 = 0x01;
		goto l23052BB0;
	}
	a4 = (word32) *((word32) a3_152 + 0x0A);
	if ((a4 & 36) == 0x00)
		goto l23052BAE;
	uint32 a2_55 = (word32) *((word32) s1_11 + 0x00A5);
	uint32 a5_56 = (word32) *((word32) s1_11 + 0x00AC);
	if (a2_55 < a5_56)
		a5_56 = a2_55;
	a3_152 = (word32) *((word32) a3_152 + 8);
	if ((a5_56 & 0x00FF) >= a3_152)
	{
		a4 &= 32;
		if ((a4 & 32) != 0x00)
		{
			word32 a2_312;
			if (atomic_test_bit((word32) s1_11 + 0x009C, 0x05, out a2_312) == 0x00)
				goto l23052BDE;
		}
		if (((word32) *((word32) *((word32) s0 + 0x009C) + 9) & 0x01) == 0x00)
			goto l23052BAE;
		a0_144 = (word32) ((word32) *((word32) s1_11 + 0x00A0) != 0x00);
l23052BB0:
		a3Out = a3_152;
		a4Out = a4;
		return a0_144;
	}
	else
	{
l23052BDE:
		a0_144 = 0x00;
		goto l23052BB0;
	}
}

