pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23052C0C: void smp_pairing_failed(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void smp_pairing_failed(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a5_117;
	Eq_2 a3_28;
	Eq_2 a4_29;
	word32 t4_324;
	word32 s11_323;
	word32 s10_322;
	word32 s9_321;
	word32 s8_320;
	word32 s7_319;
	word32 s6_318;
	word32 s5_317;
	word32 s4_316;
	word32 a2_313;
	word32 a5_314;
	word32 a7_315;
	word32 a1_312;
	word32 a0_311;
	word32 s1_310;
	Eq_2 s2_122;
	Eq_2 s3_123;
	Eq_2 ra_121 = printf(ra, &g_t230BBE7C, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_310, out a0_311, out a1_312, out a2_313, out a3_28, out a4_29, out a5_314, out a7_315, out s2_122, out s3_123, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320, out s9_321, out s10_322, out s11_323, out t4_324);
	Eq_2 s0_119 = a0;
	word32 a0_49;
	word32 a5_325;
	word32 a1_50;
	Eq_2 s4_124;
	Eq_2 a4_100;
	Eq_2 a3_127;
	Eq_2 s1_112 = atomic_test_and_clear_bit(0x09, a3_28, a4_29, mstatus, out a0_49, out a1_50, out a3_127, out a4_100, out a5_325, out s4_124);
	if (a0_49 == 0x00)
	{
		word32 a0_61;
		s1_112 = atomic_test_and_clear_bit(0x0A, a3_127, a4_100, mstatus, out a0_61, out a1_50, out a3_127, out a4_100, out a5_117, out s4_124);
		if (a0_61 == 0x00)
			goto l23052C4A;
	}
	a5_117 = g_t42026610;
	if (a5_117 != 0x00)
	{
		a5_117 = *((word32) a5_117 + 16);
		if (a5_117 != 0x00)
			a5_117();
	}
l23052C4A:
	word32 a2_326;
	if (atomic_test_bit(s1_112, 0x02, out a2_326) != 0x00)
	{
		s0_119 = *a5_117;
		Eq_2 a0_120 = *((word32) a5_117 + 0x009C);
		if (a0_120 != 0x00)
			ra_121 = bt_keys_clear(ra_121, s0_119, s1_112, a0_120, a3_127, s2_122, s3_123, s4_124, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3_127, out a4_100);
	}
	word32 a5_328;
	word32 s5_329;
	word32 a4_327;
	smp_pairing_complete(ra_121, s0_119, s1_112, s0_119, (word32) *s2_122, a3_127, a4_100, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArgB8, dwArgF8, out a4_327, out a5_328, out s5_329);
}

// 23052C90: void smp_timeout(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void smp_timeout(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 s1_28;
	Eq_2 s2_31;
	Eq_2 s3_32;
	Eq_2 s4_33;
	word32 s10_169;
	word32 s9_168;
	word32 s8_167;
	word32 s7_166;
	word32 s6_165;
	word32 s5_164;
	word32 a7_163;
	word32 a0_159;
	word32 a1_160;
	word32 a2_161;
	word32 a5_162;
	word32 s11_170;
	word32 t4_171;
	Eq_2 a4_25;
	Eq_2 a3_24;
	Eq_2 ra_27 = printf(ra, &g_t230BBEF8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_28, out a0_159, out a1_160, out a2_161, out a3_24, out a4_25, out a5_162, out a7_163, out s2_31, out s3_32, out s4_33, out s5_164, out s6_165, out s7_166, out s8_167, out s9_168, out s10_169, out s11_170, out t4_171);
	word32 a2_172;
	if (atomic_test_bit(s1_28, 0x02, out a2_172) != 0x00)
	{
		Eq_2 a0_47 = *((word32) *((word32) a0 - 388) + 0x009C);
		if (a0_47 != 0x00)
			ra_27 = bt_keys_clear(ra_27, a0, s1_28, a0_47, a3_24, s2_31, s3_32, s4_33, mstatus, s2, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out a3_24, out a4_25);
	}
	Eq_2 a3_68;
	Eq_2 a4_69;
	word32 a0_173;
	word32 a2_174;
	word32 a5_175;
	word32 s4_176;
	Eq_2 s1_71 = atomic_set_bit(a0, 0x04, a3_24, a4_25, mstatus, out a0_173, out a2_174, out a3_68, out a4_69, out a5_175, out s4_176);
	0x00 = (int8) dwArg38;
	word32 a4_177;
	word32 a5_178;
	word32 s5_179;
	smp_pairing_complete(ra_27, s0, s1_71, s2_31, 0x08, a3_68, a4_69, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_177, out a5_178, out s5_179);
}

// 23052CE2: void smp_ident_info(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_296002) a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_296005) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void smp_ident_info(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_296002 * a1, Eq_2 a3, Eq_2 a4, struct Eq_296005 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 s0_22 = a0;
	word32 a2_251;
	if (atomic_test_bit((word32) a0 + 0x009C, 0x0C, out a2_251) != 0x00)
	{
		s0_22 = a5->t0000;
		word32 a0_29;
		Eq_2 s1_36;
		Eq_2 s2_37;
		word32 a3_258;
		word32 s3_259;
		word32 s4_260;
		word32 s5_261;
		Eq_2 ra_45 = bt_keys_get_type(ra, s0_22, 0x02, (word32) a5->b0008, &a5->b0008 + 0x0068, a1->t0008, mstatus, s2, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_36, out a0_29, out a3_258, out s2_37, out s3_259, out s4_260, out s5_261, out mstatus);
		if (a0_29 == 0x00)
		{
			Eq_2 a3_96;
			word32 s0_267;
			word32 s1_268;
			word32 a0_269;
			word32 a1_270;
			word32 a2_271;
			word32 a3_272;
			word32 a4_273;
			word32 a5_274;
			word32 a7_275;
			word32 s2_276;
			word32 s3_277;
			word32 s4_278;
			word32 s5_279;
			word32 s6_280;
			word32 s7_281;
			word32 s8_282;
			word32 s9_283;
			word32 s10_284;
			word32 s11_285;
			word32 t4_286;
			printf(bt_addr_le_str_real(ra_45, s1_36, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0118, out s0_267, out a3_96), &g_t230BBE60, a3_96, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_268, out a0_269, out a1_270, out a2_271, out a3_272, out a4_273, out a5_274, out a7_275, out s2_276, out s3_277, out s4_278, out s5_279, out s6_280, out s7_281, out s8_282, out s9_283, out s10_284, out s11_285, out t4_286);
l23052D2A:
			0x00 = (int8) dwArg38;
			return;
		}
		word32 a1_262;
		word32 a2_263;
		word32 a5_264;
		word32 a6_265;
		word32 a7_266;
		memcpy(a0_29 + 38, s2_37, 0x10, out a1_262, out a2_263, out a3, out a4, out a5_264, out a6_265, out a7_266);
	}
	word32 a0_252;
	word32 a2_253;
	word32 a3_254;
	word32 a4_255;
	word32 a5_256;
	word32 s4_257;
	atomic_set_bit(s0_22, 0x09, a3, a4, mstatus, out a0_252, out a2_253, out a3_254, out a4_255, out a5_256, out s4_257);
	goto l23052D2A;
}

// 23052D50: void smp_encrypt_info(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_296205) a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_296208) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void smp_encrypt_info(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_296205 * a1, Eq_2 a3, Eq_2 a4, struct Eq_296208 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	Eq_2 s0_22 = a0;
	word32 a2_251;
	if (atomic_test_bit((word32) a0 + 0x009C, 0x0C, out a2_251) != 0x00)
	{
		s0_22 = a5->t0000;
		word32 a0_29;
		Eq_2 s1_36;
		Eq_2 s2_37;
		word32 a3_258;
		word32 s3_259;
		word32 s4_260;
		word32 s5_261;
		Eq_2 ra_45 = bt_keys_get_type(ra, s0_22, 0x04, (word32) a5->b0008, &a5->b0008 + 0x0068, a1->t0008, mstatus, s2, s0, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_36, out a0_29, out a3_258, out s2_37, out s3_259, out s4_260, out s5_261, out mstatus);
		if (a0_29 == 0x00)
		{
			Eq_2 a3_96;
			word32 s0_267;
			word32 s1_268;
			word32 a0_269;
			word32 a1_270;
			word32 a2_271;
			word32 a3_272;
			word32 a4_273;
			word32 a5_274;
			word32 a7_275;
			word32 s2_276;
			word32 s3_277;
			word32 s4_278;
			word32 s5_279;
			word32 s6_280;
			word32 s7_281;
			word32 s8_282;
			word32 s9_283;
			word32 s10_284;
			word32 s11_285;
			word32 t4_286;
			printf(bt_addr_le_str_real(ra_45, s1_36, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0118, out s0_267, out a3_96), &g_t230BBE60, a3_96, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_268, out a0_269, out a1_270, out a2_271, out a3_272, out a4_273, out a5_274, out a7_275, out s2_276, out s3_277, out s4_278, out s5_279, out s6_280, out s7_281, out s8_282, out s9_283, out s10_284, out s11_285, out t4_286);
l23052D98:
			0x00 = (int8) dwArg38;
			return;
		}
		word32 a1_262;
		word32 a2_263;
		word32 a5_264;
		word32 a6_265;
		word32 a7_266;
		memcpy(a0_29 + 22, s2_37, 0x10, out a1_262, out a2_263, out a3, out a4, out a5_264, out a6_265, out a7_266);
	}
	word32 a0_252;
	word32 a2_253;
	word32 a3_254;
	word32 a4_255;
	word32 a5_256;
	word32 s4_257;
	atomic_set_bit(s0_22, 0x07, a3, a4, mstatus, out a0_252, out a2_253, out a3_254, out a4_255, out a5_256, out s4_257);
	goto l23052D98;
}

// 23052DBC: Register Eq_2 legacy_request_tk(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArgC4, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_296379 a4Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_pairing_req
//      smp_pairing_rsp
Eq_2 legacy_request_tk(Eq_2 ra, Eq_2 s1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArgC4, union Eq_2 & s0Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_296379 & a4Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_296379 a4_104;
	ptr32 a1_111;
	Eq_2 a0_12 = *s1;
	struct Eq_296389 * a0_16;
	struct Eq_64398 * a2_18;
	word32 a5_378;
	word32 a4_377;
	Eq_2 a3_103;
	ptr32 s2_116;
	bt_keys_find_addr((word32) *((word32) s1 + 8), (word32) s1 + 112, dwArg18, out a0_16, out a2_18, out a3_103, out a4_377, out a5_378, out s2_116);
	Eq_2 s0_13 = a0_12;
	ptr32 a5_25 = (word32) *((word32) a0_12 + 0x00A0);
	if (a0_16 == null || (((word32) a0_16->b0009 & 0x01) == 0x00 || a5_25 != 0x00))
	{
		a4_104.u0 = 0x01;
		a1_111 = a5_25;
		if (a5_25 != 0x01)
		{
			if (a5_25 == 0x00)
				goto l23052E66;
			if (a5_25 != 0x02)
			{
				word32 s1_400;
				word32 a0_401;
				word32 a1_402;
				word32 a2_403;
				word32 a5_404;
				word32 a7_405;
				word32 s3_406;
				word32 s4_407;
				word32 s6_408;
				word32 s7_409;
				word32 s8_410;
				word32 s9_411;
				word32 s10_412;
				word32 s11_413;
				word32 t4_414;
				ra = printf(ra, &g_t230BBDAC, a3_103, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_400, out a0_401, out a1_402, out a2_403, out a3_103, out a4_104, out a5_404, out a7_405, out s2_116, out s3_406, out s4_407, out s5, out s6_408, out s7_409, out s8_410, out s9_411, out s10_412, out s11_413, out t4_414);
l23052DF2:
				a1_111 = 0x08;
				goto l23052E66;
			}
			word32 a0_100;
			word32 a1_415;
			word32 a5_416;
			word32 s4_417;
			word32 s8_418;
			bt_rand(fp + ~0x13, 0x04, a2_18, out a0_100, out a1_415, out a3_103, out a4_104, out a5_416, out s4_417, out s8_418);
			a1_111 = 0x08;
			if (a0_100 != 0x00)
				goto l23052E66;
			s2_116 = 0x42026000;
			Eq_2 a5_118 = g_t42026610;
			if (a5_118 != 0x00)
			{
				a5_118 = *a5_118;
				if (a5_118 != 0x00)
				{
					word32 a0_419;
					word32 a2_420;
					word32 a3_421;
					word32 a4_422;
					word32 a5_423;
					word32 s4_424;
					Eq_2 s1_128 = atomic_set_bit(a0_12, 0x0A, a3_103, 1000000, mstatus, out a0_419, out a2_420, out a3_421, out a4_422, out a5_423, out s4_424);
					<anonymous> * a5_135 = *g_t42026610;
					word32 a7_153;
					word32 s10_154;
					word32 s11_155;
					word32 s3_156;
					word32 s6_158;
					word32 s7_159;
					word32 s9_160;
					word32 t0_161;
					word32 t4_162;
					a5_135();
				}
			}
			*((word32) s0_13 + 223) = (byte) a5_118;
			uint32 a4_167 = a5_118 << 0x10;
			uint32 a5_171 = a5_118 >> 16;
			*((word32) s0_13 + 225) = (byte) a5_171;
			*((word32) s0_13 + 224) = (byte) (a4_167 >> 24);
			*((word32) s0_13 + 226) = (byte) (a5_171 >> 8);
			a4_104 = a4_167 >> 24;
		}
		else
		{
			word32 a0_394;
			word32 a2_395;
			word32 a3_396;
			word32 a4_397;
			word32 a5_398;
			word32 s4_399;
			Eq_2 s1_43 = atomic_set_bit(a0_12, 0x09, a3_103, 0x01, mstatus, out a0_394, out a2_395, out a3_396, out a4_397, out a5_398, out s4_399);
			<anonymous> * a5_51 = *((word32) g_t42026610 + 4);
			word32 s6_227;
			word32 s3_225;
			word32 s11_224;
			word32 s10_223;
			word32 a7_222;
			word32 s7_228;
			word32 s9_229;
			word32 t0_230;
			word32 t4_231;
			a5_51();
		}
		a1_111 = 0x00;
l23052E66:
		s0Out = s0_13;
		a0Out = a1_111;
		a3Out = a3_103;
		a4Out = a4_104;
		s2Out = s2_116;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		word32 s1_379;
		word32 a2_382;
		word32 a1_381;
		word32 a5_383;
		word32 a7_384;
		word32 a0_380;
		word32 s6_387;
		word32 s4_386;
		word32 s7_388;
		word32 s8_389;
		word32 s3_385;
		word32 s9_390;
		word32 s10_391;
		word32 s11_392;
		word32 t4_393;
		ra = printf(ra, &g_t230BBD7C, a3_103, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_379, out a0_380, out a1_381, out a2_382, out a3_103, out a4_104, out a5_383, out a7_384, out s2_116, out s3_385, out s4_386, out s5, out s6_387, out s7_388, out s8_389, out s9_390, out s10_391, out s11_392, out t4_393);
		goto l23052DF2;
	}
}

