pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23052E9C: void bt_smp_disconnected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 (ptr32 Eq_296669)) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void bt_smp_disconnected(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, struct Eq_296669 ** a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	struct Eq_296669 * a0_13 = *a5;
	word32 a1_328;
	word32 a0_327;
	word32 a5_330;
	word32 s6_332;
	word32 a2_329;
	word32 s5_331;
	word32 s8_333;
	Eq_2 a4_24;
	Eq_2 s2_110;
	Eq_2 s3_113;
	Eq_2 s4_116;
	Eq_2 a3_121;
	Eq_2 s1_26 = k_delayed_work_cancel((char *) a0_13 + 388, a3, a4, mstatus, dwArg24, dwArg28, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_327, out a1_328, out a2_329, out a3_121, out a4_24, out a5_330, out s2_110, out s3_113, out s4_116, out s5_331, out s6_332, out s8_333);
	Eq_2 a5_43 = a0_13->t0194;
	if (a5_43 != 0x00)
	{
		word32 a0_334;
		word32 s5_336;
		word32 s8_338;
		word32 a2_335;
		word32 s6_337;
		s1_26 = k_delayed_work_del_timer(s2_110, a4_24, a5_43, mstatus, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_334, out a2_335, out a3_121, out a4_24, out a5_43, out s2_110, out s3_113, out s4_116, out s5_336, out s6_337, out s8_338);
	}
	Eq_2 s0_69 = *((word32) a5_43 + 32);
	if (a5_43 != 0x00)
	{
		word32 a2_340;
		word32 a5_342;
		word32 a4_341;
		word32 a0_339;
		word32 s6_344;
		word32 s5_343;
		word32 s8_345;
		s1_26 = k_delayed_work_del_timer((word32) s0_69 + 16, a4_24, a5_43, mstatus, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_339, out a2_340, out a3_121, out a4_341, out a5_342, out s2_110, out s3_113, out s4_116, out s5_343, out s6_344, out s8_345);
	}
	if (s1_26 != 0x00 && ((word32) (*((word32) s1_26 + 0x0A)) == 0x00 || ((word32) (*((word32) s1_26 + 9)) & 0x02) != 0x00))
	{
		word32 a3_346;
		word32 a4_347;
		ra = bt_keys_clear(ra, s0_69, s1_26, s1_26, a3_121, s2_110, s3_113, s4_116, mstatus, s2, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg54, dwArg58, dwArg68, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out a3_346, out a4_347);
	}
	0x00 = (int8) dwArg38;
	word32 a5_354;
	word32 a2_351;
	word32 a3_352;
	word32 a4_353;
	word32 a0_349;
	word32 a1_350;
	word32 t1_348;
	memset(ra, s0_69, 0x00, 424, out t1_348, out a0_349, out a1_350, out a2_351, out a3_352, out a4_353, out a5_354);
}

// 23052EFC: void bt_smp_connected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118)
void bt_smp_connected(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg0118)
{
	Eq_2 a3_19;
	Eq_2 a4_20;
	word32 a0_69;
	word32 a5_70;
	word32 s2_71;
	word32 s3_72;
	word32 s4_73;
	word32 s5_74;
	Eq_2 s1_23 = k_delayed_work_init(ra, a0, (word32) a0 + 388, a3, a4, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_69, out a3_19, out a4_20, out a5_70, out s2_71, out s3_72, out s4_73, out s5_74);
	word32 a4_75;
	word32 a5_76;
	word32 s5_77;
	smp_reset(s0, s1_23, a0, a3_19, a4_20, mstatus, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_75, out a5_76, out s5_77);
}

// 23052F20: Register (ptr32 byte) get_auth.isra.0(Register (ptr32 byte) a0, Register ui32 a1, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_296845 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_296848 a5Out)
// Called from:
//      smp_pairing_req
//      bt_smp_start_security
byte * get_auth.isra.0(byte * a0, ui32 a1, Eq_2 a3, Eq_2 a4, union Eq_296845 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_296848 & a5Out)
{
	ui32 s0_16 = a1 & 0x0F;
	if ((word32) g_b4200F4A0 == 0x00)
		s0_16 = a1 & 7;
	Eq_296848 a5_31;
	ptr32 a3_24;
	if (get_io_capa(a3, a4, out a3_24) != 0x03)
	{
		a3_24 = (word32) *a0;
		a5_31 = s0_16 | 4;
		if (a3_24 > 0x02)
		{
l23052F58:
			ptr32 a4_37 = (word32) g_b4200EC3D;
			Eq_296845 a0_39 = a5_31 & 0x00FE;
			if (a4_37 != 0x00)
				a0_39 = a5_31 | 1;
			a0Out = a0_39;
			a3Out = a3_24;
			a4Out = a4_37;
			a5Out = a5_31;
			return a0;
		}
	}
	a5_31 = s0_16 & 11;
	goto l23052F58;
}

// 23052F74: Register word32 sec_level_reachable.isra.1(Register Eq_296862 a0, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_296892 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      bt_smp_start_security
word32 sec_level_reachable.isra.1(Eq_296862 a0, Eq_2 a3, Eq_2 a4, union Eq_296892 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	Eq_296892 a0_26;
	if (a0 != 0x03)
	{
		a0_26 = (word32) (a0 != 0x00);
		if (a0 <= 0x03)
			goto l23052FE8;
		a0_26.u0 = 0x00;
		if (a0 == 0x04)
		{
			ui32 a0_35;
			if (get_io_capa(a3, a4, out a3) == 0x03)
			{
				Eq_2 a5_34 = g_t42026610;
				a0_35 = 0x00;
				if (a5_34 == 0x00 || (*((word32) a5_34 + 0x0C) == 0x00 || (word32) g_b4200F498 == 0x00))
				{
l23052FBE:
					a0_26 = a0_35 & 0x01;
					goto l23052FE8;
				}
			}
			a0_35 = (word32) g_b4200F4A0;
			goto l23052FBE;
		}
	}
	else
	{
		ui32 a5_18 = 0x01;
		if (get_io_capa(a3, a4, out a3) == a0)
		{
			a4 = g_t42026610;
			a5_18 = 0x00;
			if (a4 != 0x00)
			{
				a4 = *((word32) a4 + 0x0C);
				if (a4 != 0x00)
					a5_18 = (word32) g_b4200F498;
			}
		}
		a0_26 = a5_18 & 1;
	}
l23052FE8:
	a0Out = a0_26;
	a3Out = a3;
	a4Out = a4;
	return 0x03;
}

