pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23052FF2: void bt_smp_accept(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void bt_smp_accept(Eq_2 ra, word32 a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 a4_10;
	struct Eq_296964 * a4_6 = *a3;
	if (a3 != 0x00)
	{
		if (a4_6->dw01A8 != 0x00)
		{
			word32 s11_137;
			word32 s10_136;
			word32 s9_135;
			word32 s8_134;
			word32 s7_133;
			word32 s6_132;
			word32 s5_131;
			word32 s4_130;
			word32 s3_129;
			word32 s2_128;
			word32 a7_127;
			word32 a5_126;
			word32 a4_125;
			word32 a3_124;
			word32 a2_123;
			word32 a1_122;
			word32 a0_121;
			word32 s1_120;
			word32 t4_138;
			printf(ra, &g_t230BBACC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out a7_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138);
			return;
		}
		a4_10 = 0x01;
	}
	else
		a4_10 = 0x00;
	struct Eq_297019 * a4_13 = a4_10 + 424;
	g_dw4200DEA8 = &a4_13->dw42016954;
	a4_13->dw42016954 = a1;
}

// 23053042: Register Eq_2 smp_keys_check.part.5(Register Eq_2 a0, Register out ptr32 a3Out, Register out Eq_297030 a4Out, Register out Eq_2 a5Out)
// Called from:
//      bt_smp_start_security
Eq_2 smp_keys_check.part.5(Eq_2 a0, ptr32 & a3Out, union Eq_297030 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 s0_12 = a0;
	if (*((word32) a0 + 0x009C) == 0x00)
	{
		Eq_2 a0_17;
		Eq_2 s1_25;
		word32 s4_116;
		word32 s3_115;
		word32 s2_114;
		word32 a5_113;
		s0_12 = bt_keys_find(32, (word32) *((word32) a0 + 8), (word32) a0 + 112, out s1_25, out a0_17, out a3, out a4, out a5_113, out s2_114, out s3_115, out s4_116);
		*((word32) s0_12 + 0x009C) = a0_17;
		if (a0_17 == 0x00)
		{
			Eq_2 a0_35;
			word32 a5_118;
			word32 s1_117;
			word32 s2_119;
			word32 s3_120;
			word32 s4_121;
			s0_12 = bt_keys_find(0x04, (word32) *((word32) s0_12 + 8), s1_25, out s1_117, out a0_35, out a3, out a4, out a5_118, out s2_119, out s3_120, out s4_121);
			*((word32) s0_12 + 0x009C) = a0_35;
		}
	}
	Eq_2 a5_52 = *((word32) s0_12 + 0x009C);
	Eq_2 a0_53 = 0x00;
	if (a5_52 != 0x00)
	{
		ui32 a4_54 = (word32) *((word32) a5_52 + 0x0A);
		a4 = a4_54 & 36;
		if ((a4_54 & 36) != 0x00)
		{
			a3 = (word32) *((word32) s0_12 + 0x0A);
			a4.u0 = 0x02;
			a0_53.u0 = 0x01;
			if (a3 > 0x02)
				a0_53 = (word32) *((word32) a5_52 + 9) & 0x01;
		}
	}
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_52;
	return a0_53;
}

// 230530A8: Register Eq_2 get_pair_method(Register Eq_2 a0, Register (ptr32 Eq_297137) a1, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg38, Register out ptr32 s2Out)
// Called from:
//      smp_pairing_req
//      smp_pairing_rsp
Eq_2 get_pair_method(Eq_2 a0, struct Eq_297137 * a1, Eq_2 a3, Eq_2 a4, Eq_2 dwArg38, ptr32 & s2Out)
{
	word32 a2_104;
	Eq_2 a0_18 = atomic_test_bit((word32) a0 + 0x009C, 0x05, out a2_104);
	if (a0_18 == 0x00)
	{
		s2 = 0x04;
		if (a1 <= (struct Eq_297137 *) 0x04)
		{
			ui32 a0_51 = (word32) *((word32) a0 + 0x00A4) | (word32) (*((word32) a0 + 171));
			a0_18 = a0_51 & 0x04;
			if ((a0_51 & 0x04) != 0x00)
			{
				word32 a3_105;
				a0_18 = CONVERT(Mem17[get_io_capa(a3, a4, out a3_105) + (a1 + 587971801):byte], byte, word32);
				if (a0_18 == 0x04)
					a0_18 = (word32) ((word32) a1->b230BBCDC < 1) + 0x01;
			}
		}
		goto l23053100;
	}
	Eq_2 a4_21 = (word32) *((word32) a0 + 0x00A4);
	Eq_2 a3_22 = (word32) *((word32) a0 + 171);
	if ((a4_21 & a3_22 & 0x08) != 0x00)
	{
		a0_18.u0 = 0x05;
		if ((((word32) *((word32) a0 + 0x00A3) | (word32) (*((word32) a0 + 0x00AA))) & 0x01) != 0x00)
		{
l23053100:
			0x00 = (int8) dwArg38;
			s2Out = s2;
			return a0_18;
		}
	}
	a0_18.u0 = 0x00;
	if (a1 <= (struct Eq_297137 *) 0x04)
	{
		ui32 a0_35 = a4_21 | a3_22;
		a0_18 = a0_35 & 0x04;
		if ((a0_35 & 0x04) != 0x00)
		{
			word32 a3_106;
			a0_18 = CONVERT(Mem17[get_io_capa(a3_22, a4_21, out a3_106) + (a1 + 587971829):byte], byte, word32);
		}
	}
	goto l23053100;
}

// 23053158: Register Eq_2 smp_create_pdu.isra.7(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_297262) s2Out, Register out (ptr32 Eq_297263) s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      sc_smp_send_dhkey_check
//      smp_send_pairing_random
//      sc_send_public_key
//      send_pairing_rsp
//      bt_smp_distribute_keys
//      smp_error
//      smp_send_pairing_confirm
//      legacy_pairing_confirm
//      bt_smp_start_security
Eq_2 smp_create_pdu.isra.7(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgF8, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, struct Eq_297262 & s2Out, struct Eq_297263 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a2_21 = 0x00;
	word32 a2_163;
	if (atomic_test_bit((word32) a0 + 0x009C, 0x04, out a2_163) == 0x00)
		a2_21.u0 = 0x07000530;
	ptr32 a5_131;
	ptr32 mstatus_47;
	struct Eq_297262 * s2_53;
	struct Eq_297263 * s3_54;
	ptr32 s5_56;
	word32 a2_164;
	word32 s6_165;
	word32 s11_166;
	Eq_2 s1_136;
	Eq_2 a4_130;
	Eq_2 a3_129;
	Eq_2 ra_48 = bt_l2cap_create_pdu_timeout(ra, 0x00, a2_21, a3, a4, a5, s5, mstatus, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg84, dwArg8C, dwArg98, dwArgD8, dwArgF8, out s1_136, out a2_164, out a3_129, out a4_130, out s2_53, out s3_54, out s5_56, out s6_165, out s11_166, out mstatus_47);
	if (true)
	{
		word32 a2_169;
		word32 a0_168;
		word32 s4_170;
		s1_136 = atomic_set_bit(0x00, 0x04, a3_129, a4_130, mstatus_47, out a0_168, out a2_169, out a3_129, out a4_130, out a5_131, out s4_170);
	}
	else
	{
		word32 a1_167;
		*net_buf_simple_add(0x08, 0x01, a4_130, out a1_167, out a5_131) = (byte) s2_53;
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_136;
	a0Out = 0x00;
	a2Out = dwArg10;
	a3Out = a3_129;
	a4Out = a4_130;
	a5Out = a5_131;
	s2Out = s2_53;
	s3Out = s3_54;
	s5Out = s5_56;
	mstatusOut = mstatus_47;
	return ra_48;
}

// 230531AA: Register Eq_2 smp_send.isra.9(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_297371 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_297373) s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      sc_smp_send_dhkey_check
//      smp_send_pairing_random
//      sc_send_public_key
//      send_pairing_rsp
//      bt_smp_distribute_keys
//      smp_send_pairing_confirm
//      legacy_pairing_confirm
//      bt_smp_start_security
Eq_2 smp_send.isra.9(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_297371 & a5Out, ptr32 & s2Out, struct Eq_297373 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_23;
	Eq_2 a4_24;
	ptr32 mstatus_28;
	word32 s0_117;
	word32 s1_118;
	word32 a0_119;
	word32 a1_120;
	word32 a5_121;
	word32 s2_122;
	word32 s3_123;
	word32 s4_124;
	word32 s5_125;
	word32 s6_126;
	word32 s7_127;
	word32 s8_128;
	word32 s9_129;
	word32 s10_130;
	word32 s11_131;
	Eq_2 ra_29 = bt_l2cap_send_cb(ra, s1, *a0, 0x06, a1, a2, a5, mstatus, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg44, dwArg48, dwArg64, dwArg6C, dwArg78, dwArg7C, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_117, out s1_118, out a0_119, out a1_120, out a3_23, out a4_24, out a5_121, out s2_122, out s3_123, out s4_124, out s5_125, out s6_126, out s7_127, out s8_128, out s9_129, out s10_130, out s11_131, out mstatus_28);
	ptr32 a3_57;
	ptr32 a4_58;
	Eq_297371 a5_59;
	ptr32 s1_61;
	ptr32 s2_62;
	struct Eq_297373 * s3_63;
	ptr32 s5_71;
	word32 a0_132;
	word32 a1_133;
	word32 a2_134;
	word32 s4_135;
	word32 s6_136;
	word32 s8_137;
	s0Out = k_delayed_work_submit(0x07000530, a3_23, a4_24, mstatus_28, dwArg04, dwArg08, dwArg24, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, out s1_61, out a0_132, out a1_133, out a2_134, out a3_57, out a4_58, out a5_59, out s2_62, out s3_63, out s4_135, out s5_71, out s6_136, out s8_137);
	s1Out = s1_61;
	a3Out = a3_57;
	a4Out = a4_58;
	a5Out = a5_59;
	s2Out = s2_62;
	s3Out = s3_63;
	s5Out = s5_71;
	mstatusOut = mstatus_28;
	return ra_29;
}

// 230531D4: void sc_smp_send_dhkey_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void sc_smp_send_dhkey_check(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	Eq_2 a0_22;
	Eq_2 a4_26;
	ptr32 mstatus_30;
	Eq_2 s1_32;
	Eq_2 s2_35;
	word32 a2_174;
	word32 a3_175;
	word32 a5_176;
	word32 s3_177;
	word32 s5_178;
	Eq_2 ra_31 = smp_create_pdu.isra.7(ra, a0, a3, a4, a5, s5, mstatus, dwArg28, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s1_32, out a0_22, out a2_174, out a3_175, out a4_26, out a5_176, out s2_35, out s3_177, out s5_178, out mstatus_30);
	if (a0_22 != 0x00)
	{
		Eq_2 a5_60;
		word32 a1_179;
		word32 a5_180;
		word32 a1_181;
		word32 a2_182;
		word32 a3_183;
		word32 a4_184;
		word32 a6_185;
		word32 a7_186;
		memcpy(net_buf_simple_add((word32) a0_22 + 8, 0x10, a4_26, out a1_179, out a5_180), s2_35, 0x10, out a1_181, out a2_182, out a3_183, out a4_184, out a5_60, out a6_185, out a7_186);
		word32 s0_187;
		word32 s1_188;
		word32 a3_189;
		word32 a4_190;
		word32 a5_191;
		word32 s2_192;
		word32 s3_193;
		word32 s5_194;
		word32 mstatus_195;
		smp_send.isra.9(ra_31, s1_32, s1_32, a0_22, 0x00, a5_60, mstatus_30, s0, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_187, out s1_188, out a3_189, out a4_190, out a5_191, out s2_192, out s3_193, out s5_194, out mstatus_195);
	}
	0x00 = (int8) dwArg38;
}

// 23053218: Register Eq_2 compute_and_send_master_dhcheck(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF0, Stack Eq_2 dwArgF4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out)
// Called from:
//      bt_smp_dhkey_ready
//      ble_auth_passkey_confirm
Eq_2 compute_and_send_master_dhcheck(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 dwArgD4, Eq_2 dwArgF0, Eq_2 dwArgF4, Eq_2 dwArg0118, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out)
{
	word32 a0_19;
	ptr32 a3_22;
	word32 t1_95;
	word32 a1_96;
	word32 a2_97;
	word32 a4_98;
	word32 a5_99;
	Eq_2 ra_25 = memset(ra, fp + -48, 0x00, 0x10, out t1_95, out a0_19, out a1_96, out a2_97, out a3_22, out a4_98, out a5_99);
	uint32 a5_28 = (word32) *((word32) a0 + 0x00A0);
	if (a5_28 > 0x05)
	{
		s0Out = a0;
		s1Out = s1;
		a0Out = 0x08;
		a3Out = a3_22;
		a4Out = 0x05;
		s2Out = s2;
		return ra_25;
	}
	else
	{
		<anonymous> * a5_41 = *((char *) g_a230BB9FC + a5_28 * 0x04);
		Eq_2 s0_43;
		ptr32 a0_45;
		Eq_2 ra_47;
		Eq_2 s1_48;
		Eq_2 s2_49;
		ptr32 a4_52;
		ptr32 a3_57;
		a5_41();
		s0Out = s0_43;
		s1Out = s1_48;
		a0Out = a0_45;
		a3Out = a3_57;
		a4Out = a4_52;
		s2Out = s2_49;
		return ra_47;
	}
}

// 230532CC: Register Eq_2 compute_and_check_and_send_slave_dhcheck(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out (ptr32 Eq_297626) s1Out, Register out (ptr32 Eq_297626) a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out)
// Called from:
//      smp_dhkey_check
//      bt_smp_dhkey_ready
//      ble_auth_passkey_confirm
Eq_2 compute_and_check_and_send_slave_dhcheck(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 dwArg0128, union Eq_2 & s0Out, struct Eq_297626 & s1Out, struct Eq_297626 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out)
{
	word32 a0_19;
	word32 t1_88;
	word32 a1_89;
	word32 a2_90;
	word32 a3_91;
	word32 a4_92;
	word32 a5_93;
	Eq_2 ra_25 = memset(ra, fp + -48, 0x00, 0x10, out t1_88, out a0_19, out a1_89, out a2_90, out a3_91, out a4_92, out a5_93);
	uint32 a5_28 = (word32) *((word32) a0 + 0x00A0);
	if (a5_28 > 0x05)
	{
		s0Out = a0;
		s1Out = dwLoc4C;
		a0Out = dwLoc4C;
		a3Out = s2;
		a4Out = 0x05;
		s2Out = s2;
		return dwLoc08;
	}
	else
	{
		<anonymous> * a5_42 = *((char *) g_a230BBA14 + a5_28 * 0x04);
		Eq_2 s0_44;
		struct Eq_297626 * a0_46;
		Eq_2 ra_48;
		struct Eq_297626 * s1_49;
		Eq_2 s2_50;
		ptr32 a4_53;
		Eq_2 a3_54;
		a5_42();
		s0Out = s0_44;
		s1Out = s1_49;
		a0Out = a0_46;
		a3Out = a3_54;
		a4Out = a4_53;
		s2Out = s2_50;
		return ra_48;
	}
}

