pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230533D8: void smp_dhkey_check(Register Eq_2 ra, Register (ptr32 Eq_297676) a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_297679) a5, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArgD8)
void smp_dhkey_check(Eq_2 ra, struct Eq_297676 * a1, Eq_2 a3, Eq_2 a4, struct Eq_297679 * a5, Eq_2 s3, ptr32 mstatus, Eq_2 dwArgD8)
{
	Eq_2 a0_13 = a5->t0000;
	Eq_2 s2_16 = a1->t0008;
	word32 s1_17 = (word32) a5->b0003;
	if (s1_17 != 0x00)
	{
		if (s1_17 != 0x01)
			return;
		word32 s4_258;
		word32 a5_257;
		word32 a3_255;
		word32 a4_256;
		word32 a2_254;
		word32 a0_252;
		word32 a1_253;
		word32 s8_259;
		Eq_2 s1_32 = atomic_and(a0_13, ~0x08000000, a3, a4, mstatus, out a0_252, out a1_253, out a2_254, out a3_255, out a4_256, out a5_257, out s4_258, out s8_259);
		Eq_2 a4_39;
		Eq_2 a3_44;
		word32 a1_260;
		word32 a2_261;
		word32 a5_262;
		word32 a6_263;
		word32 a7_264;
		memcpy((word32) a0_13 + 335, s2_16, 0x10, out a1_260, out a2_261, out a3_44, out a4_39, out a5_262, out a6_263, out a7_264);
		word32 a2_265;
		if (atomic_test_bit(s1_32, 0x07, out a2_265) == 0x00)
		{
			word32 a2_266;
			if (atomic_test_bit(s1_32, 0x09, out a2_266) == 0x00)
			{
				word32 s0_273;
				word32 s1_274;
				word32 a0_275;
				word32 a3_276;
				word32 a4_277;
				word32 s2_278;
				compute_and_check_and_send_slave_dhcheck(ra, s1_32, a0_13, s2_16, s3, dwArgD8, out s0_273, out s1_274, out a0_275, out a3_276, out a4_277, out s2_278);
				return;
			}
		}
		word32 a0_267;
		word32 a2_268;
		word32 a3_269;
		word32 a4_270;
		word32 a5_271;
		word32 s4_272;
		atomic_set_bit(a0_13, 0x08, a3_44, a4_39, mstatus, out a0_267, out a2_268, out a3_269, out a4_270, out a5_271, out s4_272);
	}
	else
	{
		word32 a1_101;
		word32 a3_103;
		word32 a4_250;
		word32 a5_251;
		word32 a2_249;
		word32 a0_248;
		word32 t1_247;
		Eq_2 ra_106 = memset(ra, fp + -32, 0x00, 0x10, out t1_247, out a0_248, out a1_101, out a2_249, out a3_103, out a4_250, out a5_251);
		uint32 a5_109 = (word32) *((word32) a0_13 + 0x00A0);
		if (a5_109 > 0x05)
			return;
		<anonymous> * a5_128 = *((char *) g_a230BBA2C + a5_109 * 0x04);
		word32 a2_137;
		word32 s4_142;
		word32 s8_143;
		word32 t3_144;
		word32 a7_145;
		word32 a6_146;
		word32 t1_147;
		word32 t4_148;
		word32 t5_149;
		word32 t6_150;
		a5_128();
	}
}

// 23053502: void smp_send_pairing_random(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
// Called from:
//      smp_pairing_confirm
//      smp_pairing_random
void smp_send_pairing_random(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	Eq_2 a0_18;
	Eq_2 a4_22;
	ptr32 mstatus_26;
	Eq_2 s1_28;
	word32 a2_168;
	word32 a3_169;
	word32 a5_170;
	word32 s2_171;
	word32 s3_172;
	word32 s5_173;
	Eq_2 ra_27 = smp_create_pdu.isra.7(ra, a0, a3, a4, a5, s5, mstatus, dwArg28, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s1_28, out a0_18, out a2_168, out a3_169, out a4_22, out a5_170, out s2_171, out s3_172, out s5_173, out mstatus_26);
	if (a0_18 != 0x00)
	{
		Eq_2 a5_56;
		word32 a1_174;
		word32 a5_175;
		word32 a1_176;
		word32 a2_177;
		word32 a3_178;
		word32 a4_179;
		word32 a6_180;
		word32 a7_181;
		memcpy(net_buf_simple_add((word32) a0_18 + 8, 0x10, a4_22, out a1_174, out a5_175), (word32) s1_28 + 191, 0x10, out a1_176, out a2_177, out a3_178, out a4_179, out a5_56, out a6_180, out a7_181);
		word32 s0_182;
		word32 s1_183;
		word32 a3_184;
		word32 a4_185;
		word32 a5_186;
		word32 s2_187;
		word32 s3_188;
		word32 s5_189;
		word32 mstatus_190;
		smp_send.isra.9(ra_27, s1_28, s1_28, a0_18, 0x00, a5_56, mstatus_26, s0, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_182, out s1_183, out a3_184, out a4_185, out a5_186, out s2_187, out s3_188, out s5_189, out mstatus_190);
	}
}

// 23053542: Register Eq_2 sc_send_public_key(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_pairing_rsp
//      smp_public_key
//      bt_smp_pkey_ready
//      ble_auth_pairing_confirm
Eq_2 sc_send_public_key(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	ptr32 a0_123;
	Eq_2 a0_22;
	word32 a2_202;
	word32 a5_203;
	Eq_2 a4_172;
	ptr32 a3_171;
	ptr32 mstatus_102;
	ptr32 s1_105;
	Eq_2 s2_108;
	ptr32 s3_109;
	ptr32 s5_111;
	Eq_2 ra_103 = smp_create_pdu.isra.7(ra, a0, a3, a4, a5, s5, mstatus, dwArg18, dwArg20, dwArg24, dwArg48, s3, ra, dwArg78, dwArgB8, dwArgD8, out s1_105, out a0_22, out a2_202, out a3_171, out a4_172, out a5_203, out s2_108, out s3_109, out s5_111, out mstatus_102);
	if (a0_22 != 0x00)
	{
		Eq_2 a1_56;
		word32 a5_204;
		Eq_2 a0_55 = net_buf_simple_add((word32) a0_22 + 8, 64, a4_172, out a1_56, out a5_204);
		word32 a1_64;
		word32 a2_205;
		word32 a3_206;
		word32 a4_207;
		word32 a5_208;
		word32 a6_209;
		word32 a7_210;
		memcpy(a0_55, a1_56, 32, out a1_64, out a2_205, out a3_206, out a4_207, out a5_208, out a6_209, out a7_210);
		Eq_2 a5_79;
		word32 a1_211;
		word32 a2_212;
		word32 a3_213;
		word32 a4_214;
		word32 a6_215;
		word32 a7_216;
		memcpy((word32) a0_55 + 32, a1_64 + 32, 32, out a1_211, out a2_212, out a3_213, out a4_214, out a5_79, out a6_215, out a7_216);
		word32 a5_217;
		ra_103 = smp_send.isra.9(ra_103, a0_22, s2_108, a0_22, 0x00, a5_79, mstatus_102, dwLoc1C, s2, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg44, dwArg4C, dwArg58, dwArg5C, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0, out s1_105, out a3_171, out a4_172, out a5_217, out s2_108, out s3_109, out s5_111, out mstatus_102);
		a0_123 = 0x00;
	}
	else
		a0_123 = 0x08;
	s0Out = s0;
	s1Out = s1_105;
	a0Out = a0_123;
	a3Out = a3_171;
	a4Out = a4_172;
	s2Out = s2_108;
	s3Out = s3_109;
	s5Out = s5_111;
	mstatusOut = mstatus_102;
	return ra_103;
}

