pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230535A8: Register Eq_2 send_pairing_rsp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_pairing_req
//      ble_auth_pairing_confirm
Eq_2 send_pairing_rsp(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & mstatusOut)
{
	ptr32 a0_100;
	Eq_2 a0_18;
	Eq_2 s1_28;
	word32 a2_173;
	word32 a5_174;
	word32 s3_175;
	word32 s5_176;
	ptr32 a3_144;
	Eq_2 a4_145;
	ptr32 mstatus_149;
	ptr32 s2_154;
	Eq_2 ra_150 = smp_create_pdu.isra.7(ra, a0, a3, a4, a5, s5, mstatus, dwArg28, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s1_28, out a0_18, out a2_173, out a3_144, out a4_145, out a5_174, out s2_154, out s3_175, out s5_176, out mstatus_149);
	if (a0_18 != 0x00)
	{
		Eq_2 a5_56;
		word32 a1_177;
		word32 a5_178;
		word32 a1_179;
		word32 a2_180;
		word32 a3_181;
		word32 a4_182;
		word32 a6_183;
		word32 a7_184;
		memcpy(net_buf_simple_add((word32) a0_18 + 8, 0x06, a4_145, out a1_177, out a5_178), (word32) s1_28 + 0x00A9, 0x06, out a1_179, out a2_180, out a3_181, out a4_182, out a5_56, out a6_183, out a7_184);
		word32 s0_185;
		word32 s1_186;
		word32 a5_187;
		word32 s3_188;
		word32 s5_189;
		ra_150 = smp_send.isra.9(ra_150, s1_28, s1_28, a0_18, 0x00, a5_56, mstatus_149, s0, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_185, out s1_186, out a3_144, out a4_145, out a5_187, out s2_154, out s3_188, out s5_189, out mstatus_149);
		a0_100 = 0x00;
	}
	else
		a0_100 = 0x08;
	a0Out = a0_100;
	a3Out = a3_144;
	a4Out = a4_145;
	s2Out = s2_154;
	mstatusOut = mstatus_149;
	return ra_150;
}

// 230535E8: Register Eq_2 bt_smp_distribute_keys(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_298225) s0Out, Register out Eq_2 s1Out, Register out Eq_298227 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_signing_info
//      smp_master_ident
//      bt_smp_encrypt_change
//      smp_ident_addr_info
Eq_2 bt_smp_distribute_keys(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, struct Eq_298225 & s0Out, union Eq_2 & s1Out, union Eq_298227 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	Eq_298227 a0_347;
	Eq_2 s1_237;
	struct Eq_298233 * a0_20 = *a0;
	Eq_2 s0_134 = a0;
	if (a0_20->dw009C == 0x00)
	{
		Eq_2 a3_503;
		word32 t4_880;
		word32 s9_877;
		word32 s10_878;
		word32 s11_879;
		word32 s6_874;
		word32 s7_875;
		word32 s8_876;
		word32 s3_871;
		word32 s4_872;
		word32 s5_873;
		word32 a5_868;
		word32 a7_869;
		word32 s2_870;
		word32 a0_865;
		word32 a1_866;
		word32 a2_867;
		word32 s0_864;
		ra = printf(bt_addr_le_str_real(ra, (char *) a0_20 + 112, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_864, out a3_503), &g_t230BBAF4, a3_503, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_237, out a0_865, out a1_866, out a2_867, out a3, out a4, out a5_868, out a7_869, out s2_870, out s3_871, out s4_872, out s5_873, out s6_874, out s7_875, out s8_876, out s9_877, out s10_878, out s11_879, out t4_880);
		goto l2305361A;
	}
	s1_237 = s1;
	struct Eq_64398 * a2_26;
	if (atomic_test_bit((word32) a0 + 0x009C, 0x05, out a2_26) == 0x00)
	{
		ui32 a5_28 = (word32) *((word32) a0 + 384);
		a5 = a5_28 & 0x01;
		s1_237 = s1;
		if ((a5_28 & 0x01) == 0x00)
			goto l2305366A;
		struct Eq_274 * a0_313;
		s0_134 = *(a5_28 & 0x01);
		Eq_2 a3_37;
		Eq_2 a4_38;
		Eq_2 a5_39;
		word32 s4_883;
		word32 s8_884;
		word32 a0_881;
		word32 a1_882;
		bt_rand(fp + -60, 0x1A, a2_26, out a0_881, out a1_882, out a3_37, out a4_38, out a5_39, out s4_883, out s8_884);
		Eq_2 a0_48;
		Eq_2 a4_52;
		Eq_2 s1_58;
		word32 s5_889;
		word32 a5_886;
		word32 s2_887;
		word32 s3_888;
		word32 a2_885;
		Eq_2 a3_158;
		Eq_2 ra_110 = smp_create_pdu.isra.7(ra, s0_134, a3_37, a4_38, a5_39, s5, mstatus, dwLoc08, dwArg00, dwArg04, dwArg28, dwArg44, dwArg4C, s1, dwArg98, dwArgB8, out s1_58, out a0_48, out a2_885, out a3_158, out a4_52, out a5_886, out s2_887, out s3_888, out s5_889, out mstatus);
		if (a0_48 == 0x00)
			a0_313 = (struct Eq_274 *) &g_t230BBB0C;
		else
		{
			word32 a1_890;
			word32 a5_891;
			Eq_2 a0_79 = net_buf_simple_add((word32) a0_48 + 8, 0x10, a4_52, out a1_890, out a5_891);
			word32 a5_896;
			word32 a6_897;
			word32 a7_898;
			word32 a4_895;
			word32 a1_892;
			word32 a2_893;
			word32 a3_894;
			memcpy(a0_79, fp + -60, (word32) *((word32) s1_58 + 8), out a1_892, out a2_893, out a3_894, out a4_895, out a5_896, out a6_897, out a7_898);
			up32 a0_98 = (word32) *((word32) s1_58 + 8);
			Eq_2 a5_109 = 0x0F;
			if (a0_98 <= 0x0F)
			{
				word32 a4_939;
				word32 a3_938;
				word32 a2_937;
				word32 a1_936;
				word32 a0_935;
				word32 t1_934;
				ra_110 = memset(ra_110, (word32) a0_79 + a0_98, 0x00, 0x10 - a0_98, out t1_934, out a0_935, out a1_936, out a2_937, out a3_938, out a4_939, out a5_109);
			}
			Eq_2 a3_127;
			Eq_2 a4_128;
			Eq_2 a5_129;
			ptr32 mstatus_132;
			Eq_2 s5_141;
			Eq_2 a0_155;
			Eq_2 a4_159;
			Eq_2 s1_165;
			word32 s5_933;
			word32 s3_932;
			word32 s2_931;
			word32 a5_930;
			word32 a2_929;
			word32 s2_927;
			word32 s3_928;
			word32 s1_926;
			ra_110 = smp_create_pdu.isra.7(smp_send.isra.9(ra_110, s1_58, s0_134, a0_48, 0x00, a5_109, mstatus, dwLoc3C, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg2C, dwArg38, dwArg3C, dwArg48, s3, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_134, out s1_926, out a3_127, out a4_128, out a5_129, out s2_927, out s3_928, out s5_141, out mstatus_132), s0_134, a3_127, a4_128, a5_129, s5_141, mstatus_132, dwLoc08, dwArg00, dwArg04, dwArg28, dwArg44, dwArg4C, s1, dwArg98, dwArgB8, out s1_165, out a0_155, out a2_929, out a3_158, out a4_159, out a5_930, out s2_931, out s3_932, out s5_933, out mstatus);
			if (a0_155 != 0x00)
			{
				word32 a5_952;
				word32 a1_951;
				Eq_2 a0_186 = net_buf_simple_add((word32) a0_155 + 8, 0x0A, a4_159, out a1_951, out a5_952);
				word32 a6_958;
				word32 a7_959;
				word32 a5_957;
				word32 a4_956;
				word32 a3_955;
				word32 a2_954;
				word32 a1_953;
				memcpy((word32) a0_186 + 2, fp + -44, 0x08, out a1_953, out a2_954, out a3_955, out a4_956, out a5_957, out a6_958, out a7_959);
				Eq_2 a5_210;
				word32 a1_960;
				word32 a2_961;
				word32 a3_962;
				word32 a4_963;
				word32 a6_964;
				word32 a7_965;
				memcpy(a0_186, fp + -36, 0x02, out a1_960, out a2_961, out a3_962, out a4_963, out a5_210, out a6_964, out a7_965);
				Eq_2 s3_241;
				word32 s2_966;
				ra = smp_send.isra.9(ra_110, s1_165, s0_134, a0_155, 0x23054164, a5_210, mstatus, dwLoc3C, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg2C, dwArg38, dwArg3C, dwArg48, s3, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_134, out s1_237, out a3, out a4, out a5, out s2_966, out s3_241, out s5, out mstatus);
				word32 a2_967;
				if (atomic_test_bit(s3_241, 0x0C, out a2_967) != 0x00)
				{
					bt_keys_add_type(s1_237, 0x01);
					word32 a1_982;
					word32 a2_983;
					word32 a3_984;
					word32 a4_985;
					word32 a5_986;
					word32 a6_987;
					word32 a7_988;
					memcpy((word32) s1_237 + 110, fp + -60, 0x10, out a1_982, out a2_983, out a3_984, out a4_985, out a5_986, out a6_987, out a7_988);
					word32 a1_989;
					word32 a2_990;
					word32 a3_991;
					word32 a4_992;
					word32 a5_993;
					word32 a6_994;
					word32 a7_995;
					memcpy((word32) s1_237 + 100, fp + -44, 0x08, out a1_989, out a2_990, out a3_991, out a4_992, out a5_993, out a6_994, out a7_995);
					word32 a1_996;
					word32 a2_997;
					word32 a6_998;
					word32 a7_999;
					memcpy((word32) s1_237 + 0x006C, fp + -36, 0x02, out a1_996, out a2_997, out a3, out a4, out a5, out a6_998, out a7_999);
				}
				goto l2305366A;
			}
			a0_313 = (struct Eq_274 *) &g_t230BBB38;
		}
		word32 a0_968;
		word32 a1_969;
		word32 a2_970;
		word32 a7_971;
		word32 s2_972;
		word32 s3_973;
		word32 s4_974;
		word32 s6_975;
		word32 s7_976;
		word32 s8_977;
		word32 s9_978;
		word32 s10_979;
		word32 s11_980;
		word32 t4_981;
		ra = printf(ra_110, a0_313, a3_158, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_237, out a0_968, out a1_969, out a2_970, out a3, out a4, out a5, out a7_971, out s2_972, out s3_973, out s4_974, out s5, out s6_975, out s7_976, out s8_977, out s9_978, out s10_979, out s11_980, out t4_981);
	}
l2305366A:
	ui32 a0_346 = (word32) *((word32) s0_134 + 384);
	a0_347 = a0_346 & 0x04;
	if ((a0_346 & 0x04) == 0x00)
		goto l2305361C;
	word32 a0_361;
	struct Eq_64398 * a2_363;
	Eq_2 a3_364;
	Eq_2 a4_365;
	Eq_2 s2_374;
	Eq_2 s3_375;
	word32 s1_899;
	word32 a5_900;
	word32 s5_901;
	Eq_2 ra_370 = smp_create_pdu.isra.7(ra, s0_134, a3, a4, a5, s5, mstatus, dwLoc08, dwArg00, dwArg04, dwArg28, dwArg44, dwArg4C, s1, dwArg98, dwArgB8, out s1_899, out a0_361, out a2_363, out a3_364, out a4_365, out a5_900, out s2_374, out s3_375, out s5_901, out mstatus);
	if (a0_361 != 0x00)
	{
		Eq_2 s4_404;
		word32 s8_908;
		word32 a3_906;
		word32 a4_907;
		word32 a0_904;
		word32 a1_905;
		word32 a1_902;
		word32 a5_903;
		Eq_2 a5_402;
		Eq_2 s1_403 = bt_rand(net_buf_simple_add(a0_361 + 0x08, 0x10, a4_365, out a1_902, out a5_903), 0x10, a2_363, out a0_904, out a1_905, out a3_906, out a4_907, out a5_402, out s4_404, out s8_908);
		word32 a2_909;
		if (atomic_test_bit(s3_375, 0x0C, out a2_909) != 0x00)
		{
			bt_keys_add_type(s2_374, 0x08);
			word32 a7_950;
			word32 a6_949;
			word32 a4_948;
			word32 a3_947;
			word32 a2_946;
			word32 a1_945;
			memcpy((word32) s2_374 + 60, s4_404, 0x10, out a1_945, out a2_946, out a3_947, out a4_948, out a5_402, out a6_949, out a7_950);
			((word32) s2_374 + 76)->u0 = 0x00;
		}
		word32 s5_944;
		word32 s3_943;
		word32 s2_942;
		word32 a5_941;
		word32 s0_940;
		ra = smp_send.isra.9(ra_370, s1_403, s0_134, s1_403, 587546028, a5_402, mstatus, dwLoc3C, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg2C, dwArg38, dwArg3C, dwArg48, s3, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_940, out s1_237, out a3, out a4, out a5_941, out s2_942, out s3_943, out s5_944, out mstatus);
		a0_347.u0 = 0x00;
l2305361C:
		s0Out = dwArg0158;
		s1Out = s1_237;
		a0Out = a0_347;
		a3Out = a3;
		a4Out = a4;
		mstatusOut = mstatus;
		return ra;
	}
	word32 t4_925;
	word32 s11_924;
	word32 s10_923;
	word32 s8_921;
	word32 s9_922;
	word32 s6_919;
	word32 s7_920;
	word32 s5_918;
	word32 s3_916;
	word32 s4_917;
	word32 a7_914;
	word32 s2_915;
	word32 a2_912;
	word32 a5_913;
	word32 a0_910;
	word32 a1_911;
	ra = printf(ra_370, &g_t230BBB64, a3_364, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_237, out a0_910, out a1_911, out a2_912, out a3, out a4, out a5_913, out a7_914, out s2_915, out s3_916, out s4_917, out s5_918, out s6_919, out s7_920, out s8_921, out s9_922, out s10_923, out s11_924, out t4_925);
l2305361A:
	a0_347.u0 = 0x08;
	goto l2305361C;
}

// 23053782: void smp_signing_info(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void smp_signing_info(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 s1_108;
	Eq_2 s0_120 = a0;
	s1_108 = s1;
	word32 a2_399;
	if (atomic_test_bit((word32) *s1 + 0x009C, 0x0C, out a2_399) != 0x00)
	{
		word32 a0_30;
		Eq_2 s2_38;
		word32 a3_400;
		word32 s4_401;
		ra = bt_keys_get_type(ra, a0, 0x10, (word32) *((word32) s1 + 8), (word32) s1 + 112, (word32) s1 + 112, mstatus, dwLoc20, dwLoc1C, s2, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1_108, out a0_30, out a3_400, out s2_38, out s3, out s4_401, out s5, out mstatus);
		if (a0_30 == 0x00)
		{
			Eq_2 a3_158;
			word32 s0_408;
			word32 s1_409;
			word32 a0_410;
			word32 a1_411;
			word32 a2_412;
			word32 a3_413;
			word32 a4_414;
			word32 a5_415;
			word32 a7_416;
			word32 s2_417;
			word32 s3_418;
			word32 s4_419;
			word32 s5_420;
			word32 s6_421;
			word32 s7_422;
			word32 s8_423;
			word32 s9_424;
			word32 s10_425;
			word32 s11_426;
			word32 t4_427;
			printf(bt_addr_le_str_real(ra, s2_38, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_408, out a3_158), &g_t230BBE60, a3_158, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_409, out a0_410, out a1_411, out a2_412, out a3_413, out a4_414, out a5_415, out a7_416, out s2_417, out s3_418, out s4_419, out s5_420, out s6_421, out s7_422, out s8_423, out s9_424, out s10_425, out s11_426, out t4_427);
			return;
		}
		word32 a1_402;
		word32 a2_403;
		word32 a4_404;
		word32 a5_405;
		word32 a6_406;
		word32 a7_407;
		memcpy(a0_30 + 80, s3, 0x10, out a1_402, out a2_403, out a3, out a4_404, out a5_405, out a6_406, out a7_407);
	}
	ui32 a5_76 = (word32) *((word32) a0 + 0x0181);
	*((word32) a0 + 0x0181) = (byte) (a5_76 & 0x00FB);
	Eq_2 a4_103 = (word32) *((word32) s1_108 + 3);
	Eq_2 a5_81 = a5_76 & 0x00FB | a4_103;
	if (a5_81 == 0x00)
	{
		word32 a0_91;
		ra = bt_smp_distribute_keys(ra, s1_108, a0, a3, a4_103, a5_81, s3, s5, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_120, out s1_108, out a0_91, out a3, out a4_103, out mstatus);
		if (a0_91 != 0x00)
			return;
	}
	if ((word32) *((word32) s0_120 + 384) == 0x00)
	{
		word32 a4_428;
		word32 a5_429;
		word32 s5_430;
		smp_pairing_complete(ra, s0_120, s1_108, s0_120, 0x00, a3, a4_103, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArgB8, dwArgF8, out a4_428, out a5_429, out s5_430);
	}
}

// 23053818: void smp_master_ident(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void smp_master_ident(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 s1_118;
	Eq_2 s0_150 = a0;
	s1_118 = s1;
	word32 a2_542;
	if (atomic_test_bit((word32) *s1 + 0x009C, 0x0C, out a2_542) != 0x00)
	{
		word32 a0_32;
		Eq_2 s4_42;
		word32 a3_543;
		word32 s2_544;
		ra = bt_keys_get_type(ra, a0, 0x04, (word32) *((word32) s1 + 8), (word32) s1 + 112, a1, mstatus, dwLoc20, s4, s2, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1_118, out a0_32, out a3_543, out s2_544, out s3, out s4_42, out s5, out mstatus);
		if (a0_32 == 0x00)
		{
			Eq_2 a3_213;
			word32 s10_575;
			word32 s9_574;
			word32 s1_559;
			word32 s0_558;
			word32 a1_561;
			word32 a0_560;
			word32 a3_563;
			word32 a2_562;
			word32 a7_566;
			word32 a5_565;
			word32 s4_569;
			word32 a4_564;
			word32 s3_568;
			word32 s2_567;
			word32 s5_570;
			word32 s7_572;
			word32 s8_573;
			word32 s6_571;
			word32 s11_576;
			word32 t4_577;
			printf(bt_addr_le_str_real(ra, s4_42, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_558, out a3_213), &g_t230BBE60, a3_213, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_559, out a0_560, out a1_561, out a2_562, out a3_563, out a4_564, out a5_565, out a7_566, out s2_567, out s3_568, out s4_569, out s5_570, out s6_571, out s7_572, out s8_573, out s9_574, out s10_575, out s11_576, out t4_577);
			return;
		}
		word32 a1_545;
		word32 a3_547;
		word32 a2_546;
		word32 a5_549;
		word32 a4_548;
		word32 a7_551;
		word32 a6_550;
		memcpy(a0_32 + 0x14, s3, 0x02, out a1_545, out a2_546, out a3_547, out a4_548, out a5_549, out a6_550, out a7_551);
		word32 a2_553;
		word32 a1_552;
		word32 a6_556;
		word32 a5_555;
		word32 a4_554;
		word32 a7_557;
		memcpy(a0_32 + 0x0C, (word32) s3 + 2, 0x08, out a1_552, out a2_553, out a3, out a4_554, out a5_555, out a6_556, out a7_557);
		*((word32) a0 + 0x0181) = (byte) ((word32) *((word32) a0 + 0x0181) & ~0x01);
	}
	ui32 a5_98 = (word32) *((word32) a0 + 0x0181);
	word32 a1_102 = 0x08;
	Eq_2 a4_100 = a5_98 & 2;
	if ((a5_98 & 2) == 0x00)
	{
		if ((a5_98 & 0x04) == 0x00)
		{
l230538B2:
			if ((word32) *((word32) s1_118 + 3) == 0x00)
			{
				Eq_2 a5_128 = (word32) *((word32) a0 + 0x0181);
				if (a5_128 == 0x00)
				{
					word32 a0_146;
					ra = bt_smp_distribute_keys(ra, s1_118, a0, a3, a4_100, a5_128, s3, s5, mstatus, dwLoc20, s4, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_150, out s1_118, out a0_146, out a3, out a4_100, out mstatus);
					if (a0_146 != 0x00)
						return;
				}
			}
			if ((word32) *((word32) s0_150 + 384) == 0x00)
			{
				word32 a4_582;
				word32 a5_583;
				word32 s5_584;
				smp_pairing_complete(ra, s0_150, s1_118, s0_150, 0x00, a3, a4_100, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArgB8, dwArgF8, out a4_582, out a5_583, out s5_584);
			}
			return;
		}
		a1_102 = 0x0A;
	}
	word32 a0_578;
	word32 a2_579;
	word32 a5_580;
	word32 s4_581;
	s1_118 = atomic_set_bit(a0, a1_102, a3, a5_98 & 2, mstatus, out a0_578, out a2_579, out a3, out a4_100, out a5_580, out s4_581);
	goto l230538B2;
}

