pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230538DC: Register Eq_2 smp_init(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_299250) s2Out, Register out (ptr32 Eq_299251) s3Out, Register out ptr32 s5Out)
// Called from:
//      smp_pairing_req
//      bt_smp_start_security
Eq_2 smp_init(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, struct Eq_299250 & s2Out, struct Eq_299251 & s3Out, ptr32 & s5Out)
{
	struct Eq_64398 * a2_18;
	word32 t1_152;
	word32 a0_153;
	word32 a1_154;
	word32 a3_155;
	word32 a4_156;
	word32 a5_157;
	Eq_2 ra_119 = memset(ra, (word32) a0 + 0x0098, 0x00, 0x00EC, out t1_152, out a0_153, out a1_154, out a2_18, out a3_155, out a4_156, out a5_157);
	Eq_2 a0_27;
	word32 a1_158;
	word32 s4_159;
	word32 s8_160;
	Eq_2 a4_113;
	Eq_2 a3_112;
	ptr32 a5_114;
	Eq_2 s1_120 = bt_rand((word32) a0 + 191, 0x10, a2_18, out a0_27, out a1_158, out a3_112, out a4_113, out a5_114, out s4_159, out s8_160);
	Eq_2 s0_38 = 0x08;
	if (a0_27 == 0x00)
	{
		Eq_2 a3_46;
		Eq_2 a4_47;
		word32 a0_161;
		word32 a2_162;
		word32 a5_163;
		word32 s4_164;
		atomic_set_bit(a0_27, 0x05, a3_112, a4_113, mstatus, out a0_161, out a2_162, out a3_46, out a4_47, out a5_163, out s4_164);
		word32 a5_165;
		g_t4200F49C = bt_pub_key_get(out a5_165);
		s0_38 = a0_27;
		word32 a0_166;
		word32 a1_167;
		word32 s4_168;
		word32 s6_169;
		word32 s7_170;
		word32 s8_171;
		ra_119 = k_sem_init(ra_119, a0_27, 0x42026614, 0x00, 0x01, a3_46, a4_47, 0x4200F000, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgD8, dwArg0118, out s1_120, out a0_166, out a1_167, out a3_112, out a4_113, out a5_114, out s2, out s3, out s4_168, out s5, out s6_169, out s7_170, out s8_171);
	}
	s1Out = s1_120;
	a0Out = s0_38;
	a3Out = a3_112;
	a4Out = a4_113;
	a5Out = a5_114;
	s2Out = s2;
	s3Out = s3;
	s5Out = s5;
	return ra_119;
}

// 23053936: Register Eq_2 smp_send_pairing_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_security_request
//      bt_smp_start_security
Eq_2 smp_send_pairing_req(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	word32 s1_478;
	word32 a5_479;
	word32 s4_480;
	word32 s5_481;
	Eq_2 s3_130;
	Eq_2 s2_129;
	Eq_2 a4_115;
	Eq_2 a3_114;
	Eq_2 ra_107 = smp_chan_get(ra, a0, a3, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out s1_478, out a3_114, out a4_115, out a5_479, out s2_129, out s3_130, out s4_480, out s5_481);
	Eq_2 s1_282 = -57;
	if (a0 != 0x00)
	{
		Eq_2 s0_105 = a0;
		s1_282.u0 = ~0x04;
		word32 a2_482;
		if (atomic_test_bit((word32) a0 + 0x009C, 0x04, out a2_482) != 0x00)
			goto l23053970;
		word32 a2_483;
		if (atomic_test_bit((word32) a0 + 0x009C, 0x03, out a2_483) != 0x00)
		{
l2305396E:
			s1_282.u0 = ~0x0F;
			goto l23053970;
		}
		word32 a2_484;
		if (atomic_test_bit((word32) a0 + 0x009C, 0x01, out a2_484) != 0x00)
			goto l2305396E;
		word32 a0_63;
		s1_282 = sec_level_reachable.isra.1((word32) *((word32) s3_130 + 0x0A), a3_114, a4_115, out a0_63, out a3_114, out a4_115);
		if (a0_63 != 0x00)
		{
			if (*((word32) s3_130 + 0x009C) == 0x00)
			{
				Eq_2 a0_75;
				word32 s4_515;
				word32 s5_516;
				ra_107 = bt_keys_get_addr(ra_107, a0, (word32) *((word32) s3_130 + 8), (word32) s3_130 + 112, s2_129, s3_130, (word32) a0 + 0x009C, mstatus, dwLoc20, s4, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_105, out s1_282, out a0_75, out a3_114, out a4_115, out s2_129, out s3_130, out s4_515, out s5_516, out mstatus);
				*((word32) s3_130 + 0x009C) = a0_75;
				if (a0_75 == 0x00)
					goto l23053970;
			}
			word32 a0_111;
			Eq_2 a5_116;
			Eq_2 s5_131;
			word32 s1_485;
			ra_107 = smp_init(ra_107, s0_105, mstatus, s2, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArgF8, out s1_485, out a0_111, out a3_114, out a4_115, out a5_116, out s2_129, out s3_130, out s5_131);
			if (a0_111 != 0x00)
			{
l230539AA:
				s1_282.u0 = -55;
				goto l23053970;
			}
			Eq_2 a0_139;
			word32 s1_486;
			word32 a2_487;
			word32 a5_488;
			word32 s5_489;
			ra_107 = smp_create_pdu.isra.7(ra_107, s0_105, a3_114, a4_115, a5_116, s5_131, mstatus, dwArg18, dwArg20, dwArg24, dwArg48, s3, ra, dwArg78, dwArgB8, dwArgD8, out s1_486, out a0_139, out a2_487, out a3_114, out a4_115, out a5_488, out s2_129, out s3_130, out s5_489, out mstatus);
			if (a0_139 == 0x00)
				goto l230539AA;
			word32 a1_490;
			word32 a5_491;
			Eq_2 a0_170 = net_buf_simple_add((word32) a0_139 + 8, 0x06, a4_115, out a1_490, out a5_491);
			word32 a0_176;
			Eq_2 a3_178;
			Eq_2 a4_179;
			word32 a5_492;
			Eq_2 s1_181 = get_auth.isra.0((word32) s3_130 + 0x0A, 0x09, a3_114, a4_115, out a0_176, out a3_178, out a4_179, out a5_492);
			*((word32) a0_170 + 2) = (byte) a0_176;
			word32 a3_493;
			Eq_296862 a0_184 = get_io_capa(a3_178, a4_179, out a3_493);
			word32 a5_188 = (word32) g_b4200F498;
			*a0_170 = (byte) a0_184;
			*((word32) a0_170 + 1) = (byte) a5_188;
			*((word32) a0_170 + 3) = 0x10;
			*((word32) a0_170 + 4) = 0x05;
			((word32) a0_170 + 5)->u0 = 0x07;
			((word32) s0_105 + 384)->u0 = 0x0705;
			*((word32) s0_105 + 161) = 0x01;
			Eq_2 a5_205;
			word32 a1_494;
			word32 a2_495;
			word32 a3_496;
			word32 a4_497;
			word32 a6_498;
			word32 a7_499;
			memcpy((word32) s0_105 + 0x00A2, a0_170, 0x06, out a1_494, out a2_495, out a3_496, out a4_497, out a5_205, out a6_498, out a7_499);
			Eq_2 a3_223;
			Eq_2 a4_224;
			word32 s0_230;
			word32 s1_500;
			word32 a5_501;
			word32 s5_502;
			ra_107 = smp_send.isra.9(ra_107, s1_181, s0_105, a0_139, 0x00, a5_205, mstatus, s4, s2, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg44, dwArg4C, dwArg58, dwArg5C, s1, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_230, out s1_500, out a3_223, out a4_224, out a5_501, out s2_129, out s3_130, out s5_502, out mstatus);
			Eq_2 a3_255;
			Eq_2 a4_256;
			word32 a0_503;
			word32 a2_504;
			word32 a5_505;
			word32 s4_506;
			atomic_set_bit(s0_230 + 0x0098, 0x02, a3_223, a4_224, mstatus, out a0_503, out a2_504, out a3_255, out a4_256, out a5_505, out s4_506);
			Eq_2 a3_267;
			Eq_2 a4_268;
			word32 a0_507;
			word32 a2_508;
			word32 a5_509;
			word32 s4_510;
			atomic_set_bit(s0_230 + 0x0098, 11, a3_255, a4_256, mstatus, out a0_507, out a2_508, out a3_267, out a4_268, out a5_509, out s4_510);
			word32 a0_511;
			word32 a2_512;
			word32 a5_513;
			word32 s4_514;
			s1_282 = atomic_set_bit(s0_230 + 0x0098, 0x03, a3_267, a4_268, mstatus, out a0_511, out a2_512, out a3_114, out a4_115, out a5_513, out s4_514);
		}
	}
l23053970:
	s0Out = s1;
	s1Out = s1_282;
	a0Out = s1_282;
	a3Out = a3_114;
	a4Out = a4_115;
	s2Out = s2_129;
	s3Out = s3_130;
	mstatusOut = mstatus;
	return ra_107;
}

// 23053A52: void smp_security_request(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register (ptr32 Eq_299691) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void smp_security_request(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, struct Eq_299691 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	byte * s2_18 = a1->ptr0008;
	Eq_2 s1_101 = a0 + 0x009C;
	word32 a2_615;
	if (atomic_test_bit(a0 + 0x009C, 0x03, out a2_615) != 0x00)
		return;
	word32 a2_616;
	if (atomic_test_bit(a0 + 0x009C, 0x01, out a2_616) != 0x00)
		return;
	ui32 a5_30 = (word32) *s2_18;
	Eq_2 a4_148 = (word32) g_b4200F4A0;
	Eq_2 s2_172 = a5_30 & 7;
	if (a4_148 != 0x00)
		s2_172 = a5_30 & 0x0F;
	Eq_2 a3_121;
	Eq_2 a4_122;
	ptr32 mstatus_126;
	Eq_2 s0_128;
	word32 a1_147;
	Eq_2 ra_168;
	Eq_2 s0_182;
	Eq_2 a5_36 = *((word32) s0 + 0x009C);
	if (a5_36 != 0x00)
	{
		s0_182 = s0;
		s0_182 = s0;
		ra_168 = ra;
		if (((word32) *((word32) a5_36 + 0x0A) & 36) == 0x00)
			goto l23053AA6;
	}
	else
	{
		Eq_2 a0_41;
		word32 a5_617;
		s0_182 = bt_keys_find(32, (word32) *((word32) s0 + 8), (word32) s0 + 112, out s1_101, out a0_41, out a3, out a4_148, out a5_617, out s2_172, out s3, out s4);
		*((word32) s0_182 + 0x009C) = a0_41;
		if (a0_41 == 0x00)
		{
			Eq_2 a0_59;
			word32 a5_635;
			s0_182 = bt_keys_find(0x04, (word32) *((word32) s0_182 + 8), s3, out s1_101, out a0_59, out a3, out a4_148, out a5_635, out s2_172, out s3, out s4);
			*((word32) s0_182 + 0x009C) = a0_59;
		}
	}
	Eq_2 a1_78 = *((word32) s0_182 + 0x009C);
	ra_168 = ra;
	if (a1_78 != 0x00)
	{
		Eq_2 a5_107 = s2_172 & 4;
		if (a5_107 != 0x00)
		{
			ui32 a5_82 = (word32) *((word32) a1_78 + 9);
			a5_107 = a5_82 & 0x01;
			if ((a5_82 & 0x01) == 0x00)
			{
				ra_168 = ra;
				if (get_io_capa(a3, a4_148, out a3) == 0x03)
				{
					word32 s11_633;
					word32 t4_634;
					word32 s7_629;
					word32 s8_630;
					word32 s9_631;
					word32 s10_632;
					word32 s5_627;
					word32 s6_628;
					word32 a5_625;
					word32 a7_626;
					word32 a2_623;
					word32 a4_624;
					word32 a0_621;
					word32 a1_622;
					ra_168 = printf(ra, &g_t230BBEAC, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_101, out a0_621, out a1_622, out a2_623, out a3, out a4_624, out a5_625, out a7_626, out s2_172, out s3, out s4, out s5_627, out s6_628, out s7_629, out s8_630, out s9_631, out s10_632, out s11_633, out t4_634);
				}
				goto l23053AA6;
			}
		}
		s2_172 &= 8;
		if (s2_172 == 0x00)
		{
l23053B22:
			int32 a0_118;
			word32 s3_637;
			word32 s2_636;
			bt_conn_le_start_encryption(ra, s1_101, (word32) a1_78 + 22, (word32) *((word32) a1_78 + 8), a5_107, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_128, out a0_118, out a3_121, out a4_122, out s2_636, out s3_637, out mstatus_126);
			a1_147 = 0x01;
			if (a0_118 < 0x00)
				return;
			goto l23053AB2;
		}
		ui32 a5_88 = (word32) *((word32) a1_78 + 0x0A);
		a5_107 = a5_88 & 32;
		ra_168 = ra;
		if ((a5_88 & 32) != 0x00)
			goto l23053B22;
	}
l23053AA6:
	int32 a0_201;
	word32 s2_619;
	word32 s3_620;
	word32 s1_618;
	smp_send_pairing_req(ra_168, s0_182, s1_101, s0_182, a3, s2_172, s3, s4, mstatus, dwLoc20, dwLoc1C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_128, out s1_618, out a0_201, out a3_121, out a4_122, out s2_619, out s3_620, out mstatus_126);
	if (a0_201 < 0x00)
		return;
	a1_147 = 0x0E;
l23053AB2:
	word32 a4_641;
	word32 a5_642;
	word32 s4_643;
	word32 a0_638;
	word32 a2_639;
	word32 a3_640;
	atomic_set_bit(s0_128, a1_147, a3_121, a4_122, mstatus_126, out a0_638, out a2_639, out a3_640, out a4_641, out a5_642, out s4_643);
}

