pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23053B4C: void smp_pairing_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void smp_pairing_req(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	if (((word32) *((word32) s1 + 3) + ~0x06 & 0x00FF) > 0x09)
		return;
	Eq_2 ra_260;
	Eq_2 s1_101;
	Eq_2 s3_121 = *a0;
	Eq_2 s0_23 = a0;
	ra_260 = ra;
	s1_101 = s1;
	if (*((word32) s3_121 + 0x009C) == 0x00)
	{
		Eq_2 a0_28;
		word32 a3_1161;
		word32 s4_1164;
		word32 s2_1163;
		word32 a4_1162;
		ra_260 = bt_keys_get_addr(ra, a0, (word32) *((word32) s3_121 + 8), (word32) s3_121 + 112, s2, s3_121, s4, mstatus, dwLoc20, s4, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_23, out s1_101, out a0_28, out a3_1161, out a4_1162, out s2_1163, out s3_121, out s4_1164, out s5, out mstatus);
		*((word32) s3_121 + 0x009C) = a0_28;
		if (a0_28 == 0x00)
			return;
	}
	word32 a2_1165;
	if (atomic_test_bit((word32) s0_23 + 0x009C, 0x0E, out a2_1165) == 0x00)
	{
		word32 a0_71;
		word32 a5_1168;
		word32 a3_1166;
		word32 s2_1169;
		word32 a4_1167;
		ra_260 = smp_init(ra_260, s0_23, mstatus, s2, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgB8, dwArgF8, out s1_101, out a0_71, out a3_1166, out a4_1167, out a5_1168, out s2_1169, out s3_121, out s5);
		if (a0_71 != 0x00)
			return;
	}
	*((word32) s0_23 + 161) = 0x01;
	Eq_2 a4_105;
	Eq_2 a3_110;
	word32 a7_1174;
	word32 a6_1173;
	word32 a5_1172;
	word32 a1_1170;
	word32 a2_1171;
	memcpy((word32) s0_23 + 0x00A2, s1_101, 0x06, out a1_1170, out a2_1171, out a3_110, out a4_105, out a5_1172, out a6_1173, out a7_1174);
	((word32) s0_23 + 0x00A8)->u0 = 0x02;
	ui32 a0_124;
	Eq_2 a3_126;
	word32 a5_1175;
	Eq_2 a4_127;
	Eq_2 s1_129 = get_auth.isra.0((word32) s3_121 + 0x0A, (word32) *((word32) s1_101 + 2), a3_110, a4_105, out a0_124, out a3_126, out a4_127, out a5_1175);
	*((word32) s0_23 + 171) = (byte) a0_124;
	Eq_2 a3_135;
	Eq_296862 a0_133 = get_io_capa(a3_126, a4_127, out a3_135);
	word32 a5_137 = (word32) g_b4200F498;
	*((word32) s0_23 + 0x00A9) = (byte) a0_133;
	*((word32) s0_23 + 0x00AA) = (byte) a5_137;
	((word32) s0_23 + 0x00AC)->u0 = 0x10;
	*((word32) s0_23 + 0x00AD) = (byte) ((word32) *((word32) s1_129 + 4) & 0x07);
	*((word32) s0_23 + 0x00AE) = (byte) ((word32) *((word32) s1_129 + 5) & 0x05);
	if ((a0_124 & 8) != 0x00 && ((word32) (*((word32) s1_129 + 2)) & 0x08) != 0x00)
	{
		word32 a5_1178;
		word32 s4_1179;
		word32 a2_1177;
		word32 a0_1176;
		s1_129 = atomic_set_bit(s0_23, 0x05, a3_135, a4_127, mstatus, out a0_1176, out a2_1177, out a3_135, out a4_127, out a5_1178, out s4_1179);
		*((word32) s0_23 + 0x00AD) = (byte) ((word32) *((word32) s0_23 + 0x00AD) & 0x06);
		*((word32) s0_23 + 0x00AE) = (byte) ((word32) *((word32) s0_23 + 0x00AE) & 0x04);
	}
	if (((word32) *((word32) s0_23 + 171) & 32) != 0x00 && ((word32) (*((word32) s1_129 + 2)) & 32) != 0x00)
	{
		word32 a0_1180;
		word32 a5_1182;
		word32 a2_1181;
		word32 s4_1183;
		s1_129 = atomic_set_bit(s0_23, 0x13, a3_135, a4_127, mstatus, out a0_1180, out a2_1181, out a3_135, out a4_127, out a5_1182, out s4_1183);
	}
	*((word32) s0_23 + 384) = (byte) (word32) *((word32) s0_23 + 0x00AE);
	*((word32) s0_23 + 0x0181) = (byte) (word32) *((word32) s0_23 + 0x00AD);
	if (((word32) *((word32) s0_23 + 171) & 0x01) != 0x00 && ((word32) (*((word32) s1_129 + 2)) & 0x01) != 0x00)
	{
		word32 a0_1187;
		word32 a2_1188;
		word32 a5_1189;
		word32 s4_1190;
		atomic_set_bit(s0_23, 0x0C, a3_135, a4_127, mstatus, out a0_1187, out a2_1188, out a3_135, out a4_127, out a5_1189, out s4_1190);
	}
	Eq_2 a3_231;
	Eq_2 a4_232;
	Eq_2 s4_235;
	Eq_2 s2_254;
	word32 a0_1184;
	word32 a2_1185;
	word32 a5_1186;
	*((word32) s0_23 + 0x00A0) = (byte) get_pair_method(s0_23, (word32) *atomic_set_bit(s0_23, 0x03, a3_135, a4_127, mstatus, out a0_1184, out a2_1185, out a3_231, out a4_232, out a5_1186, out s4_235), a3_231, a4_232, dwArg18, out s2_254);
	Eq_2 a4_268;
	Eq_2 a3_267;
	if (update_keys_check(ra_260, s0_23, s2_254, s3_121, s4_235, mstatus, dwLoc20, s4, s2, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a3_267, out a4_268) == 0x00)
		return;
	word32 a2_1191;
	Eq_2 a0_275 = atomic_test_bit(s2_254, 0x05, out a2_1191);
	Eq_2 a5_278 = (word32) *((word32) s0_23 + 0x00A0);
	if (a0_275 != 0x00)
	{
		a3_267 = (word32) *((word32) s3_121 + 0x0A);
		a4_268.u0 = 0x04;
		if (a3_267 == 0x04)
		{
			if (a5_278 == 0x00)
				return;
			uint32 a4_290 = (word32) *((word32) s0_23 + 0x00AC);
			uint32 a5_291 = (word32) *((word32) s0_23 + 0x00A5);
			if (a4_290 < a5_291)
				a5_291 = a4_290;
			a4_268.u0 = 0x10;
			if ((a5_291 & 0x00FF) != 0x10)
				return;
		}
		else if (a5_278 == 0x00)
		{
			word32 a2_1205;
			if (atomic_test_bit(s2_254, 0x0E, out a2_1205) == 0x00)
			{
				Eq_2 a5_288 = g_t42026610;
				if (a5_288 != 0x00 && *((word32) a5_288 + 20) != 0x00)
				{
l23053CDA:
					word32 a0_465;
					word32 s4_472;
					word32 a5_1196;
					word32 a2_1193;
					word32 a4_1195;
					word32 a3_1194;
					Eq_2 s1_471 = atomic_set_bit(s0_23, 0x09, a3_267, a4_268, mstatus, out a0_465, out a2_1193, out a3_1194, out a4_1195, out a5_1196, out s4_472);
					<anonymous> * a5_479 = *((word32) g_t42026610 + 20);
					word32 a3_498;
					word32 a7_500;
					word32 t0_501;
					word32 t1_502;
					word32 t4_503;
					word32 t5_504;
					word32 t6_505;
					word32 tp_506;
					word32 s10_507;
					word32 s11_508;
					word32 s6_510;
					word32 s7_511;
					word32 s9_512;
					a5_479();
					return;
				}
			}
		}
		Eq_2 a3_308;
		Eq_2 a4_309;
		Eq_2 a5_310;
		word32 a0_1197;
		word32 a2_1198;
		word32 s4_1199;
		atomic_set_bit(s0_23, 0x0C, a3_267, a4_268, mstatus, out a0_1197, out a2_1198, out a3_308, out a4_309, out a5_310, out s4_1199);
		word32 a4_1202;
		word32 a3_1201;
		word32 a0_1200;
		word32 s2_1203;
		word32 mstatus_1204;
		send_pairing_rsp(ra_260, s1, s0_23, a3_308, a4_309, a5_310, s5, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out a0_1200, out a3_1201, out a4_1202, out s2_1203, out mstatus_1204);
	}
	else
	{
		if (a5_278 == 0x00)
		{
			word32 a2_1192;
			if (atomic_test_bit(s2_254, 0x0E, out a2_1192) == 0x00)
			{
				a5_278 = g_t42026610;
				if (a5_278 != 0x00)
				{
					a5_278 = *((word32) a5_278 + 20);
					if (a5_278 != 0x00)
						goto l23053CDA;
				}
			}
		}
		word32 a0_383;
		Eq_2 a3_386;
		Eq_2 a4_387;
		ptr32 mstatus_391;
		Eq_2 s2_396;
		Eq_2 ra_392 = send_pairing_rsp(ra_260, s0_23, s0_23, a3_267, a4_268, a5_278, s5, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg58, dwArg5C, s3, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out a0_383, out a3_386, out a4_387, out s2_396, out mstatus_391);
		if (a0_383 != 0x00)
			return;
		word32 a3_1208;
		word32 a2_1207;
		word32 a0_1206;
		word32 a4_1209;
		word32 a5_1210;
		word32 s4_1211;
		Eq_2 s1_420 = atomic_set_bit(s0_23, 0x03, a3_386, a4_387, mstatus_391, out a0_1206, out a2_1207, out a3_1208, out a4_1209, out a5_1210, out s4_1211);
		word32 s0_1212;
		word32 a0_1213;
		word32 s5_1217;
		word32 s2_1216;
		word32 a3_1214;
		word32 a4_1215;
		word32 mstatus_1218;
		legacy_request_tk(ra_392, s1_420, s2_396, mstatus_391, dwArg08, dwArg18, dwArg44, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgC4, out s0_1212, out a0_1213, out a3_1214, out a4_1215, out s2_1216, out s5_1217, out mstatus_1218);
	}
}

// 23053D76: void smp_check_complete.part.16(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118)
// Called from:
//      smp_sign_info_sent
//      smp_ident_sent
void smp_check_complete.part.16(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118)
{
	Eq_2 a0_12 = bt_l2cap_le_lookup_tx_cid(a0, 0x06);
	Eq_2 a4_14 = (word32) *((word32) a0_12 + 384);
	*((word32) a0_12 + 384) = (byte) (~a1 & a4_14);
	if ((word32) *((word32) a0_12 + 384) != 0x00)
		return;
	word32 a4_101;
	word32 a5_102;
	word32 s5_103;
	smp_pairing_complete(ra, s0, s1, a0_12, 0x00, a3, a4_14, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_101, out a5_102, out s5_103);
}

