pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23053DAC: void smp_sign_info_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118)
void smp_sign_info_sent(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118)
{
	if ((word32) *((word32) a0 + 2) != 0x01)
		return;
	smp_check_complete.part.16(ra, s0, s1, a0, 0x04, a3, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118);
}

// 23053DBE: void le_sc_oob_config_set.isra.3.constprop.19(Register (ptr32 byte) a1, Register (ptr32 Eq_300600) a5)
void le_sc_oob_config_set.isra.3.constprop.19(byte * a1, struct Eq_300600 * a5)
{
	ui32 a5_11;
	struct Eq_300602 * a0_5 = a5->ptr0000;
	ui32 a3_6 = (word32) a0_5->b00A3;
	ui32 a4_7 = (word32) a0_5->b00AA;
	if ((word32) a5->b0003 == 0x00)
	{
		a5_11 = (a4_7 & 0x01) + 1;
		if ((a3_6 & 0x01) == 0x00)
		{
			a5_11 = 0x03;
			if ((a4_7 & 0x01) != 0x00)
				a5_11 = 0x00;
		}
	}
	else
	{
		a5_11 = (a4_7 & 0x01) << 0x01;
		if ((a3_6 & 0x01) == 0x00)
		{
			a5_11 = 0x03;
			if ((a4_7 & 0x01) != 0x00)
				a5_11 = 0x01;
		}
	}
	*a1 = (byte) a5_11;
}

// 23053DF4: Register Eq_2 smp_error(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_smp_dhkey_ready
//      bt_smp_recv
//      bt_smp_pkey_ready
//      bt_smp_auth_passkey_entry
//      bt_smp_update_keys
//      ble_auth_passkey_confirm
Eq_2 smp_error(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 s0_11 = a0;
	Eq_2 a4_21;
	Eq_2 a5_22;
	Eq_2 s5_29;
	Eq_2 a0_41;
	word32 a2_190;
	word32 a5_191;
	word32 s2_192;
	ptr32 a3_160;
	Eq_2 a4_161;
	ptr32 mstatus_165;
	Eq_2 s1_168;
	ptr32 s3_172;
	ptr32 s5_100;
	Eq_2 ra_166 = smp_create_pdu.isra.7(ra, a0, smp_pairing_complete(ra, a0, a1, a0, a1, a3, a4, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArgB8, dwArgF8, out a4_21, out a5_22, out s5_29), a4_21, a5_22, s5_29, mstatus, dwArg18, dwArg20, dwArg24, dwArg48, dwArg64, ra, dwArg78, dwArgB8, dwArgD8, out s1_168, out a0_41, out a2_190, out a3_160, out a4_161, out a5_191, out s2_192, out s3_172, out s5_100, out mstatus_165);
	if (a0_41 != 0x00)
	{
		Eq_2 a5_76;
		word32 a1_193;
		Eq_2 a0_74 = net_buf_simple_add((word32) a0_41 + 8, 0x01, a4_161, out a1_193, out a5_76);
		*a0_74 = (byte) s1_168;
		word32 a0_194;
		word32 a1_195;
		word32 a5_196;
		word32 s2_197;
		word32 s4_198;
		word32 s6_199;
		word32 s7_200;
		word32 s8_201;
		word32 s9_202;
		word32 s10_203;
		word32 s11_204;
		ra_166 = bt_l2cap_send_cb(ra_166, s1_168, a0_74, 0x06, a0_41, 0x00, a5_76, mstatus_165, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_11, out s1_168, out a0_194, out a1_195, out a3_160, out a4_161, out a5_196, out s2_197, out s3_172, out s4_198, out s5_100, out s6_199, out s7_200, out s8_201, out s9_202, out s10_203, out s11_204, out mstatus_165);
	}
	s0Out = s0_11;
	s1Out = s1_168;
	a3Out = a3_160;
	a4Out = a4_161;
	s3Out = s3_172;
	s5Out = s5_100;
	mstatusOut = mstatus_165;
	return ra_166;
}

// 23053E3E: void bt_smp_dhkey_ready(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void bt_smp_dhkey_ready(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	word32 s1_34;
	word32 a0_23;
	word32 s4_465;
	word32 a1_463;
	word32 a5_464;
	Eq_2 a4_100;
	Eq_2 a3_113;
	atomic_test_and_clear_bit(0x07, a3, a4, mstatus, out a0_23, out a1_463, out a3_113, out a4_100, out a5_464, out s4_465);
	if (a0_23 == 0x00)
	{
		word32 a0_37;
		word32 s4_468;
		word32 a5_467;
		word32 a1_466;
		atomic_test_and_clear_bit(0x07, a3_113, a4_100, mstatus, out a0_37, out a1_466, out a3_113, out a4_100, out a5_467, out s4_468);
		if (a0_37 == 0x00)
			return;
		s1_34 = 0x01;
	}
	else
		s1_34 = 0x00;
	Eq_2 s1_104 = s1_34 + 424;
	Eq_2 a1_128 = 11;
	Eq_2 s2_108 = (word32) s1_104 + 1107388756;
	if (a0 != 0x00)
	{
		Eq_2 a4_60;
		Eq_2 a3_65;
		word32 a1_469;
		word32 a2_470;
		word32 a5_471;
		word32 a6_472;
		word32 a7_473;
		memcpy((word32) s1_104 + 1107389059, a0, 32, out a1_469, out a2_470, out a3_65, out a4_60, out a5_471, out a6_472, out a7_473);
		word32 a2_474;
		if (atomic_test_bit((word32) s1_104 + 1107388912, 0x09, out a2_474) != 0x00)
		{
l23053EB6:
			word32 a0_477;
			word32 a2_478;
			word32 a4_480;
			word32 s4_482;
			word32 a3_479;
			word32 a5_481;
			atomic_set_bit((word32) s1_104 + 1107388912, 0x08, a3_65, a4_60, mstatus, out a0_477, out a2_478, out a3_479, out a4_480, out a5_481, out s4_482);
			return;
		}
		word32 a2_475;
		if (atomic_test_bit((word32) s1_104 + 1107388912, 0x0F, out a2_475) != 0x00)
			goto l23053EB6;
		word32 a2_476;
		if (atomic_test_bit((word32) s1_104 + 1107388912, 0x08, out a2_476) == 0x00)
			return;
		Eq_2 a0_110;
		if ((word32) *((word32) *((word32) s1_104 + 1107388756) + 3) == 0x00)
		{
			word32 s0_491;
			ra = compute_and_send_master_dhcheck(ra, (word32) s1_104 + 0x009C, (word32) s1_104 + 1107388756, (word32) s1_104 + 1107388756, a0, dwArgB4, dwArgD0, dwArgD4, dwArgF8, dwArg0118, out s0_491, out s1_104, out a0_110, out a3_113, out a4_100, out s2_108);
		}
		else
		{
			word32 s0_490;
			ra = compute_and_check_and_send_slave_dhcheck(ra, (word32) s1_104 + 0x009C, (word32) s1_104 + 1107388756, (word32) s1_104 + 1107388756, a0, dwArg0108, out s0_490, out s1_104, out a0_110, out a3_113, out a4_100, out s2_108);
		}
		a1_128 = a0_110;
		if (a0_110 == 0x00)
			return;
	}
	word32 s1_484;
	word32 s0_483;
	word32 a4_486;
	word32 a3_485;
	word32 s5_488;
	word32 s3_487;
	word32 mstatus_489;
	smp_error(ra, s1_104, s2_108, a1_128, a3_113, a4_100, mstatus, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg54, dwArg5C, s3, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_483, out s1_484, out a3_485, out a4_486, out s3_487, out s5_488, out mstatus_489);
}

// 23053F0A: void bt_smp_recv(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_300971) a1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void bt_smp_recv(Eq_2 ra, Eq_2 a0, struct Eq_300971 * a1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_300980 * sp_169 = fp + ~0x1F;
	if ((word32) a1->w000C != 0x00)
	{
		Eq_2 a4_23;
		word32 a1_333;
		word32 a5_334;
		Eq_2 a0_21 = net_buf_simple_pull_mem((char *) a1 + 8, 0x01, out a1_333, out a4_23, out a5_334);
		word32 a2_335;
		Eq_2 a0_28 = atomic_test_bit((word32) a0 + 0x009C, 0x04, out a2_335);
		Eq_2 s0_159 = a0;
		uint32 a1_31 = (word32) *a0_21;
		if (a0_28 == 0x00)
		{
			Eq_2 a3_110;
			Eq_2 a4_127;
			Eq_2 a1_101;
			Eq_2 ra_113;
			Eq_2 s1_114;
			if (a1_31 <= 0x0D && g_a230BBD0C[a1_31] != 0x00)
			{
				word32 a0_41;
				Eq_2 a3_44;
				word32 a1_390;
				word32 a4_391;
				word32 a5_392;
				word32 s4_393;
				Eq_2 s1_47 = atomic_test_and_clear_bit(a1_31, a3, a4_23, mstatus, out a0_41, out a1_390, out a3_44, out a4_391, out a5_392, out s4_393);
				ui32 a2_51 = (word32) *a0_21;
				if (a0_41 == 0x00)
				{
					byte * s3_118;
					word32 a0_394;
					word32 a1_395;
					word32 a2_396;
					word32 a4_397;
					word32 a5_398;
					word32 a7_399;
					word32 s2_400;
					word32 s4_401;
					word32 s5_402;
					word32 s6_403;
					word32 s7_404;
					word32 s8_405;
					word32 s9_406;
					word32 s10_407;
					word32 s11_408;
					word32 t4_409;
					ra_113 = printf(ra, &g_t230BBC00, a3_44, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_114, out a0_394, out a1_395, out a2_396, out a3_110, out a4_397, out a5_398, out a7_399, out s2_400, out s3_118, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s10_407, out s11_408, out t4_409);
					a4_127 = (word32) *s3_118;
					a1_101.u0 = 0x08;
					if (a4_127 == 0x05)
						return;
				}
				else
				{
					<anonymous> * a5_55 = (word32) ((word32) s1_47 + (a2_51 << 0x03) + 4);
					if (a5_55 != (word32) a1->w000C)
					{
						word32 a0_417;
						word32 a1_418;
						word32 a2_419;
						word32 a5_420;
						word32 a7_421;
						word32 s2_422;
						word32 s3_423;
						word32 s4_424;
						word32 s5_425;
						word32 s6_426;
						word32 s7_427;
						word32 s8_428;
						word32 s9_429;
						word32 s10_430;
						word32 s11_431;
						word32 t4_432;
						ra_113 = printf(ra, &g_t230BBC20, a3_44, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_114, out a0_417, out a1_418, out a2_419, out a3_110, out a4_127, out a5_420, out a7_421, out s2_422, out s3_423, out s4_424, out s5_425, out s6_426, out s7_427, out s8_428, out s9_429, out s10_430, out s11_431, out t4_432);
						a1_101.u0 = 0x0A;
					}
					else
					{
						Eq_2 a0_67;
						word32 t1_271;
						word32 t5_272;
						word32 t6_273;
						word32 tp_274;
						a5_55();
						a1_101 = a0_67;
						if (a0_67 == 0x00)
							return;
					}
				}
			}
			else
			{
				word32 a0_374;
				word32 a1_375;
				word32 a2_376;
				word32 a5_377;
				word32 a7_378;
				word32 s2_379;
				word32 s3_380;
				word32 s4_381;
				word32 s5_382;
				word32 s6_383;
				word32 s7_384;
				word32 s8_385;
				word32 s9_386;
				word32 s10_387;
				word32 s11_388;
				word32 t4_389;
				ra_113 = printf(ra, &g_t230BBBE4, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_114, out a0_374, out a1_375, out a2_376, out a3_110, out a4_127, out a5_377, out a7_378, out s2_379, out s3_380, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388, out t4_389);
				a1_101.u0 = 0x07;
			}
			word32 s0_410;
			word32 s1_411;
			word32 a3_412;
			word32 a4_413;
			word32 s3_414;
			word32 s5_415;
			word32 mstatus_416;
			smp_error(ra_113, s1_114, s0_159, a1_101, a3_110, a4_127, mstatus, sp_169->t0004, sp_169->t0008, sp_169->t0010, sp_169->t0014, sp_169->t0018, sp_169->t0020, sp_169->t0024, sp_169->t0028, sp_169->t0034, sp_169->t0038, sp_169->t0048, sp_169->t0054, sp_169->t005C, sp_169->t0064, sp_169->t0078, sp_169->t0084, sp_169->t0088, sp_169->t0098, sp_169->t00A8, sp_169->t00B8, sp_169->t00C8, sp_169->t00D8, sp_169->t00E8, sp_169->t00F8, sp_169->t0108, sp_169->t0118, sp_169->t0128, sp_169->t0138, out s0_410, out s1_411, out a3_412, out a4_413, out s3_414, out s5_415, out mstatus_416);
		}
		else
		{
			word32 s1_355;
			word32 a0_356;
			word32 a1_357;
			word32 a2_358;
			word32 a3_359;
			word32 a4_360;
			word32 a5_361;
			word32 a7_362;
			word32 s2_363;
			word32 s3_364;
			word32 s4_365;
			word32 s5_366;
			word32 s6_367;
			word32 s7_368;
			word32 s8_369;
			word32 s9_370;
			word32 s10_371;
			word32 s11_372;
			word32 t4_373;
			printf(ra, &g_t230BBBB0, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_355, out a0_356, out a1_357, out a2_358, out a3_359, out a4_360, out a5_361, out a7_362, out s2_363, out s3_364, out s4_365, out s5_366, out s6_367, out s7_368, out s8_369, out s9_370, out s10_371, out s11_372, out t4_373);
		}
	}
	else
	{
		word32 s3_345;
		word32 s4_346;
		word32 s5_347;
		word32 a5_342;
		word32 a7_343;
		word32 s2_344;
		word32 a2_339;
		word32 a3_340;
		word32 a4_341;
		word32 s1_336;
		word32 a0_337;
		word32 a1_338;
		word32 s6_348;
		word32 s7_349;
		word32 s8_350;
		word32 s9_351;
		word32 s10_352;
		word32 s11_353;
		word32 t4_354;
		printf(ra, &g_t230BBB90, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_336, out a0_337, out a1_338, out a2_339, out a3_340, out a4_341, out a5_342, out a7_343, out s2_344, out s3_345, out s4_346, out s5_347, out s6_348, out s7_349, out s8_350, out s9_351, out s10_352, out s11_353, out t4_354);
	}
}

// 23053FEE: void bt_smp_encrypt_change(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118)
void bt_smp_encrypt_change(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118)
{
	struct Eq_301411 * s2_19 = *a0;
	Eq_2 a4_29;
	word32 a0_553;
	word32 a2_555;
	word32 a1_554;
	word32 a5_556;
	word32 s8_558;
	word32 s4_557;
	Eq_2 a3_106;
	Eq_2 s1_31 = atomic_and(a0, ~0x02, a3, a4, mstatus, out a0_553, out a1_554, out a2_555, out a3_106, out a4_29, out a5_556, out s4_557, out s8_558);
	if (a1 != 0x00 || (word32) s2_19->b000B == 0x00)
		return;
	word32 a2_559;
	if (atomic_test_bit(s1_31, 0x03, out a2_559) == 0x00)
	{
		word32 a4_561;
		word32 a5_562;
		word32 s5_563;
		smp_reset(a0, s1_31, a0, a3_106, a4_29, mstatus, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_561, out a5_562, out s5_563);
		return;
	}
	word32 a2_560;
	if (atomic_test_bit(s1_31, 0x05, out a2_560) != 0x00)
	{
		if (((word32) *((word32) a0 + 384) & 0x08) != 0x00 && ((word32) (*((word32) a0 + 0x0181)) & 0x08) != 0x00)
		{
			word32 a0_564;
			word32 a5_567;
			word32 s4_568;
			word32 a4_566;
			word32 a2_565;
			atomic_set_bit(a0, 0x10, a3_106, a4_29, mstatus, out a0_564, out a2_565, out a3_106, out a4_566, out a5_567, out s4_568);
		}
		*((word32) a0 + 384) = (word16) ((word32) *((word32) a0 + 384) & ~0x00FFF808);
	}
	ui32 a5_71 = (word32) *((word32) a0 + 0x0181);
	word32 a1_72 = 0x06;
	Eq_2 a4_105 = a5_71 & 1;
	if ((a5_71 & 1) == 0x00)
	{
		a4_105 = a5_71 & 2;
		a1_72 = 0x08;
		if ((a5_71 & 2) == 0x00)
		{
			if ((a5_71 & 0x04) == 0x00)
			{
l23054088:
				Eq_2 a3_110;
				Eq_2 a4_111;
				word32 a5_575;
				word32 s4_576;
				word32 a2_574;
				word32 a0_573;
				Eq_2 s1_113 = atomic_set_bit(a0, 0x02, a3_106, a4_105, mstatus, out a0_573, out a2_574, out a3_110, out a4_111, out a5_575, out s4_576);
				Eq_2 a5_123 = (word32) s2_19->b0003;
				if (a5_123 == 0x00)
				{
					a5_123 = (word32) *((word32) a0 + 0x0181);
					if (a5_123 != 0x00)
						return;
				}
				word32 a0_154;
				Eq_2 s0_158;
				Eq_2 a3_165;
				Eq_2 a4_166;
				ptr32 mstatus_169;
				Eq_2 s1_171;
				Eq_2 ra_170 = bt_smp_distribute_keys(ra, s1_113, a0, a3_110, a4_111, a5_123, a1, s5, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0_158, out s1_171, out a0_154, out a3_165, out a4_166, out mstatus_169);
				if (a0_154 != 0x00 || (word32) (*((word32) s0_158 + 384)) != 0x00)
					return;
				word32 a4_577;
				word32 a5_578;
				word32 s5_579;
				smp_pairing_complete(ra_170, s0_158, s1_171, s0_158, 0x00, a3_165, a4_166, mstatus_169, dwArg18, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a4_577, out a5_578, out s5_579);
				return;
			}
			a1_72 = 0x0A;
		}
	}
	word32 a0_569;
	word32 s4_572;
	word32 a2_570;
	word32 a5_571;
	atomic_set_bit(a0, a1_72, a3_106, a4_105, mstatus, out a0_569, out a2_570, out a3_106, out a4_105, out a5_571, out s4_572);
	goto l23054088;
}

// 230540CC: Register Eq_2 smp_send_pairing_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_pairing_confirm
//      bt_smp_auth_passkey_entry
Eq_2 smp_send_pairing_confirm(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & mstatusOut)
{
	ptr32 a0_154;
	Eq_2 a5_13 = (word32) *((word32) a0 + 0x00A0);
	Eq_2 a4_14 = 0x02;
	if (a5_13 <= 0x02)
	{
		if (a5_13 != 0x00)
		{
			a3 = (word32) *((word32) a0 + 372);
			goto l23054110;
		}
	}
	else
	{
		a4_14.u0 = 0x03;
		if (a5_13 != 0x03)
			goto l230540EC;
	}
l23054110:
	word32 a2_380;
	word32 s2_382;
	word32 a5_381;
	word32 s5_384;
	word32 s3_383;
	word32 a0_46;
	ra = smp_create_pdu.isra.7(ra, a0, a3, a4_14, a5_13, s5, mstatus, dwArg28, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s1, out a0_46, out a2_380, out a3, out a4_14, out a5_381, out s2_382, out s3_383, out s5_384, out mstatus);
	a0_154 = 0x08;
	if (a0_46 == 0x00)
		goto l230540EE;
	word32 a1_385;
	word32 a5_386;
	Eq_2 a0_78 = net_buf_simple_add(a0_46 + 8, 0x10, a4_14, out a1_385, out a5_386);
	Eq_2 a0_83 = g_t4200F49C;
	Eq_2 a1_88;
	Eq_2 a4_91;
	Eq_2 a5_92;
	Eq_2 s2_97;
	Eq_2 s1_96 = smp_f4(ra, a0_83, (word32) s1 + 0x00EF, (word32) s1 + 191, a0_78, out a1_88, out a4_91, out a5_92, out s2_97);
	if (a0_83 == 0x00)
	{
		Eq_2 a3_116;
		Eq_2 a4_117;
		Eq_2 s0_123;
		word32 s1_387;
		word32 a5_388;
		word32 s2_389;
		word32 s3_390;
		word32 s5_391;
		ra = smp_send.isra.9(ra, s1_96, s1_96, s2_97, 0x00, a5_92, mstatus, s0, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_123, out s1_387, out a3_116, out a4_117, out a5_388, out s2_389, out s3_390, out s5_391, out mstatus);
		word32 a0_392;
		word32 a1_393;
		word32 a2_394;
		word32 a5_395;
		word32 s4_396;
		word32 s8_397;
		s1 = atomic_and(s0_123, ~0x01, a3_116, a4_117, mstatus, out a0_392, out a1_393, out a2_394, out a3, out a4_14, out a5_395, out s4_396, out s8_397);
		a0_154 = 0x00;
l230540EE:
		0x00 = (int8) dwArg38;
		s1Out = s1;
		a0Out = a0_154;
		a3Out = a3;
		a4Out = a4_14;
		mstatusOut = mstatus;
		return ra;
	}
	word32 s0_398;
	word32 a0_399;
	word32 a1_400;
	word32 a2_401;
	word32 a5_402;
	word32 s2_403;
	word32 s3_404;
	word32 s4_405;
	word32 s5_406;
	word32 s6_407;
	word32 s8_408;
	ra = net_buf_unref(ra, s1_96, s2_97, a1_88, a4_91, mstatus, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_398, out s1, out a0_399, out a1_400, out a2_401, out a3, out a4_14, out a5_402, out s2_403, out s3_404, out s4_405, out s5_406, out s6_407, out s8_408, out mstatus);
l230540EC:
	a0_154 = 0x08;
	goto l230540EE;
}

