pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23054164: void smp_ident_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118)
void smp_ident_sent(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0118)
{
	if ((word32) *((word32) a0 + 2) != 0x01)
		return;
	smp_check_complete.part.16(ra, s0, s1, a0, 0x01, a3, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, dwArg98, dwArgA8, dwArgD8, dwArg0118);
}

// 23054176: Register Eq_2 smp_c1(Register Eq_2 ra, Register ptr32 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a6, Register out (ptr32 Eq_301819) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      legacy_pairing_confirm
//      smp_pairing_random
Eq_2 smp_c1(Eq_2 ra, ptr32 a0, ptr32 a1, Eq_2 a2, Eq_2 a6, struct Eq_301819 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 a3_41;
	word32 a1_270;
	word32 a2_271;
	word32 a4_272;
	word32 a5_273;
	word32 a6_274;
	word32 a7_275;
	memcpy(fp->aFFFFFFC0 + 2, a2, 0x07, out a1_270, out a2_271, out a3_41, out a4_272, out a5_273, out a6_274, out a7_275);
	word32 a1_276;
	word32 a2_277;
	word32 a3_278;
	word32 a4_279;
	word32 a5_280;
	word32 a6_281;
	word32 a7_282;
	memcpy(fp->aFFFFFFC0 + 9, a3_41, 0x07, out a1_276, out a2_277, out a3_278, out a4_279, out a5_280, out a6_281, out a7_282);
	int32 a3_66;
	for (a3_66 = 0x00; a3_66 != 0x10; ++a3_66)
		*((word32) a6 + a3_66) = (byte) ((word32) (a1 + a3_66) ^ (word32) (fp->aFFFFFFC0)[a3_66]);
	ptr32 s1_98;
	word32 s2_99;
	ptr32 s5_111;
	ptr32 s4_100;
	ptr32 s3_110;
	struct Eq_301819 * s0_185;
	ptr32 a4_180;
	ptr32 a5_181;
	ptr32 a0_176;
	ptr32 a1_177;
	Eq_2 ra_109 = bt_encrypt_le(ra, a0, out s0_185, out s1_98, out a0_176, out a1_177, out a4_180, out a5_181, out s2_99, out s3_110, out s4_100, out s5_111);
	if (a0_176 == 0x00)
	{
		word32 a1_283;
		word32 a2_284;
		word32 a3_285;
		word32 a4_286;
		word32 a5_287;
		word32 a6_288;
		word32 a7_289;
		memcpy(fp->aFFFFFFC0 + 16, s3_110 + 1, 0x06, out a1_283, out a2_284, out a3_285, out a4_286, out a5_287, out a6_288, out a7_289);
		word32 a1_290;
		word32 a2_291;
		word32 a3_292;
		word32 a4_293;
		word32 a5_294;
		word32 a6_295;
		word32 a7_296;
		memcpy(fp->aFFFFFFC0 + 22, s2_99 + 1, 0x06, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a6_295, out a7_296);
		word32 t1_297;
		word32 a0_298;
		word32 a1_299;
		word32 a2_300;
		word32 a3_301;
		word32 a4_302;
		word32 a5_303;
		Eq_2 ra_154 = memset(ra_109, fp->aFFFFFFC0 + 28, 0x00, 0x04, out t1_297, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303);
		byte * a5_157 = fp->aFFFFFFC0 + 16;
		struct Eq_301819 * a4_159 = s0_185;
		while (s0_185 + 16 != a4_159)
		{
			++a4_159;
			a4_159[0x0FFF] = (struct Eq_301819) (byte) ((word32) a4_159->bFFFFFFFF ^ (word32) (*a5_157));
			++a5_157;
		}
		word32 s1_304;
		word32 s2_305;
		bt_encrypt_le(ra_154, s1_98, out s0_185, out s1_304, out a0_176, out a1_177, out a4_180, out a5_181, out s2_305, out s3_110, out s4_100, out s5_111);
	}
	s0Out = s0_185;
	s1Out = dwLoc4C;
	a0Out = a0_176;
	a1Out = a1_177;
	a4Out = a4_180;
	a5Out = a5_181;
	s3Out = s3_110;
	s4Out = s4_100;
	s5Out = s5_111;
	return dwLoc08;
}

// 23054248: Register Eq_2 legacy_send_pairing_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      legacy_pairing_confirm
//      smp_pairing_rsp
//      ble_auth_pairing_confirm
Eq_2 legacy_send_pairing_confirm(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	ptr32 a0_131;
	word32 a0_21;
	word32 a2_275;
	word32 s2_276;
	word32 s3_277;
	word32 s5_278;
	Eq_2 a4_125;
	ptr32 a3_124;
	ptr32 a5_126;
	ptr32 mstatus_141;
	Eq_2 s1_127;
	Eq_2 ra_142 = smp_create_pdu.isra.7(ra, a0, a3, a4, a5, s5, mstatus, dwArg28, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s1_127, out a0_21, out a2_275, out a3_124, out a4_125, out a5_126, out s2_276, out s3_277, out s5_278, out mstatus_141);
	if (a0_21 != 0x00)
	{
		word32 a0_62;
		Eq_2 a1_63;
		Eq_2 a4_66;
		Eq_2 a5_67;
		Eq_2 s0_72;
		Eq_2 s1_73;
		word32 a1_279;
		word32 a5_280;
		word32 s3_281;
		word32 s4_282;
		word32 s5_283;
		Eq_2 ra_71 = smp_c1(ra_142, (word32) a0 + 223, (word32) a0 + 191, (word32) a0 + 161, net_buf_simple_add(a0_21 + 0x08, 0x10, a4_125, out a1_279, out a5_280), out s0_72, out s1_73, out a0_62, out a1_63, out a4_66, out a5_67, out s3_281, out s4_282, out s5_283);
		if (a0_62 == 0x00)
		{
			Eq_2 a3_93;
			Eq_2 a4_94;
			Eq_2 s0_100;
			word32 s1_294;
			word32 a5_295;
			word32 s2_296;
			word32 s3_297;
			word32 s5_298;
			ra_142 = smp_send.isra.9(ra_71, s1_73, s0_72, s1_73, 0x00, a5_67, mstatus_141, s0, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_100, out s1_294, out a3_93, out a4_94, out a5_295, out s2_296, out s3_297, out s5_298, out mstatus_141);
			word32 a0_299;
			word32 a1_300;
			word32 a2_301;
			word32 s4_302;
			word32 s8_303;
			s1_127 = atomic_and(s0_100, ~0x01, a3_93, a4_94, mstatus_141, out a0_299, out a1_300, out a2_301, out a3_124, out a4_125, out a5_126, out s4_302, out s8_303);
			a0_131 = 0x00;
l230542AA:
			0x00 = (int8) dwArg38;
			s1Out = s1_127;
			a0Out = a0_131;
			a3Out = a3_124;
			a4Out = a4_125;
			a5Out = a5_126;
			mstatusOut = mstatus_141;
			return ra_142;
		}
		word32 s0_284;
		word32 a0_285;
		word32 a1_286;
		word32 a2_287;
		word32 s2_288;
		word32 s3_289;
		word32 s4_290;
		word32 s5_291;
		word32 s6_292;
		word32 s8_293;
		ra_142 = net_buf_unref(ra_71, s1_73, s1_73, a1_63, a4_66, mstatus_141, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_284, out s1_127, out a0_285, out a1_286, out a2_287, out a3_124, out a4_125, out a5_126, out s2_288, out s3_289, out s4_290, out s5_291, out s6_292, out s8_293, out mstatus_141);
	}
	a0_131 = 0x08;
	goto l230542AA;
}

// 230542B6: Register Eq_2 legacy_pairing_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_302197) a5, Register Eq_2 s2, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_pairing_confirm
//      bt_smp_auth_passkey_entry
Eq_2 legacy_pairing_confirm(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, struct Eq_302197 * a5, Eq_2 s2, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a0_11 = a5->t0000;
	word32 a1_13 = 0x03;
	if ((word32) a5->b0003 != 0x00)
	{
		word32 a2_224;
		if (atomic_test_bit((word32) a0_11 + 0x009C, 0x09, out a2_224) != 0x00)
		{
			ptr32 a3_29;
			ptr32 a4_30;
			ptr32 a5_31;
			word32 a0_225;
			word32 a2_226;
			word32 s4_227;
			s1Out = atomic_set_bit(a0_11, 0x00, a3, a4, mstatus, out a0_225, out a2_226, out a3_29, out a4_30, out a5_31, out s4_227);
			a0Out = 0x00;
			a3Out = a3_29;
			a4Out = a4_30;
			a5Out = a5_31;
			mstatusOut = mstatus;
			return ra;
		}
		a1_13 = 0x04;
	}
	Eq_2 a3_51;
	Eq_2 a4_52;
	Eq_2 a5_53;
	word32 a0_221;
	word32 a2_222;
	word32 s4_223;
	atomic_set_bit(a0_11, a1_13, a3, a4, mstatus, out a0_221, out a2_222, out a3_51, out a4_52, out a5_53, out s4_223);
	ptr32 a0_70;
	ptr32 a3_73;
	ptr32 a4_74;
	ptr32 a5_75;
	ptr32 mstatus_78;
	Eq_2 s1_80;
	Eq_2 ra_79 = legacy_send_pairing_confirm(ra, s0, a0_11, a3_51, a4_52, a5_53, s2, s5, mstatus, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_80, out a0_70, out a3_73, out a4_74, out a5_75, out mstatus_78);
	s1Out = s1_80;
	a0Out = a0_70;
	a3Out = a3_73;
	a4Out = a4_74;
	a5Out = a5_75;
	mstatusOut = mstatus_78;
	return ra_79;
}

// 23054304: void smp_pairing_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_302310) a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void smp_pairing_confirm(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_302310 * a1, Eq_2 a3, Eq_2 a4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	Eq_2 s2_13 = a1->t0008;
	word32 s8_368;
	word32 s4_367;
	word32 a5_366;
	word32 a4_365;
	word32 a3_364;
	word32 a2_363;
	word32 a1_362;
	word32 a0_361;
	Eq_2 s1_28 = atomic_and(a0, -0x0401, a3, a4, mstatus, out a0_361, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out s4_367, out s8_368);
	Eq_2 a4_35;
	struct Eq_302372 * a5_36;
	Eq_2 a3_40;
	word32 a7_372;
	word32 a6_371;
	word32 a2_370;
	word32 a1_369;
	memcpy((word32) a0 + 0x00AF, s2_13, 0x10, out a1_369, out a2_370, out a3_40, out a4_35, out a5_36, out a6_371, out a7_372);
	Eq_2 s0_48 = a5_36->t0000;
	struct Eq_302197 * a5_49 = (word32) a5_36->b0003;
	if (a5_49 == null)
	{
		Eq_2 a3_178;
		Eq_2 a4_179;
		Eq_2 a5_180;
		word32 a0_374;
		word32 a2_375;
		word32 s4_376;
		atomic_set_bit(s0_48, 0x04, a3_40, a4_35, mstatus, out a0_374, out a2_375, out a3_178, out a4_179, out a5_180, out s4_376);
		0x00 = (int8) dwArg38;
		smp_send_pairing_random(ra, s0, s0_48, a3_178, a4_179, a5_180, s5, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138);
		return;
	}
	word32 a2_373;
	if (atomic_test_bit(s1_28, 0x05, out a2_373) == 0x00)
	{
		0x00 = (int8) dwArg38;
		word32 s1_377;
		word32 a0_378;
		word32 a3_379;
		word32 a4_380;
		word32 a5_381;
		word32 mstatus_382;
		legacy_pairing_confirm(ra, s0, a3_40, a4_35, a5_49, s2_13, s5, mstatus, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_377, out a0_378, out a3_379, out a4_380, out a5_381, out mstatus_382);
		return;
	}
	word32 a5_55 = (word32) *((word32) s0_48 + 0x00A0);
	Eq_2 a4_56 = 0x01;
	if (a5_55 != 0x01)
	{
		a4_56.u0 = 0x02;
		if (a5_55 == 0x02)
		{
l2305437A:
			Eq_2 a3_92;
			word32 a0_384;
			word32 a2_385;
			word32 a4_386;
			word32 a5_387;
			word32 s4_388;
			atomic_set_bit(s0_48, 0x04, a3_40, a4_56, mstatus, out a0_384, out a2_385, out a3_92, out a4_386, out a5_387, out s4_388);
			0x00 = (int8) dwArg38;
			word32 s1_389;
			word32 a0_390;
			word32 a3_391;
			word32 a4_392;
			word32 mstatus_393;
			smp_send_pairing_confirm(ra, s0, s0_48, a3_92, s2_13, s5, mstatus, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_389, out a0_390, out a3_391, out a4_392, out mstatus_393);
			return;
		}
	}
	else
	{
		word32 a2_383;
		if (atomic_test_bit(s1_28, 0x09, out a2_383) == 0x00)
			goto l2305437A;
		word32 a0_394;
		word32 a2_395;
		word32 a3_396;
		word32 a4_397;
		word32 a5_398;
		word32 s4_399;
		atomic_set_bit(s0_48, 0x00, a3_40, 0x01, mstatus, out a0_394, out a2_395, out a3_396, out a4_397, out a5_398, out s4_399);
	}
	0x00 = (int8) dwArg38;
}

