pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230543B8: void smp_pairing_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack word32 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168)
void smp_pairing_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, word32 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0168)
{
	if (((word32) *((word32) s1 + 3) + ~0x06 & 0x00FF) > 0x09)
		return;
	Eq_2 s1_105;
	Eq_2 s3_183 = *a0;
	*((word32) a0 + 384) = (byte) ((word32) *((word32) a0 + 384) & (word32) (*((word32) s1 + 4)));
	*((word32) a0 + 0x0181) = (byte) ((word32) *((word32) a0 + 0x0181) & (word32) (*((word32) s1 + 5)));
	((word32) a0 + 0x00A8)->u0 = 0x02;
	word32 a7_1076;
	word32 a6_1075;
	word32 a5_1074;
	word32 a2_1073;
	word32 a1_1072;
	Eq_2 a4_103;
	Eq_2 a3_102;
	memcpy((word32) a0 + 0x00A9, s1, 0x06, out a1_1072, out a2_1073, out a3_102, out a4_103, out a5_1074, out a6_1075, out a7_1076);
	s1_105 = s1;
	if (((word32) *((word32) s1 + 2) & 0x08) != 0x00)
	{
		s1_105 = s1;
		if (((word32) *((word32) a0 + 0x00A4) & 0x08) != 0x00)
		{
			word32 a0_1077;
			word32 a2_1078;
			word32 a5_1079;
			s1_105 = atomic_set_bit(a0, 0x05, a3_102, a4_103, mstatus, out a0_1077, out a2_1078, out a3_102, out a4_103, out a5_1079, out s4);
		}
	}
	if (((word32) *((word32) s1_105 + 2) & 32) != 0x00 && ((word32) (*((word32) a0 + 0x00A4)) & 32) != 0x00)
	{
		word32 a2_1081;
		word32 a5_1082;
		word32 a0_1080;
		s1_105 = atomic_set_bit(a0, 0x13, a3_102, a4_103, mstatus, out a0_1080, out a2_1081, out a3_102, out a4_103, out a5_1082, out s4);
	}
	if (((word32) *((word32) s1_105 + 2) & 0x01) != 0x00 && ((word32) (*((word32) a0 + 0x00A4)) & 0x01) != 0x00)
	{
		word32 a0_1084;
		word32 a5_1086;
		word32 a2_1085;
		s1_105 = atomic_set_bit(a0, 0x0C, a3_102, a4_103, mstatus, out a0_1084, out a2_1085, out a3_102, out a4_103, out a5_1086, out s4);
	}
	Eq_2 s2_128;
	*((word32) a0 + 0x00A0) = (byte) get_pair_method(a0, (word32) *s1_105, a3_102, a4_103, dwArg18, out s2_128);
	word32 a4_1083;
	Eq_2 a3_145;
	if (update_keys_check(ra, a0, s2_128, s3_183, s4, mstatus, dwLoc20, dwLoc1C, s2, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a3_145, out a4_1083) == 0x00)
		return;
	word32 a2_1087;
	Eq_2 a0_154 = atomic_test_bit((word32) a0 + 0x009C, 0x05, out a2_1087);
	Eq_2 a4_157 = (word32) *((word32) a0 + 0x00A0);
	if (a0_154 != 0x00)
	{
		a3_145 = (word32) *((word32) s3_183 + 0x0A);
		if (a3_145 == 0x04)
		{
			if (a4_157 == 0x00)
				return;
			uint32 a3_161 = (word32) *((word32) a0 + 0x00A5);
			uint32 a5_162 = (word32) *((word32) a0 + 0x00AC);
			if (a3_161 < a5_162)
				a5_162 = a3_161;
			a3_145.u0 = 0x10;
			if ((a5_162 & 0x00FF) != 0x10)
				return;
		}
		*((word32) a0 + 384) = (word16) ((word32) *((word32) a0 + 384) & 0x0604);
		if (a4_157 == 0x00)
		{
			word32 a2_1093;
			if (atomic_test_bit((word32) a0 + 0x009C, 0x0E, out a2_1093) != 0x00)
			{
				s3_183.u0 = 0x42026000;
				Eq_2 a5_184 = g_t42026610;
				if (a5_184 != 0x00 && *((word32) a5_184 + 20) != 0x00)
				{
l230544B6:
					word32 a0_404;
					word32 s4_411;
					word32 a3_1090;
					word32 a4_1091;
					word32 a2_1089;
					word32 a5_1092;
					Eq_2 s1_410 = atomic_set_bit(a0, 0x09, a3_145, a4_157, mstatus, out a0_404, out a2_1089, out a3_1090, out a4_1091, out a5_1092, out s4_411);
					<anonymous> * a5_418 = *((word32) g_t42026610 + 20);
					word32 a3_437;
					word32 a7_438;
					word32 t0_439;
					word32 t1_440;
					word32 t4_441;
					word32 t5_442;
					word32 t6_443;
					word32 tp_445;
					word32 s10_447;
					word32 s11_448;
					word32 s6_449;
					word32 s7_450;
					word32 s9_451;
					word32 gp_452;
					word32 t2_453;
					a5_418();
					return;
				}
			}
		}
		if (g_t4200F49C != 0x00)
		{
			Eq_2 a3_202;
			Eq_2 a4_203;
			word32 a5_1096;
			word32 s4_1097;
			word32 a0_1094;
			word32 a2_1095;
			atomic_set_bit(a0, 0x0C, a3_145, a4_157, mstatus, out a0_1094, out a2_1095, out a3_202, out a4_203, out a5_1096, out s4_1097);
			Eq_2 a3_215;
			Eq_2 a4_216;
			Eq_2 a5_217;
			word32 a0_1098;
			word32 a2_1100;
			word32 s4_1101;
			word32 a1_1099;
			word32 s8_1102;
			Eq_2 s1_218 = atomic_and(a0, ~0x00FFF800, a3_202, a4_203, mstatus, out a0_1098, out a1_1099, out a2_1100, out a3_215, out a4_216, out a5_217, out s4_1101, out s8_1102);
			word32 s0_1109;
			word32 s1_1110;
			word32 a0_1111;
			word32 a3_1112;
			word32 a4_1113;
			word32 s2_1114;
			word32 s3_1115;
			word32 mstatus_1117;
			word32 s5_1116;
			sc_send_public_key(ra, s1_218, a0, a3_215, a4_216, a5_217, (word32) a0 + 0x009C, s3_183, s5, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_1109, out s1_1110, out a0_1111, out a3_1112, out a4_1113, out s2_1114, out s3_1115, out s5_1116, out mstatus_1117);
		}
		else
		{
			word32 a4_1106;
			word32 a5_1107;
			word32 a2_1104;
			word32 a3_1105;
			word32 a0_1103;
			word32 s4_1108;
			atomic_set_bit(a0, 0x06, a3_145, a4_157, mstatus, out a0_1103, out a2_1104, out a3_1105, out a4_1106, out a5_1107, out s4_1108);
		}
	}
	else
	{
		if (a4_157 == 0x00)
		{
			word32 a2_1088;
			if (atomic_test_bit((word32) a0 + 0x009C, 0x0E, out a2_1088) != 0x00)
			{
				Eq_2 a5_294 = g_t42026610;
				if (a5_294 != 0x00 && *((word32) a5_294 + 20) != 0x00)
					goto l230544B6;
			}
		}
		word32 a0_304;
		Eq_2 a3_307;
		Eq_2 a4_308;
		ptr32 mstatus_312;
		Eq_2 s0_314;
		Eq_2 s2_318;
		Eq_2 s5_321;
		Eq_2 ra_313 = legacy_request_tk(ra, a4_157, (word32) a0 + 0x009C, mstatus, s2, dwLoc08, dwArg24, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgA4, out s0_314, out a0_304, out a3_307, out a4_308, out s2_318, out s5_321, out mstatus_312);
		if (a0_304 != 0x00)
			return;
		word32 a2_1118;
		if (atomic_test_bit(s2_318, 0x09, out a2_1118) != 0x00)
		{
			word32 a2_1120;
			word32 a3_1121;
			word32 a4_1122;
			word32 a0_1119;
			word32 s4_1124;
			word32 a5_1123;
			atomic_set_bit(s0_314, 0x00, a3_307, a4_308, mstatus_312, out a0_1119, out a2_1120, out a3_1121, out a4_1122, out a5_1123, out s4_1124);
		}
		else
		{
			Eq_2 a3_353;
			Eq_2 a4_354;
			Eq_2 a5_355;
			word32 a0_1125;
			word32 s4_1127;
			word32 a2_1126;
			atomic_set_bit(s0_314, 0x03, a3_307, a4_308, mstatus_312, out a0_1125, out a2_1126, out a3_353, out a4_354, out a5_355, out s4_1127);
			word32 a3_1130;
			word32 a0_1129;
			word32 s1_1128;
			word32 mstatus_1133;
			word32 a4_1131;
			word32 a5_1132;
			legacy_send_pairing_confirm(ra_313, s0_314, s0_314, a3_353, a4_354, a5_355, s2_318, s5_321, mstatus_312, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg78, dwArg7C, dwArg84, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0168, out s1_1128, out a0_1129, out a3_1130, out a4_1131, out a5_1132, out mstatus_1133);
		}
	}
}

