pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23054590: void smp_ident_addr_info(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_303004) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void smp_ident_addr_info(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, struct Eq_303004 * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 s2_17 = a1->t0008;
	Eq_2 s1_178 = a0;
	if ((word32) *s2_17 == 0x00 || ((word32) (*((word32) s2_17 + 6)) & 0x00C0) == 0x00C0)
	{
		word32 a2_819;
		if (atomic_test_bit((word32) a0 + 0x009C, 0x0C, out a2_819) != 0x00)
		{
			Eq_2 a0_42;
			Eq_2 s4_52;
			ptr32 mstatus_57;
			word32 s5_861;
			word32 s1_859;
			word32 s3_860;
			Eq_2 s2_147;
			Eq_2 a3_129;
			Eq_2 ra_144 = bt_keys_get_type(ra, s0, 0x02, (word32) *((word32) s0 + 8), (word32) s0 + 112, s2_17, mstatus, dwLoc20, s4, s2, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1_859, out a0_42, out a3_129, out s2_147, out s3_860, out s4_52, out s5_861, out mstatus_57);
			Eq_2 s3_148 = a0_42;
			if (a0_42 == 0x00)
			{
				Eq_2 a3_303;
				word32 s11_880;
				word32 t4_881;
				word32 s9_878;
				word32 s10_879;
				word32 s7_876;
				word32 s8_877;
				word32 s5_874;
				word32 s6_875;
				word32 s3_872;
				word32 s4_873;
				word32 a7_870;
				word32 s2_871;
				word32 a4_868;
				word32 a5_869;
				word32 a2_866;
				word32 a3_867;
				word32 a0_864;
				word32 a1_865;
				word32 s0_862;
				word32 s1_863;
				printf(bt_addr_le_str_real(ra_144, s4_52, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_862, out a3_303), &g_t230BBE60, a3_303, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_863, out a0_864, out a1_865, out a2_866, out a3_867, out a4_868, out a5_869, out a7_870, out s2_871, out s3_872, out s4_873, out s5_874, out s6_875, out s7_876, out s8_877, out s9_878, out s10_879, out s11_880, out t4_881);
				return;
			}
			struct Eq_303216 * a1_72 = (word32) s0 + 0x0077;
			if ((word32) *((word32) s0 + 3) == 0x00)
				a1_72 = (word32) s0 + 0x007E;
			if ((word32) a1_72->b0000 == 0x01 && ((word32) a1_72->b0006 & 0x00C0) == 64)
			{
				word32 a6_890;
				word32 a7_891;
				word32 a4_888;
				word32 a5_889;
				word32 a1_886;
				word32 a2_887;
				memcpy((word32) a0_42 + 54, &a1_72->b0000 + 1, 0x06, out a1_886, out a2_887, out a3_129, out a4_888, out a5_889, out a6_890, out a7_891);
				if ((word32) *((word32) s0 + 112) != 0x00 && ((word32) (*((word32) s0 + 118)) & 0x00C0) != 0x00C0)
				{
					word32 a6_897;
					word32 a7_898;
					word32 a4_895;
					word32 a5_896;
					word32 a2_893;
					word32 a3_894;
					word32 a1_892;
					memcpy((word32) a0_42 + 1, s2_147, 0x07, out a1_892, out a2_893, out a3_894, out a4_895, out a5_896, out a6_897, out a7_898);
					word32 a7_904;
					word32 a5_902;
					word32 a6_903;
					word32 a1_899;
					word32 a2_900;
					word32 a4_901;
					memcpy(s4_52, s2_147, 0x07, out a1_899, out a2_900, out a3_129, out a4_901, out a5_902, out a6_903, out a7_904);
					ra_144 = bt_conn_identity_resolved(ra_144, s0, out s0, out s2_147, out s3_148);
				}
			}
			ra = bt_id_add(ra_144, s0, a3_129, s2_147, s3_148, mstatus_57, dwLoc20, s4, s2, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, dwArg58, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0, out s1_178, out a3, out s3, out s5, out mstatus);
		}
		ui32 a5_195 = (word32) *((word32) s1_178 + 0x0181);
		*((word32) s1_178 + 0x0181) = (byte) (a5_195 & -3);
		Eq_2 a4_196 = a5_195 & -3;
		if ((a5_195 & 0x04) != 0x00)
		{
			word32 a5_884;
			word32 s4_885;
			word32 a0_882;
			word32 a2_883;
			s1_178 = atomic_set_bit(s0, 0x0A, a3, a5_195 & -3, mstatus, out a0_882, out a2_883, out a3, out a4_196, out a5_884, out s4_885);
		}
		if ((word32) *((word32) s0 + 3) == 0x00)
		{
			Eq_2 a5_220 = (word32) *((word32) s1_178 + 0x0181);
			if (a5_220 == 0x00)
			{
				word32 a0_236;
				ra = bt_smp_distribute_keys(ra, s1_178, s1_178, a3, a4_196, a5_220, s3, s5, mstatus, dwLoc20, s4, s2, dwLoc10, dwLoc0C, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, out s0, out s1_178, out a0_236, out a3, out a4_196, out mstatus);
				if (a0_236 != 0x00)
					return;
			}
		}
		if ((word32) *((word32) s1_178 + 384) == 0x00)
		{
			word32 s5_907;
			word32 a4_905;
			word32 a5_906;
			smp_pairing_complete(ra, s0, s1_178, s1_178, 0x00, a3, a4_196, mstatus, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg78, dwArg88, dwArgB8, dwArgF8, out a4_905, out a5_906, out s5_907);
		}
	}
	else
	{
		Eq_2 a3_355;
		word32 s0_361;
		Eq_2 a3_406;
		word32 s10_856;
		word32 s11_857;
		word32 t4_858;
		word32 s7_853;
		word32 s8_854;
		word32 s9_855;
		word32 s5_851;
		word32 s6_852;
		word32 s4_850;
		word32 s1_820;
		word32 a0_821;
		word32 a1_822;
		word32 a3_824;
		word32 a2_823;
		word32 a5_826;
		word32 a4_825;
		word32 s2_828;
		word32 a7_827;
		word32 s4_830;
		word32 s3_829;
		word32 s7_833;
		word32 s5_831;
		word32 s6_832;
		word32 s10_836;
		word32 s9_835;
		word32 s8_834;
		word32 s11_837;
		word32 t4_838;
		word32 s0_839;
		word32 a0_841;
		word32 a1_842;
		word32 s1_840;
		word32 a4_845;
		word32 a3_844;
		word32 a2_843;
		word32 a5_846;
		word32 s2_848;
		word32 s3_849;
		word32 a7_847;
		printf(bt_addr_le_str_real(printf(bt_addr_le_str_real(ra, s2_17, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_361, out a3_355), &g_t230BBE3C, a3_355, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_820, out a0_821, out a1_822, out a2_823, out a3_824, out a4_825, out a5_826, out a7_827, out s2_828, out s3_829, out s4_830, out s5_831, out s6_832, out s7_833, out s8_834, out s9_835, out s10_836, out s11_837, out t4_838), s0_361 + 112, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_839, out a3_406), &g_t230BBE54, a3_406, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_840, out a0_841, out a1_842, out a2_843, out a3_844, out a4_845, out a5_846, out a7_847, out s2_848, out s3_849, out s4_850, out s5_851, out s6_852, out s7_853, out s8_854, out s9_855, out s10_856, out s11_857, out t4_858);
	}
}

// 230546E0: Register Eq_2 smp_public_key_slave.part.15(Register Eq_2 ra, Register (ptr32 Eq_303426) s0, Register (ptr32 Eq_303426) a0, Register out ptr32 a0Out, Register out ptr32 a4Out)
// Called from:
//      smp_public_key
//      bt_smp_pkey_ready
Eq_2 smp_public_key_slave.part.15(Eq_2 ra, struct Eq_303426 * s0, struct Eq_303426 * a0, ptr32 & a0Out, ptr32 & a4Out)
{
	uint32 a5_5 = (word32) a0->b00A0;
	if (a5_5 > 0x05)
	{
		a0Out = 0x08;
		a4Out = 0x05;
		return ra;
	}
	else
	{
		<anonymous> * a5_13 = *((char *) g_a230BBA44 + a5_5 * 0x04);
		ptr32 a0_22;
		ptr32 a4_23;
		Eq_2 ra_25;
		a5_13();
		a0Out = a0_22;
		a4Out = a4_23;
		return ra_25;
	}
}

// 23054786: void smp_public_key(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void smp_public_key(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 s1_106;
	word32 a1_419;
	word32 a2_420;
	word32 a3_421;
	word32 a4_422;
	word32 a5_423;
	word32 a6_424;
	word32 a7_425;
	memcpy((word32) a0 + 0x00EF, s1, 32, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out a6_424, out a7_425);
	word32 a1_426;
	word32 a2_427;
	word32 a3_428;
	word32 a4_429;
	word32 a5_430;
	word32 a6_431;
	word32 a7_432;
	memcpy((word32) a0 + 271, (word32) s1 + 32, 32, out a1_426, out a2_427, out a3_428, out a4_429, out a5_430, out a6_431, out a7_432);
	Eq_2 s2_128 = (word32) a0 + 0x00EF;
	word32 a1_433;
	word32 a2_434;
	Eq_2 a5_108;
	Eq_2 a4_110;
	Eq_2 a3_177;
	Eq_2 a0_112 = memcmp((word32) a0 + 0x00EF, 0x230BBDDC, 64, out a1_433, out a2_434, out a3_177, out a4_110, out a5_108);
	s1_106 = s1;
	if (a0_112 == 0x00)
	{
		Eq_2 s4_68;
		word32 a2_435;
		word32 a5_436;
		s1_106 = atomic_set_bit(a0, 0x0D, a3_177, a4_110, mstatus, out a0_112, out a2_435, out a3_177, out a4_110, out a5_436, out s4_68);
		Eq_2 s0_71 = *s1_106;
		if (*((word32) s1_106 + 0x009C) == 0x00)
		{
			word32 s0_450;
			word32 s4_451;
			ra = bt_keys_get_addr(ra, s0_71, (word32) *((word32) s1_106 + 8), (word32) s1_106 + 112, (word32) a0 + 0x00EF, s3, s4_68, mstatus, dwLoc20, dwLoc1C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_450, out s1_106, out a0_112, out a3_177, out a4_110, out s2_128, out s3, out s4_451, out s5, out mstatus);
			*((word32) s1_106 + 0x009C) = a0_112;
		}
		a5_108 = *((word32) s1_106 + 0x009C);
		if (a5_108 != 0x00)
		{
			ui32 a4_109 = (word32) *((word32) a5_108 + 0x0A);
			a4_110 = a4_109 & 36;
			if ((a4_109 & 36) != 0x00)
			{
				ui32 a5_111 = (word32) *((word32) a5_108 + 9);
				a0_112.u0 = 0x03;
				a5_108 = a5_111 & 0x02;
				if ((a5_111 & 0x02) != 0x00)
					return;
			}
		}
	}
	Eq_2 s0_116 = *a5_108;
	if ((word32) *((word32) a5_108 + 3) == 0x00)
	{
		uint32 a5_118 = (word32) *((word32) s0_116 + 0x00A0);
		if (a5_118 > 0x05)
			return;
		<anonymous> * a5_125 = *((char *) g_a230BBA5C + a5_118 * 0x04);
		word32 tp_162;
		word32 s10_163;
		word32 s11_164;
		word32 s5_165;
		word32 s6_166;
		word32 s7_167;
		word32 s9_168;
		a5_125();
	}
	else
	{
		Eq_2 a5_170 = g_t4200F49C;
		if (a5_170 == 0x00)
		{
			word32 a0_444;
			word32 a2_445;
			word32 a3_446;
			word32 a4_447;
			word32 a5_448;
			word32 s4_449;
			atomic_set_bit(s0_116, 0x06, a3_177, a4_110, mstatus, out a0_444, out a2_445, out a3_446, out a4_447, out a5_448, out s4_449);
		}
		else
		{
			word32 a0_179;
			struct Eq_303426 * s0_207;
			word32 s1_437;
			word32 a3_438;
			word32 a4_439;
			word32 s2_440;
			word32 s3_441;
			word32 s5_442;
			word32 mstatus_443;
			Eq_2 ra_188 = sc_send_public_key(ra, s1_106, s0_116, a3_177, a4_110, a5_170, s2_128, s3, s5, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg54, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_207, out s1_437, out a0_179, out a3_438, out a4_439, out s2_440, out s3_441, out s5_442, out mstatus_443);
			if (a0_179 == 0x00)
			{
				word32 a0_452;
				word32 a4_453;
				smp_public_key_slave.part.15(ra_188, s0_207, s0_207, out a0_452, out a4_453);
			}
		}
	}
}

