pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23054904: void bt_smp_pkey_ready(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
void bt_smp_pkey_ready(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	g_t4200F49C = a0;
	if (a0 == 0x00)
	{
		word32 t4_757;
		word32 s11_756;
		word32 s10_755;
		word32 s9_754;
		word32 s8_753;
		word32 s7_752;
		word32 s6_751;
		word32 s5_750;
		word32 s4_749;
		word32 s3_748;
		word32 s2_747;
		word32 a7_746;
		word32 a5_745;
		word32 a4_744;
		word32 a3_743;
		word32 a2_742;
		word32 a1_741;
		word32 a0_740;
		word32 s1_739;
		printf(ra, &g_t230B9934, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_739, out a0_740, out a1_741, out a2_742, out a3_743, out a4_744, out a5_745, out a7_746, out s2_747, out s3_748, out s4_749, out s5_750, out s6_751, out s7_752, out s8_753, out s9_754, out s10_755, out s11_756, out t4_757);
		return;
	}
	struct Eq_303744 * a5_26;
	Eq_2 s0_29;
	word32 s10_736;
	word32 s11_737;
	word32 s8_734;
	word32 s9_735;
	word32 s6_732;
	word32 s7_733;
	word32 s2_730;
	word32 s4_731;
	word32 a1_728;
	word32 a2_729;
	word32 s1_726;
	word32 a0_727;
	Eq_2 s3_106;
	Eq_2 s5_108;
	Eq_2 a4_131;
	Eq_2 a3_130;
	Eq_2 ra_100 = k_sem_give(ra, 0x42026614, a3, a4, 0x4200F000, mstatus, dwArg04, dwArg08, dwArg50, dwArg54, dwArg78, dwArg84, dwArg9C, dwArgF8, dwArg0138, dwArg0178, out s0_29, out s1_726, out a0_727, out a1_728, out a2_729, out a3_130, out a4_131, out a5_26, out s2_730, out s3_106, out s4_731, out s5_108, out s6_732, out s7_733, out s8_734, out s9_735, out s10_736, out s11_737);
	Eq_2 s1_133 = (word32) s0_29 - 0x06AC;
	word32 a2_738;
	if (atomic_test_bit((word32) s0_29 - 1552, 0x06, out a2_738) != 0x00)
	{
		Eq_2 s1_57 = a5_26->t0000;
		Eq_2 a5_58 = (word32) a5_26->b0003;
		if (a5_58 != 0x00)
		{
			word32 s2_151;
			struct Eq_303426 * s0_166;
			Eq_2 a0_138;
			ra_100 = sc_send_public_key(ra_100, s1_57, (word32) s0_29 - 0x06AC, a3_130, a4_131, a5_58, s0_29, s3_106, s5_108, mstatus, s2, s0, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_166, out s1_133, out a0_138, out a3_130, out a4_131, out s2_151, out s3_106, out s5_108, out mstatus);
			if (a0_138 == 0x00)
			{
				ra_100 = smp_public_key_slave.part.15(ra_100, s0_166, (char *) s0_166 - 0x06AC, out a0_138, out a4_131);
				if (a0_138 == 0x00)
					goto l23054966;
			}
			word32 s0_760;
			ra_100 = smp_error(ra_100, s1_133, s2_151 + -0x06AC, a0_138, a3_130, a4_131, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg44, dwArg4C, dwArg54, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_760, out s1_133, out a3_130, out a4_131, out s3_106, out s5_108, out mstatus);
		}
		else
		{
			Eq_2 a0_60;
			Eq_2 s1_70;
			word32 s2_759;
			Eq_2 s0_101;
			Eq_2 a4_125;
			Eq_2 a3_126;
			ra_100 = sc_send_public_key(ra_100, s1_57, (word32) s0_29 - 0x06AC, a3_130, a4_131, a5_58, s0_29, s3_106, s5_108, mstatus, s2, s0, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_101, out s1_70, out a0_60, out a3_126, out a4_125, out s2_759, out s3_106, out s5_108, out mstatus);
			if (a0_60 != 0x00)
			{
				word32 s1_770;
				ra_100 = smp_error(ra_100, s1_70, (word32) s0_101 - 0x06AC, a0_60, a3_126, a4_125, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg44, dwArg4C, dwArg54, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_101, out s1_770, out a3_126, out a4_125, out s3_106, out s5_108, out mstatus);
			}
			word32 a0_771;
			word32 a2_772;
			word32 a5_773;
			word32 s4_774;
			s1_133 = atomic_set_bit(s0_101, 0x0C, a3_126, a4_125, mstatus, out a0_771, out a2_772, out a3_130, out a4_131, out a5_773, out s4_774);
		}
	}
l23054966:
	word32 a2_758;
	if (atomic_test_bit((word32) s1_133 + 0x0244, 0x06, out a2_758) != 0x00)
	{
		Eq_2 a5_224 = (word32) *((word32) *((word32) s1_133 + 424) + 3);
		if (a5_224 == 0x00)
		{
			Eq_2 a0_322;
			Eq_2 s1_332;
			word32 s0_350;
			word32 s5_765;
			word32 s3_764;
			word32 s2_763;
			ptr32 mstatus_330;
			Eq_2 a4_326;
			Eq_2 a3_325;
			Eq_2 ra_331 = sc_send_public_key(ra_100, s1_133, 1107389180, a3_130, a4_131, a5_224, 1107389180, s3_106, s5_108, mstatus, s2, s0, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_350, out s1_332, out a0_322, out a3_325, out a4_326, out s2_763, out s3_764, out s5_765, out mstatus_330);
			if (a0_322 != 0x00)
			{
				word32 s1_767;
				word32 s0_766;
				word32 s3_768;
				word32 s5_769;
				smp_error(ra_331, s1_332, s0_350 + -0x0504, a0_322, a3_325, a4_326, mstatus_330, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg44, dwArg4C, dwArg54, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_766, out s1_767, out a3_325, out a4_326, out s3_768, out s5_769, out mstatus_330);
			}
			0x00 = (int8) dwArg38;
			word32 a0_782;
			word32 a2_783;
			word32 a3_784;
			word32 a4_785;
			word32 a5_786;
			word32 s4_787;
			atomic_set_bit(s0, 0x0C, a3_325, a4_326, mstatus_330, out a0_782, out a2_783, out a3_784, out a4_785, out a5_786, out s4_787);
			return;
		}
		Eq_2 a3_240;
		ptr32 mstatus_245;
		Eq_2 s1_247;
		Eq_2 s2_250;
		struct Eq_303426 * s0_265;
		word32 s5_762;
		word32 s3_761;
		Eq_2 a0_237;
		Eq_2 a4_241;
		Eq_2 ra_246 = sc_send_public_key(ra_100, s1_133, 1107389180, a3_130, a4_131, a5_224, 1107389180, s3_106, s5_108, mstatus, s2, s0, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_265, out s1_247, out a0_237, out a3_240, out a4_241, out s2_250, out s3_761, out s5_762, out mstatus_245);
		if (a0_237 != 0x00)
		{
l230549EA:
			0x00 = (int8) dwArg38;
			word32 s0_775;
			word32 s1_776;
			word32 a3_777;
			word32 a4_778;
			word32 s3_779;
			word32 s5_780;
			word32 mstatus_781;
			smp_error(ra_246, s1_247, s2_250, a0_237, a3_240, a4_241, mstatus_245, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg54, dwArg5C, dwArg64, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_775, out s1_776, out a3_777, out a4_778, out s3_779, out s5_780, out mstatus_781);
			return;
		}
		ra_246 = smp_public_key_slave.part.15(ra_246, s0_265, (char *) s0_265 - 0x0504, out a0_237, out a4_241);
		if (a0_237 != 0x00)
			goto l230549EA;
	}
	0x00 = (int8) dwArg38;
}

// 23054A08: void smp_pairing_random(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_295071) a0, Register (ptr32 Eq_304063) a1, Register Eq_2 s4, Register word32 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack word32 dwArgF0, Stack word32 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0138, Stack word32 dwArg0158, Stack word32 dwArg0178, Stack word32 dwArg0198)
void smp_pairing_random(Eq_2 ra, Eq_2 s1, struct Eq_295071 * a0, struct Eq_304063 * a1, Eq_2 s4, word32 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, word32 dwArgF0, word32 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, word32 dwArg0138, word32 dwArg0158, word32 dwArg0178, word32 dwArg0198)
{
	word32 a1_661;
	word32 a2_662;
	word32 a3_663;
	word32 a4_664;
	word32 a5_665;
	word32 a6_666;
	word32 a7_667;
	memcpy(&a0->b00A0 + 47, a1->t0008, 0x10, out a1_661, out a2_662, out a3_663, out a4_664, out a5_665, out a6_666, out a7_667);
	word32 a2_668;
	Eq_2 a0_43 = atomic_test_bit((char *) &a0->ptr0000 + 0x009C, 0x05, out a2_668);
	struct Eq_304133 * s4_46 = a0->ptr0000;
	if (a0_43 == 0x00)
	{
		word32 a0_125;
		word32 s0_135;
		Eq_2 s3_138;
		struct Eq_304148 * s4_139;
		ptr32 s5_140;
		word32 s1_669;
		word32 a1_670;
		word32 a4_671;
		word32 a5_672;
		Eq_2 ra_134 = smp_c1(ra, &a0->b00A0 + 63, &a0->b00A0 + 47, &a0->b00A0 + 1, fp + -48, out s0_135, out s1_669, out a0_125, out a1_670, out a4_671, out a5_672, out s3_138, out s4_139, out s5_140);
		if (a0_125 != 0x00)
			goto l23054A60;
		word32 a1_673;
		word32 a2_674;
		word32 a3_675;
		word32 a4_676;
		word32 a5_677;
		if (memcmp(s0_135 + 0x00AF, fp + -48, 0x10, out a1_673, out a2_674, out a3_675, out a4_676, out a5_677) != 0x00)
			goto l23054A62;
		if ((word32) s4_139->b0003 == 0x00)
		{
			word32 a1_699;
			word32 a2_700;
			word32 a3_701;
			word32 a4_702;
			word32 a5_703;
			word32 a6_704;
			word32 a7_705;
			memcpy(fp + -48, s0_135 + 191, 0x08, out a1_699, out a2_700, out a3_701, out a4_702, out a5_703, out a6_704, out a7_705);
			word32 a1_706;
			word32 a2_707;
			word32 a3_708;
			word32 a4_709;
			word32 a5_710;
			word32 a6_711;
			word32 a7_712;
			memcpy(fp + -40, s3_138, 0x08, out a1_706, out a2_707, out a3_708, out a4_709, out a5_710, out a6_711, out a7_712);
			word32 a0_315;
			struct Eq_304349 * s0_324;
			Eq_2 s1_325;
			word32 a1_713;
			word32 a4_714;
			word32 a5_715;
			word32 s2_716;
			word32 s3_717;
			word32 s4_718;
			word32 s5_719;
			Eq_2 ra_336 = bt_encrypt_le(ra_134, s5_140, out s0_324, out s1_325, out a0_315, out a1_713, out a4_714, out a5_715, out s2_716, out s3_717, out s4_718, out s5_719);
			if (a0_315 != 0x00)
			{
l23054A60:
				goto l23054A62;
			}
			word32 t1_720;
			word32 a0_721;
			word32 a1_722;
			word32 a2_723;
			word32 a3_724;
			word32 a4_725;
			word32 a5_726;
			word32 t1_727;
			word32 a0_728;
			word32 a1_729;
			word32 a2_730;
			word32 a3_731;
			word32 a4_732;
			word32 a5_733;
			Eq_2 ra_361 = memset(memset(ra_336, fp + -60, 0x00, 0x02, out t1_720, out a0_721, out a1_722, out a2_723, out a3_724, out a4_725, out a5_726), fp + -56, 0x00, 0x08, out t1_727, out a0_728, out a1_729, out a2_730, out a3_731, out a4_732, out a5_733);
			Eq_2 a5_364 = (word32) s0_324->b00A5;
			Eq_2 a4_365 = (word32) s0_324->b00AC;
			if (a5_364 < a4_365)
				a4_365 = a5_364;
			word32 a0_380;
			Eq_2 a3_383;
			Eq_2 a4_384;
			ptr32 mstatus_388;
			Eq_2 s0_390;
			word32 s2_734;
			word32 s3_735;
			Eq_2 ra_389 = bt_conn_le_start_encryption(ra_361, s1_325, fp + -48, a4_365 & 0x00FF, a5_364, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_390, out a0_380, out a3_383, out a4_384, out s2_734, out s3_735, out mstatus_388);
			if (a0_380 != 0x00)
			{
				word32 s1_750;
				word32 a0_751;
				word32 a1_752;
				word32 a2_753;
				word32 a3_754;
				word32 a4_755;
				word32 a5_756;
				word32 a7_757;
				word32 s2_758;
				word32 s3_759;
				word32 s4_760;
				word32 s5_761;
				word32 s6_762;
				word32 s7_763;
				word32 s8_764;
				word32 s9_765;
				word32 s10_766;
				word32 s11_767;
				word32 t4_768;
				printf(ra_389, &g_t230BBE8C, a3_383, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_750, out a0_751, out a1_752, out a2_753, out a3_754, out a4_755, out a5_756, out a7_757, out s2_758, out s3_759, out s4_760, out s5_761, out s6_762, out s7_763, out s8_764, out s9_765, out s10_766, out s11_767, out t4_768);
				goto l23054A60;
			}
			word32 a0_744;
			word32 a2_745;
			word32 a3_746;
			word32 a4_747;
			word32 a5_748;
			word32 s4_749;
			atomic_set_bit(s0_390, 0x01, a3_383, a4_384, mstatus_388, out a0_744, out a2_745, out a3_746, out a4_747, out a5_748, out s4_749);
		}
		else
		{
			word32 a1_678;
			word32 a2_679;
			word32 a3_680;
			word32 a4_681;
			word32 a5_682;
			word32 a6_683;
			word32 a7_684;
			memcpy(fp + -48, s3_138, 0x08, out a1_678, out a2_679, out a3_680, out a4_681, out a5_682, out a6_683, out a7_684);
			word32 a1_685;
			word32 a2_686;
			word32 a3_687;
			word32 a4_688;
			word32 a5_689;
			word32 a6_690;
			word32 a7_691;
			memcpy(fp + -40, s0_135 + 191, 0x08, out a1_685, out a2_686, out a3_687, out a4_688, out a5_689, out a6_690, out a7_691);
			word32 a0_197;
			Eq_2 s0_206;
			Eq_2 s5_220;
			word32 s1_692;
			word32 a1_693;
			word32 a4_694;
			word32 a5_695;
			word32 s2_696;
			word32 s3_697;
			word32 s4_698;
			Eq_2 ra_218 = bt_encrypt_le(ra_134, s5_140, out s0_206, out s1_692, out a0_197, out a1_693, out a4_694, out a5_695, out s2_696, out s3_697, out s4_698, out s5_220);
			if (a0_197 != 0x00)
				goto l23054A60;
			Eq_2 a4_225;
			Eq_2 a3_230;
			word32 a1_736;
			word32 a2_737;
			word32 a5_738;
			word32 a6_739;
			word32 a7_740;
			memcpy(s5_220, fp + -48, 0x10, out a1_736, out a2_737, out a3_230, out a4_225, out a5_738, out a6_739, out a7_740);
			Eq_2 a3_244;
			Eq_2 a4_245;
			Eq_2 a5_246;
			word32 a0_741;
			word32 a2_742;
			word32 s4_743;
			atomic_set_bit(s0_206, 0x01, a3_230, a4_225, mstatus, out a0_741, out a2_742, out a3_244, out a4_245, out a5_246, out s4_743);
			smp_send_pairing_random(ra_218, s0_206, s0_206, a3_244, a4_245, a5_246, s5_220, mstatus, s6, s4, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg44, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8);
		}
	}
	else
	{
		if ((word32) s4_46->b0003 != 0x00)
		{
			uint32 a5_48 = (word32) a0->b00A0;
			if (a5_48 <= 0x05)
			{
				<anonymous> * a5_54 = *((char *) g_a230BBA8C + a5_48 * 0x04);
				word32 t2_469;
				word32 gp_468;
				word32 s10_471;
				word32 s11_472;
				word32 s7_473;
				word32 s9_474;
				a5_54();
				return;
			}
			goto l23054A60;
		}
		word32 a0_81 = sc_smp_check_confirm(a0);
		if (a0_81 == 0x00)
		{
			uint32 a5_85 = (word32) a0->b00A0;
			if (a5_85 <= 0x05)
			{
				<anonymous> * a5_91 = *((char *) g_a230BBA74 + a5_85 * 0x04);
				word32 gp_475;
				word32 t2_476;
				word32 s10_478;
				word32 s11_479;
				word32 s7_480;
				word32 s9_481;
				a5_91();
				return;
			}
			goto l23054A60;
		}
	}
l23054A62:
	0x00 = dwArg0198;
}

