pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23054CF0: Register Eq_2 bt_smp_request_ltk(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      le_ltk_request
Eq_2 bt_smp_request_ltk(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	ptr32 s0_217;
	word16 wLoc2A_381 = (word16) a3;
	word32 s5_659;
	word32 s4_658;
	word32 s3_657;
	Eq_2 s1_105;
	Eq_2 s2_220;
	ptr32 a5_200;
	Eq_2 a4_109;
	Eq_2 a3_127;
	Eq_2 ra_168 = smp_chan_get(ra, a0, a3, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_105, out a3_127, out a4_109, out a5_200, out s2_220, out s3_657, out s4_658, out s5_659);
	if (a0 == 0x00)
	{
l23054E6E:
		s0_217 = 0x00;
		goto l23054DE8;
	}
	Eq_2 a3_232;
	Eq_2 a4_227;
	ui32 a5_45 = (word32) wLoc2A_381;
	Eq_2 s0_107 = a0;
	if (a5_45 == 0x00)
	{
		s0_107 = dwArgB4;
		if ((a5_45 | a4_109) == 0x00)
		{
			word32 a2_660;
			if (atomic_test_bit((word32) a0 + 0x009C, 0x03, out a2_660) != 0x00)
			{
				word32 a2_661;
				if (atomic_test_bit((word32) a0 + 0x009C, 0x01, out a2_661) != 0x00)
				{
					uint32 a5_289 = (word32) *((word32) dwArgB4 + 0x00A5);
					uint32 s1_290 = (word32) *((word32) dwArgB4 + 0x00AC);
					if (a5_289 < s1_290)
						s1_290 = a5_289;
					Eq_2 s1_293 = s1_290 & 0x00FF;
					word32 a5_664;
					word32 a7_666;
					word32 a6_665;
					word32 a1_662;
					word32 a2_663;
					memcpy(s2_220, (word32) dwArgB4 + 223, s1_293, out a1_662, out a2_663, out a3_232, out a4_227, out a5_664, out a6_665, out a7_666);
					if (s1_293 <= 0x0F)
					{
						word32 a5_671;
						word32 a1_669;
						word32 a2_670;
						word32 t1_667;
						word32 a0_668;
						ra_168 = memset(ra_168, s2_220 + s1_293, 0x00, 0x10 - s1_293, out t1_667, out a0_668, out a1_669, out a2_670, out a3_232, out a4_227, out a5_671);
					}
					goto l23054D6E;
				}
			}
		}
	}
	if (*((word32) s1_105 + 0x009C) == 0x00)
	{
		Eq_2 a0_68;
		Eq_2 s3_78;
		word32 a5_672;
		word32 s4_673;
		s0_107 = bt_keys_find(32, (word32) *((word32) s1_105 + 8), (word32) s1_105 + 112, out s1_105, out a0_68, out a3_127, out a4_109, out a5_672, out s2_220, out s3_78, out s4_673);
		*((word32) s1_105 + 0x009C) = a0_68;
		if (a0_68 == 0x00)
		{
			Eq_2 a0_86;
			word32 s4_676;
			word32 a5_674;
			word32 s3_675;
			s0_107 = bt_keys_find(0x01, (word32) *((word32) s1_105 + 8), s3_78, out s1_105, out a0_86, out a3_127, out a4_109, out a5_674, out s2_220, out s3_675, out s4_676);
			*((word32) s1_105 + 0x009C) = a0_86;
		}
	}
	ui32 a5_104 = (word32) wLoc2A_381;
	Eq_2 a0_106 = *((word32) s1_105 + 0x009C);
	if (a5_104 == 0x00)
	{
		s0_107 = dwArgB4;
		if ((a5_104 | a4_109) == 0x00)
		{
			if (a0_106 == 0x00)
				goto l23054E54;
			if (((word32) *((word32) a0_106 + 0x0A) & 32) != 0x00)
			{
				Eq_2 s1_257 = (word32) *((word32) a0_106 + 8);
				word32 a2_679;
				word32 a1_678;
				word32 a5_680;
				word32 a6_681;
				word32 a7_682;
				memcpy(s2_220, (word32) a0_106 + 22, s1_257, out a1_678, out a2_679, out a3_127, out a4_109, out a5_680, out a6_681, out a7_682);
				a5_200 = 0x0F;
				s0_217 = 0x01;
				if (s1_257 <= 0x0F)
				{
					word32 a0_684;
					word32 a1_685;
					word32 t1_683;
					word32 a2_686;
					ra_168 = memset(ra_168, s2_220 + s1_257, 0x00, 0x10 - s1_257, out t1_683, out a0_684, out a1_685, out a2_686, out a3_127, out a4_109, out a5_200);
				}
				goto l23054DE8;
			}
l23054DFA:
			if (((word32) *((word32) a0_106 + 0x0A) & 0x01) != 0x00)
			{
				word32 a2_688;
				word32 a5_689;
				word32 a1_687;
				if (memcmp((word32) a0_106 + 100, fp + -40, 0x08, out a1_687, out a2_688, out a3_127, out a4_109, out a5_689) == 0x00)
				{
					word32 a5_692;
					word32 a2_691;
					word32 a1_690;
					if (memcmp((word32) *((word32) s1_105 + 0x009C) + 0x006C, fp + -42, 0x02, out a1_690, out a2_691, out a3_127, out a4_109, out a5_692) == 0x00)
					{
						Eq_2 a1_218 = *((word32) s1_105 + 0x009C);
						Eq_2 s1_224 = (word32) *((word32) a1_218 + 8);
						word32 a5_695;
						word32 a2_694;
						word32 a1_693;
						word32 a7_697;
						word32 a6_696;
						memcpy(s2_220, (word32) a1_218 + 110, s1_224, out a1_693, out a2_694, out a3_232, out a4_227, out a5_695, out a6_696, out a7_697);
						if (s1_224 <= 0x0F)
						{
							word32 t1_698;
							word32 a0_699;
							word32 a5_702;
							word32 a1_700;
							word32 a2_701;
							ra_168 = memset(ra_168, s2_220 + s1_224, 0x00, 0x10 - s1_224, out t1_698, out a0_699, out a1_700, out a2_701, out a3_232, out a4_227, out a5_702);
						}
l23054D6E:
						word32 a0_703;
						word32 s4_705;
						word32 a2_704;
						atomic_set_bit(s0_107, 0x01, a3_232, a4_227, mstatus, out a0_703, out a2_704, out a3_127, out a4_109, out a5_200, out s4_705);
						s0_217 = 0x01;
l23054DE8:
						0x00 = (int8) dwArg0128;
						a0Out = s0_217;
						a3Out = a3_127;
						a4Out = a4_109;
						a5Out = a5_200;
						return ra_168;
					}
				}
			}
l23054E54:
			word32 a2_677;
			Eq_2 a0_150 = atomic_test_bit((word32) s0_107 + 0x009C, 0x0E, out a2_677);
			if (a0_150 != 0x00)
			{
				s0_107 = *a0_150;
				word32 s2_708;
				word32 a0_707;
				ra_168 = bt_conn_security_changed(ra_168, a0_150, 0x02, dwLoc08, dwArg08, out s1_105, out a0_707, out a3_127, out a4_109, out s2_708);
			}
			word32 s5_706;
			a3_127 = smp_reset(s0_107, s1_105, s0_107, a3_127, a4_109, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg68, dwArg78, dwArgA8, dwArgE8, out a4_109, out a5_200, out s5_706);
			goto l23054E6E;
		}
	}
	if (a0_106 == 0x00)
		goto l23054E54;
	goto l23054DFA;
}

// 23054E72: Register Eq_2 bt_smp_sign_verify(Register Eq_2 ra, Register (ptr32 Eq_304905) a0, Register (ptr32 Eq_304906) a1, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 s11Out)
// Called from:
//      att_signed_write_cmd
Eq_2 bt_smp_sign_verify(Eq_2 ra, struct Eq_304905 * a0, struct Eq_304906 * a1, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C, Eq_2 dwArg0108, ptr32 & s0Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & s11Out)
{
	ptr32 s6_106;
	ptr32 s3_166;
	Eq_2 s2_165;
	ptr32 s11_105;
	ptr32 s0_110;
	Eq_2 ra_161;
	ptr32 a4_118;
	Eq_2 a0_115;
	ptr32 a3_117;
	word32 a1_344;
	word32 a2_345;
	word32 a3_346;
	word32 a4_347;
	word32 a5_348;
	word32 a6_349;
	word32 a7_350;
	memcpy(fp + ~0x1B, a1->dw0008 + ((word32) a1->w000C + ~0x0B), 0x0C, out a1_344, out a2_345, out a3_346, out a4_347, out a5_348, out a6_349, out a7_350);
	word32 a0_39;
	struct Eq_304971 * a5_44;
	Eq_2 s2_48;
	word32 s1_351;
	word32 a3_352;
	word32 a4_353;
	word32 s3_354;
	word32 s4_355;
	bt_keys_find(0x10, (word32) a0->b0008, &a0->b0008 + 0x0068, out s1_351, out a0_39, out a3_352, out a4_353, out a5_44, out s2_48, out s3_354, out s4_355);
	if (a0_39 == 0x00)
	{
		Eq_2 a3_232;
		word32 s1_364;
		word32 a0_365;
		word32 a1_366;
		word32 a2_367;
		word32 a5_368;
		word32 a7_369;
		word32 s4_370;
		word32 s5_371;
		word32 s7_372;
		word32 s8_373;
		word32 s9_374;
		word32 s10_375;
		word32 t4_376;
		ra_161 = printf(bt_addr_le_str_real(ra, s2_48, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_110, out a3_232), &g_t230BBC68, a3_232, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_364, out a0_365, out a1_366, out a2_367, out a3_117, out a4_118, out a5_368, out a7_369, out s2_165, out s3_166, out s4_370, out s5_371, out s6_106, out s7_372, out s8_373, out s9_374, out s10_375, out s11_105, out t4_376);
		a0_115.u0 = ~0x01;
	}
	else
	{
		struct Eq_304997 * a0_53 = a5_44->ptr0060;
		struct Eq_305001 * s0_55 = a0_53->ptr0008;
		Eq_2 a1_65;
		word32 a2_356;
		word32 a3_357;
		word32 a4_358;
		word32 a5_359;
		word32 a6_360;
		word32 a7_361;
		memcpy(a0_53 + ((word32) s0_55->w000C + ~0x0B) / 0x0C, fp + ~0x1F, 0x04, out a1_65, out a2_356, out a3_357, out a4_358, out a5_359, out a6_360, out a7_361);
		struct Eq_305031 * a1_81;
		struct Eq_305032 * s0_89;
		word32 a0_103;
		word32 a3_362;
		word32 a5_363;
		ra_161 = smp_sign_buf(ra, (char *) &a0_53->ptr0008 + 72, a1_65, (word32) (word16) ((word32) s0_55->w000C + ~0x0B), dwArg00, dwArg04, dwArg28, dwArg4C, out s0_89, out a0_103, out a1_81, out a3_362, out a5_363, out s2_165, out s3_166, out s6_106, out s11_105);
		if (a0_103 != 0x00)
		{
			Eq_2 a3_180;
			word32 s1_379;
			word32 a0_380;
			word32 a1_381;
			word32 a2_382;
			word32 a5_383;
			word32 a7_384;
			word32 s4_385;
			word32 s5_386;
			word32 s7_387;
			word32 s8_388;
			word32 s9_389;
			word32 s10_390;
			word32 t4_391;
			ra_161 = printf(bt_addr_le_str_real(ra_161, s2_165, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_110, out a3_180), &g_t230BBC8C, a3_180, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_379, out a0_380, out a1_381, out a2_382, out a3_117, out a4_118, out a5_383, out a7_384, out s2_165, out s3_166, out s4_385, out s5_386, out s6_106, out s7_387, out s8_388, out s9_389, out s10_390, out s11_105, out t4_391);
			a0_115.u0 = ~0x04;
		}
		else
		{
			s0_110 = a1_81->ptr0008;
			struct Eq_305104 * a5_116;
			word32 a1_377;
			word32 a2_378;
			a0_115 = memcmp(fp + ~0x1B, a1_81 + ((word32) s0_89->w000C + ~0x0B) / 0x0C, 0x0C, out a1_377, out a2_378, out a3_117, out a4_118, out a5_116);
			if (a0_115 != 0x00)
			{
				Eq_2 a3_128;
				word32 s1_392;
				word32 a0_393;
				word32 a1_394;
				word32 a2_395;
				word32 a5_396;
				word32 a7_397;
				word32 s4_398;
				word32 s5_399;
				word32 s7_400;
				word32 s8_401;
				word32 s9_402;
				word32 s10_403;
				word32 t4_404;
				ra_161 = printf(bt_addr_le_str_real(ra_161, s2_165, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_110, out a3_128), &g_t230BBCB0, a3_128, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_392, out a0_393, out a1_394, out a2_395, out a3_117, out a4_118, out a5_396, out a7_397, out s2_165, out s3_166, out s4_398, out s5_399, out s6_106, out s7_400, out s8_401, out s9_402, out s10_403, out s11_105, out t4_404);
				a0_115.u0 = -77;
			}
			else
				a5_116->dw0061 = a5_116->dw0060;
		}
	}
	s0Out = s0_110;
	a0Out = a0_115;
	a3Out = a3_117;
	a4Out = a4_118;
	s2Out = s2_165;
	s3Out = s3_166;
	s6Out = s6_106;
	s11Out = s11_105;
	return ra_161;
}

// 23054F42: Register Eq_2 bt_smp_sign(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_305235 a5Out, Register out Eq_2 s2Out)
// Called from:
//      att_send
Eq_2 bt_smp_sign(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_305235 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 s2_138;
	ptr32 s0_107;
	Eq_2 ra_134;
	Eq_305235 a5_127;
	ptr32 a0_148;
	ptr32 a3_131;
	word32 a0_19;
	Eq_2 a4_23;
	word32 s1_27;
	Eq_2 s2_28;
	word32 a3_265;
	word32 a5_266;
	word32 s3_267;
	word32 s4_268;
	bt_keys_find(0x08, (word32) *((word32) a0 + 8), (word32) a0 + 112, out s1_27, out a0_19, out a3_265, out a4_23, out a5_266, out s2_28, out s3_267, out s4_268);
	if (a0_19 == 0x00)
	{
		Eq_2 a3_153;
		word32 s1_281;
		word32 a0_282;
		word32 a1_283;
		word32 a2_284;
		word32 a4_285;
		word32 a7_286;
		word32 s3_287;
		word32 s4_288;
		word32 s5_289;
		word32 s6_290;
		word32 s7_291;
		word32 s8_292;
		word32 s9_293;
		word32 s10_294;
		word32 s11_295;
		word32 t4_296;
		ra_134 = printf(bt_addr_le_str_real(ra, s2_28, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_107, out a3_153), &g_t230BBC44, a3_153, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_281, out a0_282, out a1_283, out a2_284, out a3_131, out a4_285, out a5_127, out a7_286, out s2_138, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295, out t4_296);
		a0_148 = ~0x01;
	}
	else
	{
		struct Eq_305270 * a5_38;
		word32 a1_269;
		Eq_2 a0_36 = net_buf_simple_add(s1_27 + 8, 0x0C, a4_23, out a1_269, out a5_38);
		struct Eq_305280 * s1_40 = *((word32) a0_36 + 8);
		word32 s0_39 = a5_38->dw004C;
		Eq_2 a1_50;
		word32 a2_270;
		word32 a3_271;
		word32 a4_272;
		word32 a5_273;
		word32 a6_274;
		word32 a7_275;
		memcpy((word32) a0_36 + ((word32) s1_40->w000C + ~0x0B), fp + ~0x13, 0x04, out a1_50, out a2_270, out a3_271, out a4_272, out a5_273, out a6_274, out a7_275);
		struct Eq_305315 * a5_70;
		word32 s0_276;
		word32 a1_277;
		word32 s3_278;
		word32 s6_279;
		word32 s11_280;
		ra_134 = smp_sign_buf(ra, s0_39 + 60, a1_50, (word32) (word16) ((word32) s1_40->w000C + ~0x0B), dwArg00, dwArg04, dwArg28, dwArg4C, out s0_276, out a0_148, out a1_277, out a3_131, out a5_70, out s2_138, out s3_278, out s6_279, out s11_280);
		if (a0_148 != 0x00)
		{
			Eq_2 a3_101;
			word32 s1_297;
			word32 a0_298;
			word32 a1_299;
			word32 a2_300;
			word32 a4_301;
			word32 a7_302;
			word32 s3_303;
			word32 s4_304;
			word32 s5_305;
			word32 s6_306;
			word32 s7_307;
			word32 s8_308;
			word32 s9_309;
			word32 s10_310;
			word32 s11_311;
			word32 t4_312;
			ra_134 = printf(bt_addr_le_str_real(ra_134, s2_138, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_107, out a3_101), &g_t230BBC8C, a3_101, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_297, out a0_298, out a1_299, out a2_300, out a3_131, out a4_301, out a5_127, out a7_302, out s2_138, out s3_303, out s4_304, out s5_305, out s6_306, out s7_307, out s8_308, out s9_309, out s10_310, out s11_311, out t4_312);
			a0_148 = ~0x04;
		}
		else
		{
			s0_107 = a5_70->ptr004C;
			a5_70->ptr004D = s0_107;
			a5_127 = (char *) a5_70 + 1;
		}
	}
	s0Out = s0_107;
	a0Out = a0_148;
	a3Out = a3_131;
	a5Out = a5_127;
	s2Out = s2_138;
	return ra_134;
}

// 23054FDA: void bt_smp_auth_passkey_entry(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
// Called from:
//      ble_auth_passkey
void bt_smp_auth_passkey_entry(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	Eq_2 a3_21;
	Eq_2 a4_22;
	Eq_2 s3_29;
	Eq_2 s5_31;
	word32 s4_539;
	word32 s2_538;
	word32 a5_537;
	word32 s1_536;
	Eq_2 ra_24 = smp_chan_get(ra, a0, a3, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_536, out a3_21, out a4_22, out a5_537, out s2_538, out s3_29, out s4_539, out s5_31);
	if (a0 == 0x00)
	{
l23054FEE:
		goto l23054FF0;
	}
	word32 a0_44;
	Eq_2 a3_47;
	struct Eq_305464 * a5_49;
	word32 s4_542;
	word32 a4_541;
	word32 a1_540;
	atomic_test_and_clear_bit(0x09, a3_21, a4_22, mstatus, out a0_44, out a1_540, out a3_47, out a4_541, out a5_49, out s4_542);
	if (a0_44 == 0x00)
		goto l23054FEE;
	word32 a2_543;
	if (atomic_test_bit((word32) a0 + 0x009C, 0x05, out a2_543) == 0x00)
	{
		Eq_2 a4_189;
		Eq_2 a3_194;
		word32 a7_548;
		word32 a6_547;
		word32 a5_546;
		word32 a2_545;
		word32 a1_544;
		memcpy((word32) a0 + 223, fp + -36, 0x04, out a1_544, out a2_545, out a3_194, out a4_189, out a5_546, out a6_547, out a7_548);
		word32 a0_204;
		Eq_2 a3_207;
		Eq_2 a4_208;
		struct Eq_302197 * a5_209;
		word32 s4_550;
		word32 a1_549;
		atomic_test_and_clear_bit(0x00, a3_194, a4_189, mstatus, out a0_204, out a1_549, out a3_207, out a4_208, out a5_209, out s4_550);
		if (a0_204 != 0x00)
		{
			word32 a0_215;
			Eq_2 a3_218;
			Eq_2 a4_219;
			struct Eq_305550 * a5_220;
			ptr32 mstatus_224;
			Eq_2 s1_226;
			Eq_2 ra_225 = legacy_pairing_confirm(ra_24, a0, a3_207, a4_208, a5_209, (word32) a0 + 0x009C, s5_31, mstatus, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg4C, s3_29, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_226, out a0_215, out a3_218, out a4_219, out a5_220, out mstatus_224);
			if (a0_215 != 0x00)
			{
				word32 mstatus_557;
				word32 s5_556;
				word32 s3_555;
				word32 a4_554;
				word32 a3_553;
				word32 s1_552;
				word32 s0_551;
				smp_error(ra_225, s1_226, a0, 0x01, a3_218, a4_219, mstatus_224, dwLoc2C, dwLoc28, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg24, dwArg2C, dwArg34, dwArg48, s3_29, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_551, out s1_552, out a3_553, out a4_554, out s3_555, out s5_556, out mstatus_557);
			}
			else
			{
				Eq_2 s0_245 = a5_220->t0000;
				word32 a1_247 = 0x03;
				if ((word32) a5_220->b0003 != 0x00)
					a1_247 = 0x04;
				word32 a2_559;
				word32 a3_560;
				word32 a4_561;
				word32 a5_562;
				word32 s4_563;
				word32 a0_558;
				atomic_set_bit(s0_245, a1_247, a3_218, a4_219, mstatus_224, out a0_558, out a2_559, out a3_560, out a4_561, out a5_562, out s4_563);
			}
		}
		goto l23054FF0;
	}
	Eq_2 a3_103;
	Eq_2 a4_104;
	ptr32 mstatus_108;
	Eq_2 ra_109;
	Eq_2 s1_110;
	word32 a1_128;
	Eq_2 s0_60 = a5_49->t0000;
	*((word32) s0_60 + 368) = s3_29;
	if ((word32) a5_49->b0003 == 0x00)
	{
		word32 a0_100;
		ra_109 = smp_send_pairing_confirm(ra_24, s0_60, s0_60, a3_47, (word32) a0 + 0x009C, s5_31, mstatus, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg54, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_110, out a0_100, out a3_103, out a4_104, out mstatus_108);
		if (a0_100 != 0x00)
			goto l23055070;
		a1_128 = 0x03;
	}
	else
	{
		word32 a2_564;
		if (atomic_test_bit((word32) a0 + 0x009C, 0x00, out a2_564) == 0x00)
			goto l23054FF0;
		word32 a0_70;
		ra_109 = smp_send_pairing_confirm(ra_24, s0_60, s0_60, a3_47, (word32) a0 + 0x009C, s5_31, mstatus, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg54, dwArg58, ra, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_110, out a0_70, out a3_103, out a4_104, out mstatus_108);
		a1_128 = 0x04;
		if (a0_70 != 0x00)
		{
l23055070:
			word32 s0_565;
			word32 s1_566;
			word32 a3_567;
			word32 a4_568;
			word32 s5_570;
			word32 mstatus_571;
			word32 s3_569;
			smp_error(ra_109, s1_110, s0_60, 0x01, a3_103, a4_104, mstatus_108, dwLoc2C, dwLoc28, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg24, dwArg2C, dwArg34, dwArg48, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_565, out s1_566, out a3_567, out a4_568, out s3_569, out s5_570, out mstatus_571);
			goto l23055078;
		}
	}
	word32 a2_573;
	word32 a0_572;
	word32 a4_575;
	word32 a3_574;
	word32 s4_577;
	word32 a5_576;
	atomic_set_bit(s0_60, a1_128, a3_103, a4_104, mstatus_108, out a0_572, out a2_573, out a3_574, out a4_575, out a5_576, out s4_577);
l23054FF0:
	0x00 = (int8) dwArg0128;
}

