pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230550A0: void bt_smp_auth_passkey_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
// Called from:
//      ble_auth_passkey_confirm
void bt_smp_auth_passkey_confirm(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	Eq_2 a3_17;
	Eq_2 a4_18;
	Eq_2 s3_25;
	word32 s5_336;
	word32 s4_335;
	word32 s2_334;
	word32 a5_333;
	word32 s1_332;
	Eq_2 ra_20 = smp_chan_get(ra, a0, a3, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_332, out a3_17, out a4_18, out a5_333, out s2_334, out s3_25, out s4_335, out s5_336);
	if (a0 == 0x00)
	{
l230550B0:
		goto l230550B2;
	}
	word32 a0_40;
	Eq_2 a3_43;
	Eq_2 a4_44;
	struct Eq_305702 * a5_45;
	word32 s4_338;
	word32 a1_337;
	Eq_2 s1_46 = atomic_test_and_clear_bit(0x09, a3_17, a4_18, mstatus, out a0_40, out a1_337, out a3_43, out a4_44, out a5_45, out s4_338);
	if (a0_40 == 0x00)
		goto l230550B0;
	word32 a2_339;
	if (atomic_test_bit(s1_46, 0x07, out a2_339) == 0x00)
	{
		word32 a2_346;
		Eq_2 a0_57 = atomic_test_bit(s1_46, 0x0F, out a2_346);
		if (a0_57 == 0x00)
		{
			word32 a2_347;
			if (atomic_test_bit(s1_46, 0x08, out a2_347) != 0x00)
			{
				Eq_2 a3_108;
				Eq_2 a4_107;
				Eq_2 ra_105;
				Eq_2 s1_104;
				Eq_2 s0_102;
				Eq_2 a0_100;
				Eq_2 s0_66 = a5_45->t0000;
				if ((word32) a5_45->b0003 == 0x00)
				{
					word32 s2_348;
					ra_105 = compute_and_send_master_dhcheck(ra_20, s1_46, s0_66, a0_57, s3_25, dwArgC4, dwArgE0, dwArgE4, dwArg0108, dwArg0128, out s0_102, out s1_104, out a0_100, out a3_108, out a4_107, out s2_348);
				}
				else
				{
					word32 s2_356;
					ra_105 = compute_and_check_and_send_slave_dhcheck(ra_20, s1_46, s0_66, a0_57, s3_25, dwArg0118, out s0_102, out s1_104, out a0_100, out a3_108, out a4_107, out s2_356);
				}
				if (a0_100 != 0x00)
				{
					word32 mstatus_355;
					word32 s5_354;
					word32 s3_353;
					word32 a4_352;
					word32 a3_351;
					word32 s1_350;
					word32 s0_349;
					smp_error(ra_105, s1_104, s0_102, a0_100, a3_108, a4_107, mstatus, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg38, dwArg44, dwArg4C, dwArg54, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_349, out s1_350, out a3_351, out a4_352, out s3_353, out s5_354, out mstatus_355);
				}
			}
l230550B2:
			0x00 = (int8) dwArg38;
			return;
		}
	}
	word32 s4_345;
	word32 a5_344;
	word32 a4_343;
	word32 a3_342;
	word32 a2_341;
	word32 a0_340;
	atomic_set_bit(a0, 0x08, a3_43, a4_44, mstatus, out a0_340, out a2_341, out a3_342, out a4_343, out a5_344, out s4_345);
	goto l230550B2;
}

// 2305511E: void bt_smp_auth_cancel(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
// Called from:
//      ble_auth_cancel
void bt_smp_auth_cancel(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	Eq_2 a3_13;
	Eq_2 a4_14;
	word32 s5_172;
	word32 s3_170;
	word32 s4_171;
	word32 a5_168;
	word32 s2_169;
	word32 s1_167;
	Eq_2 ra_16 = smp_chan_get(ra, a0, a3, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_167, out a3_13, out a4_14, out a5_168, out s2_169, out s3_170, out s4_171, out s5_172);
	if (a0 == 0x00)
		return;
	word32 a0_35;
	word32 a3_38;
	word32 s4_176;
	word32 a4_174;
	word32 a5_175;
	word32 a1_173;
	atomic_test_and_clear_bit(0x09, a3_13, a4_14, mstatus, out a0_35, out a1_173, out a3_38, out a4_174, out a5_175, out s4_176);
	if (a0_35 == 0x00)
		return;
	uint32 a5_45 = (word32) *((word32) a0 + 0x00A0);
	if (a5_45 > 0x05)
		return;
	<anonymous> * a5_52 = *((char *) g_a230BBAA4 + a5_45 * 0x04);
	a5_52();
}

// 2305517A: void bt_smp_auth_pairing_confirm(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      ble_auth_pairing_confirm
void bt_smp_auth_pairing_confirm(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a3_18;
	Eq_2 a4_19;
	Eq_2 s2_25;
	Eq_2 s3_26;
	Eq_2 s5_28;
	word32 s4_400;
	word32 a5_399;
	word32 s1_398;
	Eq_2 ra_21 = smp_chan_get(ra, a0, a3, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_398, out a3_18, out a4_19, out a5_399, out s2_25, out s3_26, out s4_400, out s5_28);
	if (a0 == 0x00)
	{
l2305518C:
		goto l2305518E;
	}
	word32 a0_41;
	Eq_2 a3_44;
	Eq_2 a4_45;
	word32 s4_403;
	word32 a5_402;
	word32 a1_401;
	Eq_2 s1_47 = atomic_test_and_clear_bit(0x09, a3_18, a4_19, mstatus, out a0_41, out a1_401, out a3_44, out a4_45, out a5_402, out s4_403);
	if (a0_41 == 0x00)
		goto l2305518C;
	if ((word32) *((word32) s2_25 + 3) == 0x00)
	{
		word32 a2_404;
		if (atomic_test_bit(s1_47, 0x05, out a2_404) == 0x00)
		{
			Eq_2 a3_207;
			Eq_2 a4_208;
			Eq_2 a5_209;
			word32 s4_407;
			word32 a2_406;
			word32 a0_405;
			atomic_set_bit(a0, 0x03, a3_44, a4_45, mstatus, out a0_405, out a2_406, out a3_207, out a4_208, out a5_209, out s4_407);
			word32 mstatus_413;
			word32 a5_412;
			word32 a4_411;
			word32 a3_410;
			word32 a0_409;
			word32 s1_408;
			legacy_send_pairing_confirm(ra_21, a0, a0, a3_207, a4_208, a5_209, s2_25, s5_28, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out s1_408, out a0_409, out a3_410, out a4_411, out a5_412, out mstatus_413);
			goto l230551CC;
		}
		if (g_t4200F49C == 0x00)
		{
			word32 a3_416;
			word32 a2_415;
			word32 a0_414;
			word32 a4_417;
			word32 a5_418;
			word32 s4_419;
			atomic_set_bit(a0, 0x06, a3_44, a4_45, mstatus, out a0_414, out a2_415, out a3_416, out a4_417, out a5_418, out s4_419);
			goto l2305518E;
		}
		Eq_2 a3_152;
		Eq_2 a4_153;
		Eq_2 a5_154;
		word32 a0_420;
		word32 a2_421;
		word32 s4_422;
		word32 s0_423;
		word32 s1_424;
		word32 a0_425;
		word32 a3_426;
		word32 a4_427;
		word32 s2_428;
		word32 s3_429;
		word32 s5_430;
		word32 mstatus_431;
		sc_send_public_key(ra_21, atomic_set_bit(a0, 0x0C, a3_44, a4_45, mstatus, out a0_420, out a2_421, out a3_152, out a4_153, out a5_154, out s4_422), a0, a3_152, a4_153, a5_154, s2_25, s3_26, s5_28, mstatus, s2, s0, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_423, out s1_424, out a0_425, out a3_426, out a4_427, out s2_428, out s3_429, out s5_430, out mstatus_431);
	}
	else
	{
		word32 a2_432;
		if (atomic_test_bit(s1_47, 0x05, out a2_432) != 0x00)
		{
			Eq_2 a3_63;
			Eq_2 a4_64;
			Eq_2 a5_65;
			word32 a0_441;
			word32 a2_442;
			word32 s4_443;
			atomic_set_bit(a0, 0x0C, a3_44, a4_45, mstatus, out a0_441, out a2_442, out a3_63, out a4_64, out a5_65, out s4_443);
			word32 a0_71;
			word32 a3_444;
			word32 a4_445;
			word32 s2_446;
			word32 mstatus_447;
			send_pairing_rsp(ra_21, a0, a0, a3_63, a4_64, a5_65, s5_28, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_71, out a3_444, out a4_445, out s2_446, out mstatus_447);
l2305518E:
			0x00 = (int8) dwArg38;
			return;
		}
		Eq_2 a3_106;
		Eq_2 a4_107;
		Eq_2 a5_108;
		word32 a0_433;
		word32 a2_434;
		word32 s4_435;
		atomic_set_bit(a0, 0x03, a3_44, a4_45, mstatus, out a0_433, out a2_434, out a3_106, out a4_107, out a5_108, out s4_435);
		word32 a0_436;
		word32 a3_437;
		word32 a4_438;
		word32 s2_439;
		word32 mstatus_440;
		send_pairing_rsp(ra_21, a0, a0, a3_106, a4_107, a5_108, s5_28, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg6C, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_436, out a3_437, out a4_438, out s2_439, out mstatus_440);
	}
l230551CC:
	goto l2305518E;
}

