pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23055228: Register Eq_2 bt_smp_start_security(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_set_security
Eq_2 bt_smp_start_security(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a4_162;
	Eq_2 s1_101;
	Eq_2 a3_107;
	Eq_2 a4_108;
	Eq_2 s0_362;
	word32 a5_17 = (word32) *((word32) a0 + 3);
	Eq_2 s0_18 = a0;
	if (a5_17 != 0x00)
	{
		a4_162.u0 = 0x01;
		if (a5_17 != 0x01)
		{
l23055244:
			s1_101.u0 = ~0x15;
			goto l23055254;
		}
		Eq_2 s4_175;
		word32 s1_826;
		word32 a5_827;
		word32 s2_828;
		word32 s5_829;
		ra = smp_chan_get(ra, a0, a3, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_826, out a3, out a4_162, out a5_827, out s2_828, out s3, out s4_175, out s5_829);
		s2 = a0;
		if (a0 != 0x00)
		{
			s3 = (word32) a0 + 0x009C;
			s1_101.u0 = ~0x04;
			word32 a2_831;
			if (atomic_test_bit((word32) a0 + 0x009C, 0x04, out a2_831) != 0x00)
				goto l23055254;
			word32 a2_832;
			if (atomic_test_bit((word32) a0 + 0x009C, 0x03, out a2_832) == 0x00)
			{
				word32 a2_833;
				if (atomic_test_bit((word32) a0 + 0x009C, 0x01, out a2_833) == 0x00)
				{
					word32 a0_205;
					sec_level_reachable.isra.1((word32) *((word32) a0 + 0x0A), a3, a4_162, out a0_205, out a3, out a4_162);
					if (a0_205 == 0x00)
					{
						word32 a2_834;
						if (atomic_test_bit((word32) a0 + 4, 11, out a2_834) != 0x00)
							goto l23055244;
						word32 a5_872;
						if (smp_keys_check.part.5(a0, out a3, out a4_162, out a5_872) == 0x00)
							goto l23055244;
					}
					if (*((word32) a0 + 0x009C) == 0x00)
					{
						Eq_2 a0_236;
						word32 s4_836;
						word32 s5_837;
						ra = bt_keys_get_addr(ra, a0, (word32) *((word32) a0 + 8), (word32) a0 + 112, a0, (word32) a0 + 0x009C, s4_175, mstatus, dwLoc30, dwLoc2C, dwLoc28, s4, s2, s0, dwLoc18, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_18, out s1_101, out a0_236, out a3, out a4_162, out s2, out s3, out s4_836, out s5_837, out mstatus);
						*((word32) s0_18 + 0x009C) = a0_236;
						if (a0_236 == 0x00)
							goto l23055254;
					}
					word32 a0_272;
					Eq_2 a5_277;
					Eq_2 s5_292;
					word32 s1_835;
					ra = smp_init(ra, s2, mstatus, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgA8, dwArgE8, out s1_835, out a0_272, out a3, out a4_162, out a5_277, out s2, out s3, out s5_292);
					if (a0_272 != 0x00)
					{
l23055334:
						s1_101.u0 = -55;
						goto l23055254;
					}
					Eq_2 a0_300;
					word32 s1_838;
					word32 a2_839;
					word32 a5_840;
					word32 s5_841;
					ra = smp_create_pdu.isra.7(ra, s2, a3, a4_162, a5_277, s5_292, mstatus, dwArg08, dwArg10, dwArg14, dwArg38, dwArg54, s3, dwArg68, dwArgA8, dwArgC8, out s1_838, out a0_300, out a2_839, out a3, out a4_162, out a5_840, out s2, out s3, out s5_841, out mstatus);
					if (a0_300 == 0x00)
						goto l23055334;
					word32 a1_848;
					word32 a5_849;
					Eq_2 a0_332 = net_buf_simple_add((word32) a0_300 + 8, 0x01, a4_162, out a1_848, out a5_849);
					word32 a0_339;
					Eq_2 a5_343;
					word32 a3_850;
					word32 a4_851;
					Eq_2 s1_344 = get_auth.isra.0((word32) s0_18 + 0x0A, 0x09, a3, a4_162, out a0_339, out a3_850, out a4_851, out a5_343);
					*a0_332 = (byte) a0_339;
					Eq_2 a3_355;
					Eq_2 a4_356;
					word32 s1_852;
					word32 a0_853;
					word32 a1_854;
					word32 a5_855;
					word32 s4_856;
					word32 s5_857;
					word32 s6_858;
					word32 s7_859;
					word32 s8_860;
					word32 s9_861;
					word32 s10_862;
					word32 s11_863;
					ra = bt_l2cap_send_cb(ra, s1_344, s0_18, 0x06, a0_300, 0x00, a5_343, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg44, dwArg4C, dwArg58, s3, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_362, out s1_852, out a0_853, out a1_854, out a3_355, out a4_356, out a5_855, out s2, out s3, out s4_856, out s5_857, out s6_858, out s7_859, out s8_860, out s9_861, out s10_862, out s11_863, out mstatus);
					word32 a0_864;
					word32 a2_865;
					word32 a5_866;
					word32 s4_867;
					atomic_set_bit(s0_362, 0x0E, a3_355, a4_356, mstatus, out a0_864, out a2_865, out a3_107, out a4_108, out a5_866, out s4_867);
					goto l230552D4;
				}
			}
l2305529C:
			s1_101.u0 = ~0x0F;
			goto l23055254;
		}
	}
	else
	{
		Eq_2 s1_27;
		Eq_2 s4_32;
		word32 a5_823;
		word32 s3_824;
		word32 s5_825;
		ra = smp_chan_get(ra, a0, a3, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_27, out a3, out a4_162, out a5_823, out s2, out s3_824, out s4_32, out s5_825);
		s3 = a0;
		if (a0 != 0x00)
		{
			word32 a2_830;
			if (atomic_test_bit((word32) a0 + 4, 11, out a2_830) == 0x00)
			{
				Eq_2 a5_50;
				if (smp_keys_check.part.5(a0, out a3, out a4_162, out a5_50) != 0x00)
				{
					s2 = (word32) a0 + 0x009C;
					word32 a2_842;
					if (atomic_test_bit((word32) a0 + 0x009C, 0x03, out a2_842) == 0x00)
					{
						word32 a2_843;
						if (atomic_test_bit((word32) a0 + 0x009C, 0x01, out a2_843) == 0x00)
						{
							Eq_2 a1_65 = *((word32) a0 + 0x009C);
							Eq_2 a0_72;
							ra = bt_conn_le_start_encryption(ra, s1_27, (word32) a1_65 + 22, (word32) *((word32) a1_65 + 8), a5_50, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_362, out a0_72, out a3, out a4_162, out s2, out s3, out mstatus);
							s1_101 = a0_72;
							if (a0_72 != 0x00)
								goto l23055254;
							word32 a0_844;
							word32 a2_845;
							word32 a5_846;
							word32 s4_847;
							atomic_set_bit(s0_362, 11, a3, a4_162, mstatus, out a0_844, out a2_845, out a3_107, out a4_108, out a5_846, out s4_847);
l230552D4:
							word32 a0_868;
							word32 a2_869;
							word32 a5_870;
							word32 s4_871;
							s1_101 = atomic_set_bit(s0_362, 0x01, a3_107, a4_108, mstatus, out a0_868, out a2_869, out a3, out a4_162, out a5_870, out s4_871);
l23055254:
							0x00 = (int8) dwArg0128;
							s0Out = dwArgE4;
							s1Out = s1_101;
							a0Out = s1_101;
							a3Out = a3;
							a4Out = a4_162;
							s2Out = s2;
							s3Out = s3;
							mstatusOut = mstatus;
							return ra;
						}
					}
					goto l2305529C;
				}
			}
			0x00 = (int8) dwArg0128;
			Eq_2 a0_133;
			Eq_2 a3_136;
			Eq_2 a4_137;
			Eq_2 s0_142;
			Eq_2 s1_143;
			Eq_2 s2_146;
			Eq_2 s3_147;
			ptr32 mstatus_158;
			Eq_2 ra_141 = smp_send_pairing_req(ra, dwArgE4, s1_27, a0, a3, s2, a0, s4_32, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg74, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_142, out s1_143, out a0_133, out a3_136, out a4_137, out s2_146, out s3_147, out mstatus_158);
			s0Out = s0_142;
			s1Out = s1_143;
			a0Out = a0_133;
			a3Out = a3_136;
			a4Out = a4_137;
			s2Out = s2_146;
			s3Out = s3_147;
			mstatusOut = mstatus_158;
			return ra_141;
		}
	}
	s1_101.u0 = -57;
	goto l23055254;
}

// 23055396: Register Eq_2 bt_smp_update_keys(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      hci_encrypt_key_refresh_complete
//      hci_encrypt_change
Eq_2 bt_smp_update_keys(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 s0_15 = a0;
	Eq_2 s3_28;
	Eq_2 s4_29;
	word32 a4_552;
	word32 a5_553;
	word32 s5_555;
	word32 s2_554;
	word32 s1_551;
	Eq_2 a3_128;
	Eq_2 ra_23 = smp_chan_get(ra, a0, a3, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out s1_551, out a3_128, out a4_552, out a5_553, out s2_554, out s3_28, out s4_29, out s5_555);
	if (a0 != 0x00)
	{
		word32 a2_556;
		if (atomic_test_bit((word32) a0 + 0x009C, 0x03, out a2_556) != 0x00)
		{
			Eq_2 a0_45 = *((word32) a0 + 0x009C);
			if (a0_45 != 0x00)
			{
				word32 a3_561;
				word32 a4_562;
				ra_23 = bt_keys_clear(ra_23, a0, a0, a0_45, a3_128, (word32) a0 + 0x009C, s3_28, s4_29, mstatus, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg44, dwArg48, dwArg58, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out a3_561, out a4_562);
			}
			Eq_2 a0_66;
			struct Eq_306461 * s1_75;
			Eq_2 s2_76;
			Eq_2 s3_77;
			word32 s5_560;
			word32 a3_557;
			word32 s4_559;
			word32 a4_558;
			ra_23 = bt_keys_get_addr(ra_23, a0, (word32) *((word32) a0 + 8), (word32) a0 + 112, (word32) a0 + 0x009C, (word32) a0 + 112, s4_29, mstatus, dwLoc20, dwLoc1C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s0_15, out s1_75, out a0_66, out a3_557, out a4_558, out s2_76, out s3_77, out s4_559, out s5_560, out mstatus);
			*((word32) s0_15 + 0x009C) = a0_66;
			if (a0_66 == 0x00)
			{
				Eq_2 a3_228;
				Eq_2 a3_258;
				Eq_2 a4_259;
				Eq_2 s1_262;
				word32 s10_578;
				word32 s11_579;
				word32 s9_577;
				word32 s8_576;
				word32 t4_580;
				word32 s4_572;
				word32 s5_573;
				word32 s7_575;
				word32 s6_574;
				word32 a5_568;
				word32 a7_569;
				word32 s3_571;
				word32 s2_570;
				word32 s0_564;
				word32 a0_565;
				word32 a2_567;
				word32 a1_566;
				Eq_2 ra_261 = printf(bt_addr_le_str_real(ra_23, s3_77, s2, dwArg14, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0108, out s0_564, out a3_228), &g_t230BBE60, a3_228, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_262, out a0_565, out a1_566, out a2_567, out a3_258, out a4_259, out a5_568, out a7_569, out s2_570, out s3_571, out s4_572, out s5_573, out s6_574, out s7_575, out s8_576, out s9_577, out s10_578, out s11_579, out t4_580);
				Eq_2 a3_286;
				ptr32 mstatus_291;
				Eq_2 s0_293;
				word32 a4_582;
				word32 s3_583;
				word32 s1_581;
				word32 s5_584;
				Eq_2 ra_292 = smp_error(ra_261, s1_262, s1_262, 0x08, a3_258, a4_259, mstatus, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg48, dwArg54, dwArg5C, s3, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_293, out s1_581, out a3_286, out a4_582, out s3_583, out s5_584, out mstatus_291);
				s0Out = s0_293;
				a3Out = a3_286;
				mstatusOut = mstatus_291;
				return ra_292;
			}
			word32 a2_563;
			if (atomic_test_bit(s2_76, 0x0D, out a2_563) != 0x00)
			{
				Eq_2 a4_101 = *((word32) s0_15 + 0x009C);
				*((word32) a4_101 + 9) = (byte) ((word32) *((word32) a4_101 + 9) | 2);
			}
			ui32 a5_116;
			Eq_2 a3_107 = *((word32) s0_15 + 0x009C);
			up32 a2_109 = (word32) s1_75->b00A0;
			ui32 a5_111 = (word32) *((word32) a3_107 + 9);
			if (a2_109 <= 0x05 && (0x01 << a2_109 & 46) != 0x00)
				a5_116 = a5_111 | 1;
			else
				a5_116 = a5_111 & ~0x01;
			*((word32) a3_107 + 9) = (byte) a5_116;
			up32 a4_124 = (word32) s1_75->b00AC;
			up32 a5_125 = (word32) s1_75->b00A5;
			a3_128 = *((word32) s0_15 + 0x009C);
			if (a4_124 < a5_125)
				a5_125 = a4_124;
			*((word32) a3_128 + 8) = (byte) a5_125;
			word32 a2_585;
			Eq_2 a0_139 = atomic_test_bit(s2_76, 0x05, out a2_585);
			Eq_2 a5_143 = *((word32) s0_15 + 0x009C);
			ui32 a4_144 = (word32) *((word32) a5_143 + 9);
			if (a0_139 != 0x00)
			{
				*((word32) a5_143 + 9) = (byte) (a4_144 | 16);
				word32 a2_586;
				if (atomic_test_bit(s2_76, 0x0C, out a2_586) != 0x00)
				{
					bt_keys_add_type(*((word32) s0_15 + 0x009C), 32);
					word32 a1_587;
					word32 a4_590;
					word32 a5_591;
					word32 a3_589;
					word32 a2_588;
					word32 a7_593;
					word32 a6_592;
					memcpy((word32) *((word32) s0_15 + 0x009C) + 22, &s1_75->b00AC + 0x0033, 0x10, out a1_587, out a2_588, out a3_589, out a4_590, out a5_591, out a6_592, out a7_593);
					word32 t1_594;
					word32 a3_598;
					word32 a0_595;
					word32 a1_596;
					word32 a4_599;
					word32 a2_597;
					word32 a5_600;
					Eq_2 ra_202 = memset(ra_23, (word32) *((word32) s0_15 + 0x009C) + 0x0C, 0x00, 0x08, out t1_594, out a0_595, out a1_596, out a2_597, out a3_598, out a4_599, out a5_600);
					Eq_2 a0_205 = *((word32) s0_15 + 0x009C);
					Eq_2 a3_218;
					word32 t1_601;
					word32 a1_603;
					word32 a0_602;
					word32 a4_605;
					word32 a5_606;
					word32 a2_604;
					Eq_2 ra_221 = memset(ra_202, (word32) a0_205 + 20, 0x00, 0x02, out t1_601, out a0_602, out a1_603, out a2_604, out a3_218, out a4_605, out a5_606);
					s0Out = s0_15;
					a3Out = a3_218;
					mstatusOut = mstatus;
					return ra_221;
				}
			}
			else
				*((word32) a5_143 + 9) = (byte) (a4_144 & ~0x10);
		}
	}
	s0Out = s0_15;
	a3Out = a3_128;
	mstatusOut = mstatus;
	return ra_23;
}

// 230554D4: Register Eq_2 bt_smp_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_conn_init
Eq_2 bt_smp_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_18;
	Eq_2 s5_33;
	word32 s1_115;
	word32 a0_116;
	word32 a1_117;
	word32 a4_118;
	word32 a5_119;
	word32 s2_120;
	word32 s3_121;
	word32 s4_122;
	word32 s6_123;
	word32 s7_124;
	word32 s8_125;
	Eq_2 ra_30 = k_sem_init(ra, s0, 0x42026614, 0x00, 0x01, a3, a4, a5, mstatus, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgD8, dwArg0118, out s1_115, out a0_116, out a1_117, out a3_18, out a4_118, out a5_119, out s2_120, out s3_121, out s4_122, out s5_33, out s6_123, out s7_124, out s8_125);
	g_b4200F4A0 = (byte) (word32) (((word32) g_b4200DDA2 & 0x06) < ~0x06);
	ptr32 a3_51;
	ptr32 a4_52;
	ptr32 s1_54;
	ptr32 mstatus_62;
	ptr32 s3_66;
	ptr32 s5_67;
	word32 a0_126;
	word32 a5_127;
	word32 s2_128;
	Eq_2 ra_63 = bt_pub_key_gen(ra_30, &g_dw4200EC40, a3_18, s5_33, mstatus, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_54, out a0_126, out a3_51, out a4_52, out a5_127, out s2_128, out s3_66, out s5_67, out mstatus_62);
	s1Out = s1_54;
	a0Out = 0x00;
	a3Out = a3_51;
	a4Out = a4_52;
	s3Out = s3_66;
	s5Out = s5_67;
	mstatusOut = mstatus_62;
	return ra_63;
}

// 23055514: Register Eq_258169 bt_keys_find_addr.part.2(Register Eq_258169 a0, Register Eq_2 a1, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_258169 a5Out, Register out Eq_2 s2Out)
// Called from:
//      bt_conn_security_changed
//      bt_keys_find_addr
Eq_258169 bt_keys_find_addr.part.2(Eq_258169 a0, Eq_2 a1, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_258169 & a5Out, union Eq_2 & s2Out)
{
	Eq_258169 a5_29;
	ptr32 a0_41;
	Eq_2 a0_21;
	if ((word32) g_b42016CA4 == a0)
	{
		word32 a1_113;
		word32 a2_114;
		word32 a5_115;
		a0_21 = memcmp(0x42016CA5, a1, 0x07, out a1_113, out a2_114, out a3, out a4, out a5_115);
		if (a0_21 == 0x00)
		{
l23055558:
			a5_29.u0 = 0x0084;
			a0_41 = (ptr32) ((byte) a0_21.u0 + 1107389736);
			goto l23055566;
		}
	}
	a5_29 = (word32) g_b42016D28;
	if (a5_29 == a0)
	{
		word32 a1_111;
		word32 a2_112;
		if (memcmp(1107389737, a1, 0x07, out a1_111, out a2_112, out a3, out a4, out a5_29) == 0x00)
		{
			a0_21.u0 = 0x01;
			goto l23055558;
		}
	}
	a0_41 = 0x00;
l23055566:
	0x00 = (int8) dwArg38;
	a0Out = a0_41;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_29;
	s2Out = a1;
	return a0;
}

// 23055572: Register word32 bt_keys_find.part.1(Register Eq_296077 a0, Register Eq_296078 a1, Register Eq_2 a2, Register out Eq_2 s1Out, Register out Eq_306884 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_296078 a5Out, Register out Eq_296078 s2Out, Register out Eq_296077 s3Out, Register out ptr32 s4Out)
// Called from:
//      bt_keys_find
//      bt_keys_get_type
word32 bt_keys_find.part.1(Eq_296077 a0, Eq_296078 a1, Eq_2 a2, union Eq_2 & s1Out, union Eq_306884 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_296078 & a5Out, union Eq_296078 & s2Out, union Eq_296077 & s3Out, ptr32 & s4Out)
{
	Eq_306884 a0_101;
	int32 a0_35;
	Eq_296078 a5_116 = (word32) g_w42016CAE & a0;
	if (a5_116 != 0x00)
	{
		a5_116 = (word32) g_b42016CA4;
		if (a5_116 == a1)
		{
			word32 a2_140;
			word32 a1_139;
			if (memcmp(0x42016CA5, a2, 0x07, out a1_139, out a2_140, out a3, out a4, out a5_116) == 0x00)
			{
				a0_35 = 0x00;
				goto l230555D2;
			}
		}
	}
	if (((word32) g_w42016D32 & a0) != 0x00)
	{
		a5_116 = (word32) g_b42016D28;
		if (a5_116 == a1)
		{
			word32 a1_141;
			word32 a2_142;
			if (memcmp(1107389737, a2, 0x07, out a1_141, out a2_142, out a3, out a4, out a5_116) == 0x00)
			{
				a0_35 = 0x0084;
l230555D2:
				a0_101 = a0_35 + 0x42016CA4;
l230555D4:
				s1Out = a2;
				a0Out = a0_101;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_116;
				s2Out = a1;
				s3Out = a0;
				s4Out = dwArg04;
				return 0x42016CA4;
			}
		}
	}
	a0_101.u0 = 0x00;
	goto l230555D4;
}

