pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230555EA: Register Eq_2 bt_keys_get_addr(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_295592) a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_295626) s0Out, Register out (ptr32 Eq_295627) s1Out, Register out (ptr32 Eq_295628) a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_295628) s2Out, Register out (ptr32 Eq_295592) s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      update_keys_check
//      smp_pairing_req
//      smp_public_key
//      bt_smp_start_security
//      bt_smp_update_keys
//      bt_keys_get_type
Eq_2 bt_keys_get_addr(Eq_2 ra, Eq_2 s0, struct Eq_295592 * a0, Eq_2 a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_295626 & s0Out, struct Eq_295627 & s1Out, struct Eq_295628 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_295628 & s2Out, struct Eq_295592 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	ptr32 a3_152;
	ptr32 a4_153;
	struct Eq_295628 * s2_156;
	int32 s2_33;
	struct Eq_295592 * s3_130 = a0;
	Eq_2 s4_131 = a1;
	struct Eq_295627 * s1_126 = &g_b42016CA4;
	if ((word32) g_b42016CA4 == a0)
	{
		word32 a2_584;
		word32 a1_583;
		word32 a5_585;
		if (memcmp(0x42016CA5, a1, 0x07, out a1_583, out a2_584, out a3_152, out a4_153, out a5_585) == 0x00)
		{
			s2_33 = 0x00;
			goto l23055706;
		}
	}
	Eq_306961 s0_161 = 0x00;
	word32 a2_579;
	word32 a1_578;
	word32 a3_580;
	word32 a4_581;
	word32 a5_582;
	if (memcmp(0x42016CA5, fp + -48, 0x07, out a1_578, out a2_579, out a3_580, out a4_581, out a5_582) != 0x00)
		s0_161 = (word32) ((word32) g_b42016CAC != 0x00) << 1;
	if ((word32) g_b42016D28 != a0)
	{
l23055658:
		if (s0_161 != 0x02)
		{
l230556CA:
			ui32 s0_165 = (word32) s0_161 + 0x0084;
			s2_156 = (struct Eq_295628 *) (s1_126 + s0_165 / 0x00A0);
			s2_156->b0000 = (byte) s3_130;
			struct Eq_307034 * a5_180;
			word32 a1_589;
			word32 a2_590;
			word32 a4_591;
			word32 a6_592;
			word32 a7_593;
			memcpy(s1_126 + (s0_165 + 0x01) / 0x00A0, s4_131, 0x07, out a1_589, out a2_590, out a3_152, out a4_591, out a5_180, out a6_592, out a7_593);
			a4_153 = a5_180->ptr0000;
			a5_180->ptr0001 = a4_153;
			s2_156->ptr0080 = &a5_180->ptr0001;
			g_ptr4200F4A8 = s2_156;
			goto l23055708;
		}
		Eq_2 dwLoc2C_397 = SEQ(bLoc29, 0x00, 0x00);
		word32 a1_594;
		word32 a2_595;
		word32 a3_596;
		word32 a4_597;
		word32 a5_598;
		if (memcmp(1107389737, fp + -48, 0x07, out a1_594, out a2_595, out a3_596, out a4_597, out a5_598) == 0x00 || (word32) g_b42016D30 == 0x00)
		{
			s0_161.u0 = 0x01;
			goto l230556CA;
		}
		Eq_2 s0_95 = 0x42016D28;
		if (g_t42016DA8 >= g_t42016D24)
			s0_95.u0 = 0x42016CA4;
		Eq_2 s2_100 = (word32) s0_95 + 1;
		int32 s0_125;
		Eq_2 s2_129;
		word32 a0_599;
		word32 a3_600;
		ra = bt_unpair(ra, s0_95, 0x42016CA4, (word32) *s0_95, s2_100, s2_100, a1, mstatus, dwLoc2C_397, dwLoc28, s4, s2, s0, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_125, out s1_126, out a0_599, out a3_600, out s2_129, out s3_130, out s4_131, out s5, out mstatus);
		s2_156 = null;
		word32 a1_601;
		word32 a2_602;
		word32 a5_603;
		if (memcmp(s2_129, fp + -40, 0x07, out a1_601, out a2_602, out a3_152, out a4_153, out a5_603) == 0x00)
		{
			s0_161 = (s0_125 - s1_126 >> 2) + 0x3E0F83E1;
			if (s0_161 <= 0x01)
				goto l230556CA;
		}
l23055708:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_126;
		a0Out = s2_156;
		a3Out = a3_152;
		a4Out = a4_153;
		s2Out = s2_156;
		s3Out = s3_130;
		s4Out = s4_131;
		s5Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
	word32 a1_586;
	word32 a2_587;
	word32 a5_588;
	if (memcmp(1107389737, a1, 0x07, out a1_586, out a2_587, out a3_152, out a4_153, out a5_588) != 0x00)
		goto l23055658;
	s2_33 = 0x0084;
l23055706:
	s2_156 = s2_33 + 0x42016CA4;
	goto l23055708;
}

// 23055724: Register Eq_2 bt_keys_foreach(Register Eq_2 ra, Register Eq_278416 a0, Register (ptr32 Eq_278417) a1, Register ptr32 a2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Register out (ptr32 Eq_278417) s0Out, Register out (ptr32 Eq_278423) s1Out, Register out Eq_278416 s2Out, Register out Eq_2 s4Out)
// Called from:
//      bt_id_del
//      enh_conn_complete
//      bt_keys_clear_all
Eq_2 bt_keys_foreach(Eq_2 ra, Eq_278416 a0, struct Eq_278417 * a1, ptr32 a2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, struct Eq_278417 & s0Out, struct Eq_278423 & s1Out, union Eq_278416 & s2Out, union Eq_2 & s4Out)
{
	Eq_278416 s2_26 = a0;
	struct Eq_278417 * s0_18 = a1;
	struct Eq_278423 * s1_19 = &g_b42016CA4;
	if (((word32) g_w42016CAE & a0) != 0x00)
	{
		struct Eq_307176 * sp_25;
		word32 t1_34;
		a1();
		a2 = sp_25->ptr0084;
	}
	if (((word32) s1_19->w008E & s2_26) == 0x00)
	{
		s0Out = s0_18;
		s1Out = s1_19;
		s2Out = s2_26;
		s4Out = dwArg04;
		return ra;
	}
	else
	{
		Eq_278416 s2_63;
		struct Eq_278417 * s0_65;
		struct Eq_278423 * s1_66;
		Eq_2 ra_67;
		word32 t1_71;
		Eq_2 s4_75;
		s0_18();
		s0Out = s0_65;
		s1Out = s1_66;
		s2Out = s2_63;
		s4Out = s4_75;
		return ra_67;
	}
}

