pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305577E: Register Eq_2 bt_keys_find(Register Eq_296077 a0, Register Eq_296078 a1, Register Eq_2 a2, Register out (ptr32 Eq_297057) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_297060 a4Out, Register out ptr32 a5Out, Register out Eq_297062 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      smp_keys_check.part.5
//      smp_security_request
//      bt_smp_request_ltk
//      bt_smp_sign_verify
//      bt_smp_sign
Eq_2 bt_keys_find(Eq_296077 a0, Eq_296078 a1, Eq_2 a2, struct Eq_297057 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_297060 & a4Out, ptr32 & a5Out, union Eq_297062 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a0_6;
	ptr32 a5_8;
	struct Eq_297057 * s1_11;
	Eq_297062 s2_12;
	ptr32 s3_13;
	ptr32 s4_14;
	ptr32 a3_18;
	Eq_297060 a4_19;
	Eq_2 s0_10 = bt_keys_find.part.1(a0, a1, a2, out s1_11, out a0_6, out a3_18, out a4_19, out a5_8, out s2_12, out s3_13, out s4_14);
	s1Out = s1_11;
	a0Out = a0_6;
	a3Out = a3_18;
	a4Out = a4_19;
	a5Out = a5_8;
	s2Out = s2_12;
	s3Out = s3_13;
	s4Out = s4_14;
	return s0_10;
}

// 23055782: Register Eq_2 bt_keys_get_type(Register Eq_2 ra, Register Eq_2 s0, Register Eq_296077 a0, Register Eq_296078 a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_295592) s1Out, Register out (ptr32 Eq_296107) a0Out, Register out ptr32 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 mstatusOut)
// Called from:
//      smp_ident_info
//      smp_encrypt_info
//      smp_signing_info
//      smp_master_ident
//      smp_ident_addr_info
Eq_2 bt_keys_get_type(Eq_2 ra, Eq_2 s0, Eq_296077 a0, Eq_296078 a1, Eq_2 a2, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, struct Eq_295592 & s1Out, struct Eq_296107 & a0Out, ptr32 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & mstatusOut)
{
	word32 a4_154;
	word32 a5_155;
	ptr32 a3_110;
	struct Eq_296107 * a0_108;
	struct Eq_295592 * s1_118;
	Eq_2 s2_123;
	Eq_2 s3_124;
	Eq_2 s4_125;
	Eq_2 s0_22 = bt_keys_find.part.1(a0, a1, a2, out s1_118, out a0_108, out a3_110, out a4_154, out a5_155, out s2_123, out s3_124, out s4_125);
	if (a0_108 == null)
	{
		ui32 s0_43;
		word32 a4_156;
		ra = bt_keys_get_addr(ra, s0_22, s1_118, s2_123, s2_123, s3_124, s4_125, mstatus, s2, s0, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_43, out s1_118, out a0_108, out a3_110, out a4_156, out s2_123, out s3_124, out s4_125, out s5, out mstatus);
		if (a0_108 != null)
			a0_108->w000A = (word16) (s0_43 | (word32) a0_108->w000A);
	}
	0x00 = (int8) dwArg38;
	s1Out = s1_118;
	a0Out = a0_108;
	a3Out = a3_110;
	s2Out = s2_123;
	s3Out = s3_124;
	s4Out = s4_125;
	s5Out = s5;
	mstatusOut = mstatus;
	return ra;
}

// 230557B8: Register Eq_2 bt_keys_find_irk(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register out (ptr32 Eq_277178) s0Out, Register out Eq_2 s1Out, Register out Eq_277180 a0Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      bt_lookup_id_addr
Eq_2 bt_keys_find_irk(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_277178 & s0Out, union Eq_2 & s1Out, union Eq_277180 & a0Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	if ((word32) *a1 != 0x01 || ((word32) (*((word32) a1 + 6)) & 0x00C0) != 64)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out.u0 = 0x00;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return ra;
	}
	Eq_277180 a0_151;
	int32 a0_153;
	Eq_2 s1_100 = a1;
	Eq_2 s2_117 = a0;
	struct Eq_277178 * s0_115 = &g_b42016CA4;
	if (((word32) g_w42016CAE & 0x02) != 0x00 && (word32) g_b42016CA4 == a0)
	{
		word32 a5_404;
		word32 a4_403;
		word32 a2_401;
		word32 a3_402;
		word32 a1_400;
		if (memcmp((word32) a1 + 1, 0x42016CDA, 0x06, out a1_400, out a2_401, out a3_402, out a4_403, out a5_404) == 0x00)
		{
			a0_153 = 0x00;
			goto l23055836;
		}
	}
	if (((word32) g_w42016D32 & 0x02) != 0x00 && (word32) g_b42016D28 == a0)
	{
		word32 a5_409;
		word32 a4_408;
		word32 a3_407;
		word32 a1_405;
		word32 a2_406;
		if (memcmp((word32) a1 + 1, 1107389790, 0x06, out a1_405, out a2_406, out a3_407, out a4_408, out a5_409) == 0x00)
		{
			a0_153 = 0x0084;
l23055836:
			a0_151 = a0_153 + 0x42016CA4;
l23055884:
			s0Out = s0_115;
			s1Out = s1_100;
			a0Out = a0_151;
			s2Out = s2_117;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s8Out = dwLoc1C;
			return ra;
		}
	}
	if (((word32) g_w42016CAE & 0x02) != 0x00 && (word32) g_b42016CA4 == a0)
	{
		word32 a0_68;
		ra = bt_rpa_irk_matches(ra, 0x42016CCA, (word32) a1 + 1, out s0_115, out s1_100, out a0_68, out s2_117, out s3, out s5);
		if (a0_68 != 0x00)
		{
			s1_100.u0 = 0x00;
			goto l23055894;
		}
	}
	if (((word32) s0_115->w008E & 0x02) == 0x00 || (word32) s0_115->b0084 != s2_117)
	{
l23055882:
		a0_151.u0 = 0x00;
		goto l23055884;
	}
	word32 a0_105;
	word32 s1_410;
	ra = bt_rpa_irk_matches(ra, &s0_115->w008E + 0x0E, (byte) s1_100.u0 + 1, out s0_115, out s1_410, out a0_105, out s2_117, out s3, out s5);
	s1_100.u0 = 0x0084;
	if (a0_105 == 0x00)
		goto l23055882;
l23055894:
	word32 a7_417;
	word32 a6_416;
	word32 a4_414;
	word32 a5_415;
	word32 a3_413;
	word32 a2_412;
	word32 a1_411;
	memcpy(s1_100 + 54 + s0_115, s3, 0x06, out a1_411, out a2_412, out a3_413, out a4_414, out a5_415, out a6_416, out a7_417);
	a0_151 = s0_115 + s1_100;
	goto l23055884;
}

