pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230558A8: Register word32 bt_keys_find_addr(Register Eq_258169 a0, Register Eq_2 a1, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out)
// Called from:
//      bt_unpair
//      bt_addr_le_is_bonded
//      legacy_request_tk
word32 bt_keys_find_addr(Eq_258169 a0, Eq_2 a1, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out)
{
	ptr32 a0_6;
	ptr32 a2_8;
	ptr32 a3_9;
	ptr32 a4_10;
	ptr32 a5_11;
	ptr32 s2_13;
	word32 s1_12 = bt_keys_find_addr.part.2(a0, a1, dwArg38, out a0_6, out a2_8, out a3_9, out a4_10, out a5_11, out s2_13);
	a0Out = a0_6;
	a2Out = a2_8;
	a3Out = a3_9;
	a4Out = a4_10;
	a5Out = a5_11;
	s2Out = s2_13;
	return s1_12;
}

// 230558AC: void bt_keys_add_type(Register Eq_2 a0, Register int32 a1)
// Called from:
//      bt_smp_distribute_keys
//      bt_smp_update_keys
void bt_keys_add_type(Eq_2 a0, int32 a1)
{
	*((word32) a0 + 0x0A) = (word16) (a1 | (word32) (*((word32) a0 + 0x0A)));
}

// 230558B8: Register Eq_2 bt_keys_clear(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bt_unpair
//      smp_pairing_failed
//      smp_timeout
//      bt_smp_disconnected
//      bt_smp_update_keys
//      keys_clear_id
Eq_2 bt_keys_clear(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 s0_10 = a0;
	if (((word32) *((word32) a0 + 0x0A) & 0x02) != 0x00)
		ra = bt_id_del(ra, s1, a3, s2, s3, s4, mstatus, dwLoc10, s0, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_10);
	ptr32 a3_60;
	ptr32 a4_61;
	word32 t1_137;
	word32 a0_138;
	word32 a1_139;
	word32 a2_140;
	word32 a5_141;
	Eq_2 ra_63 = memset(ra, s0_10, 0x00, 0x0084, out t1_137, out a0_138, out a1_139, out a2_140, out a3_60, out a4_61, out a5_141);
	a3Out = a3_60;
	a4Out = a4_61;
	return ra_63;
}

// 230558DE: void keys_clear_id(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 byte) a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void keys_clear_id(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, byte * a1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	if ((word32) *a1 != (word32) (*a0))
		return;
	word32 a3_68;
	word32 a4_69;
	bt_keys_clear(ra, s0, s1, a0, a3, s2, s3, s4, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg40, dwArg44, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a3_68, out a4_69);
}

// 230558F0: Register Eq_2 bt_keys_clear_all(Register Eq_2 ra, Stack Eq_2 dwArg08, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out)
// Called from:
//      bt_unpair
Eq_2 bt_keys_clear_all(Eq_2 ra, Eq_2 dwArg08, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out)
{
	ptr32 s0_15;
	ptr32 s1_16;
	ptr32 s2_17;
	word32 s4_36;
	Eq_2 ra_23 = bt_keys_foreach(ra, 63, &g_t230558DE, fp + ~0x10, dwLoc20, dwLoc1C, dwArg08, out s0_15, out s1_16, out s2_17, out s4_36);
	s0Out = s0_15;
	s1Out = s1_16;
	s2Out = s2_17;
	return ra_23;
}

// 23055912: Register word32 bt_keys_update_usage(Register Eq_258169 a0, Register Eq_2 a1, Stack Eq_2 dwArg28, Register out (ptr32 Eq_258192) a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_258192) a4Out, Register out ptr32 s2Out)
// Called from:
//      bt_conn_security_changed
word32 bt_keys_update_usage(Eq_258169 a0, Eq_2 a1, Eq_2 dwArg28, struct Eq_258192 & a0Out, ptr32 & a3Out, struct Eq_258192 & a4Out, ptr32 & s2Out)
{
	struct Eq_258192 * a0_8;
	ptr32 s2_15;
	word32 a2_45;
	word32 a5_46;
	ptr32 a3_11;
	struct Eq_258192 * a4_12;
	word32 s1_14 = bt_keys_find_addr.part.2(a0, a1, dwArg28, out a0_8, out a2_45, out a3_11, out a4_12, out a5_46, out s2_15);
	if (a0_8 != null)
	{
		ptr32 a5_18 = a4_12->dw0000;
		if (a4_12 != a0_8)
		{
			a3_11 = a4_12->dw0000;
			a0_8->dw0000 = a5_18;
			a4_12->ptr0001 = a3_11;
			a0_8->ptr0080 = &a4_12->ptr0001;
			a4_12 = (struct Eq_258192 *) &a4_12->ptr0001;
		}
	}
	a0Out = a0_8;
	a3Out = a3_11;
	a4Out = a4_12;
	s2Out = s2_15;
	return s1_14;
}

