pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23055944: Register Eq_2 bt_settings_encode_key(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_272162) a3, Register Eq_2 a4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s11Out)
// Called from:
//      bt_gatt_connected
Eq_2 bt_settings_encode_key(Eq_2 ra, Eq_2 a0, Eq_2 a1, struct Eq_272162 * a3, Eq_2 a4, Eq_2 dwArg18, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s11Out)
{
	ptr32 s11_110;
	Eq_2 ra_106;
	Eq_2 t3_14 = (word32) a3->b0001;
	if (a4 != 0x00)
	{
		word32 s0_141;
		word32 s1_142;
		word32 a0_143;
		word32 a1_144;
		word32 a2_145;
		word32 a3_146;
		word32 a4_147;
		word32 a5_148;
		word32 a7_149;
		word32 s2_150;
		word32 s3_151;
		word32 s4_152;
		word32 s5_153;
		word32 s6_154;
		word32 s7_155;
		word32 s8_156;
		word32 s9_157;
		word32 s10_158;
		ra_106 = snprintf(ra, a0, a1, &g_t230BBF08, dwLoc08, dwArg18, dwArg44, t3_14, a4, dwArg88, dwArgAC, out s0_141, out s1_142, out a0_143, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148, out a7_149, out s2_150, out s3_151, out s4_152, out s5_153, out s6_154, out s7_155, out s8_156, out s9_157, out s10_158, out s11_110);
	}
	else
	{
		word32 s0_123;
		word32 s1_124;
		word32 a0_125;
		word32 a1_126;
		word32 a2_127;
		word32 a3_128;
		word32 a4_129;
		word32 a5_130;
		word32 a7_131;
		word32 s2_132;
		word32 s3_133;
		word32 s4_134;
		word32 s5_135;
		word32 s6_136;
		word32 s7_137;
		word32 s8_138;
		word32 s9_139;
		word32 s10_140;
		ra_106 = snprintf(ra, a0, a1, &g_t230BBF2C, dwLoc08, dwArg18, dwArg44, t3_14, dwArg64, dwArg88, dwArgAC, out s0_123, out s1_124, out a0_125, out a1_126, out a2_127, out a3_128, out a4_129, out a5_130, out a7_131, out s2_132, out s3_133, out s4_134, out s5_135, out s6_136, out s7_137, out s8_138, out s9_139, out s10_140, out s11_110);
	}
	s11Out = s11_110;
	return ra_106;
}

// 2305599C: void notify_func(Register Eq_2 ra, Register (ptr32 Eq_307698) a1, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void notify_func(Eq_2 ra, struct Eq_307698 * a1, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if ((word32) a1->w0028 == 0x00)
	{
		word32 s1_120;
		word32 a0_121;
		word32 a1_122;
		word32 a2_123;
		word32 a3_124;
		word32 a4_125;
		word32 a5_126;
		word32 a7_127;
		word32 s2_128;
		word32 s3_129;
		word32 s4_130;
		word32 s5_131;
		word32 s6_132;
		word32 s7_133;
		word32 s8_134;
		word32 s9_135;
		word32 s10_136;
		word32 s11_137;
		word32 t4_138;
		printf(ra, &g_t230BC9E4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out a7_127, out s2_128, out s3_129, out s4_130, out s5_131, out s6_132, out s7_133, out s8_134, out s9_135, out s10_136, out s11_137, out t4_138);
		a1->w0024 = 0x00;
	}
	else
	{
		word32 s1_101;
		word32 a0_102;
		word32 a1_103;
		word32 a2_104;
		word32 a3_105;
		word32 a4_106;
		word32 a5_107;
		word32 a7_108;
		word32 s2_109;
		word32 s3_110;
		word32 s4_111;
		word32 s5_112;
		word32 s6_113;
		word32 s7_114;
		word32 s8_115;
		word32 s9_116;
		word32 s10_117;
		word32 s11_118;
		word32 t4_119;
		printf(ra, &g_t230BC9F4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_101, out a0_102, out a1_103, out a2_104, out a3_105, out a4_106, out a5_107, out a7_108, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115, out s9_116, out s10_117, out s11_118, out t4_119);
	}
}

// 230559D6: void le_param_updated(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void le_param_updated(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 s1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	word32 a7_43;
	word32 s2_44;
	word32 s3_45;
	word32 s4_46;
	word32 s5_47;
	word32 s6_48;
	word32 s7_49;
	word32 s8_50;
	word32 s9_51;
	word32 s10_52;
	word32 s11_53;
	word32 t4_54;
	printf(ra, &g_t230BC9B0, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42, out a7_43, out s2_44, out s3_45, out s4_46, out s5_47, out s6_48, out s7_49, out s8_50, out s9_51, out s10_52, out s11_53, out t4_54);
}

// 230559E2: void ble_set_tx_pwr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void ble_set_tx_pwr(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	struct Eq_274 * a0_113;
	if (a2 != 0x02)
		a0_113 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		Eq_2 a3_15;
		word32 a0_221;
		word32 a1_222;
		word32 a4_223;
		word32 s8_224;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + ~0x10, out a0_221, out a1_222, out a3_15, out a4_223, out s8_224);
		up32 a0_24 = (word32) bLoc11;
		if (a0_24 > 0x14)
		{
			word32 s1_225;
			word32 a0_226;
			word32 a1_227;
			word32 a2_228;
			word32 a3_229;
			word32 a4_230;
			word32 a5_231;
			word32 a7_232;
			word32 s2_233;
			word32 s3_234;
			word32 s4_235;
			word32 s5_236;
			word32 s6_237;
			word32 s7_238;
			word32 s8_239;
			word32 s9_240;
			word32 s10_241;
			word32 s11_242;
			word32 t4_243;
			printf(ra, &g_t230BC48C, a3_15, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_225, out a0_226, out a1_227, out a2_228, out a3_229, out a4_230, out a5_231, out a7_232, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s7_238, out s8_239, out s9_240, out s10_241, out s11_242, out t4_243);
			return;
		}
		word32 a0_30;
		ra = bt_set_tx_pwr(ra, s1, (int32) (byte) a0_24, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg54, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out a0_30, out a3);
		if (a0_30 != 0x00)
		{
			word32 s1_244;
			word32 a0_245;
			word32 a1_246;
			word32 a2_247;
			word32 a3_248;
			word32 a4_249;
			word32 a5_250;
			word32 a7_251;
			word32 s2_252;
			word32 s3_253;
			word32 s4_254;
			word32 s5_255;
			word32 s6_256;
			word32 s7_257;
			word32 s8_258;
			word32 s9_259;
			word32 s10_260;
			word32 s11_261;
			word32 t4_262;
			printf(ra, &g_t230BC4D0, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_244, out a0_245, out a1_246, out a2_247, out a3_248, out a4_249, out a5_250, out a7_251, out s2_252, out s3_253, out s4_254, out s5_255, out s6_256, out s7_257, out s8_258, out s9_259, out s10_260, out s11_261, out t4_262);
			return;
		}
		a0_113 = (struct Eq_274 *) &g_t230BC500;
	}
	word32 s1_263;
	word32 a0_264;
	word32 a1_265;
	word32 a2_266;
	word32 a3_267;
	word32 a4_268;
	word32 a5_269;
	word32 a7_270;
	word32 s2_271;
	word32 s3_272;
	word32 s4_273;
	word32 s5_274;
	word32 s6_275;
	word32 s7_276;
	word32 s8_277;
	word32 s9_278;
	word32 s10_279;
	word32 s11_280;
	word32 t4_281;
	printf(ra, a0_113, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_263, out a0_264, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a7_270, out s2_271, out s3_272, out s4_273, out s5_274, out s6_275, out s7_276, out s8_277, out s9_278, out s10_279, out s11_280, out t4_281);
}

// 23055A4A: void ble_unsubscribe(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack word32 dwArgC4, Stack Eq_2 dwArgD8, Stack word32 dwArgE0, Stack ptr32 dwArgE4, Stack Eq_2 dwArgF8, Stack word32 dwArg0108, Stack Eq_2 dwArg0118, Stack word32 dwArg0128, Stack ptr32 dwArg0148, Stack word32 dwArg0168, Stack word32 dwArg0188)
void ble_unsubscribe(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgBC, word32 dwArgC4, Eq_2 dwArgD8, word32 dwArgE0, ptr32 dwArgE4, Eq_2 dwArgF8, word32 dwArg0108, Eq_2 dwArg0118, word32 dwArg0128, ptr32 dwArg0148, word32 dwArg0168, word32 dwArg0188)
{
	struct Eq_274 * a0_51;
	Eq_2 a0_5 = g_t4200F4B0;
	if (a0_5 == 0x00)
		a0_51 = (struct Eq_274 *) &g_t230B9228;
	else if ((word32) g_w42017040 == 0x00)
		a0_51 = (struct Eq_274 *) &g_t230BC6EC;
	else
	{
		dwArg74 = ra;
		word32 a0_19;
		word32 s0_209;
		word32 s1_210;
		word32 a5_211;
		word32 s2_212;
		word32 s3_213;
		word32 s4_214;
		word32 s5_215;
		word32 s6_216;
		word32 mstatus_217;
		ra = bt_gatt_unsubscribe(ra, s1, a0_5, 0x4201701C, a3, s2, s3, s6, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg38, dwArg58, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC4, dwArgD8, dwArgE0, dwArgE4, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s0_209, out s1_210, out a0_19, out a3, out a5_211, out s2_212, out s3_213, out s4_214, out s5_215, out s6_216, out mstatus_217);
		if (a0_19 != 0x00)
		{
			word32 s1_218;
			word32 a0_219;
			word32 a1_220;
			word32 a2_221;
			word32 a3_222;
			word32 a4_223;
			word32 a5_224;
			word32 a7_225;
			word32 s2_226;
			word32 s3_227;
			word32 s4_228;
			word32 s5_229;
			word32 s6_230;
			word32 s7_231;
			word32 s8_232;
			word32 s9_233;
			word32 s10_234;
			word32 s11_235;
			word32 t4_236;
			printf(ra, &g_t230BC704, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_218, out a0_219, out a1_220, out a2_221, out a3_222, out a4_223, out a5_224, out a7_225, out s2_226, out s3_227, out s4_228, out s5_229, out s6_230, out s7_231, out s8_232, out s9_233, out s10_234, out s11_235, out t4_236);
			return;
		}
		a0_51 = (struct Eq_274 *) &g_t230BC724;
	}
	word32 s1_190;
	word32 a0_191;
	word32 a1_192;
	word32 a2_193;
	word32 a3_194;
	word32 a4_195;
	word32 a5_196;
	word32 a7_197;
	word32 s2_198;
	word32 s3_199;
	word32 s4_200;
	word32 s5_201;
	word32 s6_202;
	word32 s7_203;
	word32 s8_204;
	word32 s9_205;
	word32 s10_206;
	word32 s11_207;
	word32 t4_208;
	printf(ra, a0_51, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_190, out a0_191, out a1_192, out a2_193, out a3_194, out a4_195, out a5_196, out a7_197, out s2_198, out s3_199, out s4_200, out s5_201, out s6_202, out s7_203, out s8_204, out s9_205, out s10_206, out s11_207, out t4_208);
}

// 23055AA6: void write_func(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void write_func(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_54;
	word32 a0_55;
	word32 a1_56;
	word32 a2_57;
	word32 a3_58;
	word32 a4_59;
	word32 a5_60;
	word32 a7_61;
	word32 s2_62;
	word32 s3_63;
	word32 s4_64;
	word32 s5_65;
	word32 s6_66;
	word32 s7_67;
	word32 s8_68;
	word32 s9_69;
	word32 s10_70;
	word32 s11_71;
	word32 t4_72;
	Eq_2 ra_17 = printf(ra, &g_t230BCC94, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_54, out a0_55, out a1_56, out a2_57, out a3_58, out a4_59, out a5_60, out a7_61, out s2_62, out s3_63, out s4_64, out s5_65, out s6_66, out s7_67, out s8_68, out s9_69, out s10_70, out s11_71, out t4_72);
	word32 t1_73;
	word32 a0_74;
	word32 a1_75;
	word32 a2_76;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	memset(ra_17, 0x42017050, 0x00, 40, out t1_73, out a0_74, out a1_75, out a2_76, out a3_77, out a4_78, out a5_79);
}

Eq_2 g_t23055ABE = 
	{
		-0x0080
	};
// 23055ACC: void ble_exchange_mtu(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void ble_exchange_mtu(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB0, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	struct Eq_274 * a0_49;
	Eq_2 a0_5 = g_t4200F4B0;
	if (a0_5 == 0x00)
		a0_49 = (struct Eq_274 *) &g_t230B9228;
	else
	{
		g_dw23055B3A = 0x42016DD8;
		dwArg74 = ra;
		word32 a0_18;
		ra = bt_gatt_exchange_mtu(ra, s0, s1, a0_5, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB0, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out a0_18, out a3);
		if (a0_18 != 0x00)
		{
			word32 s1_215;
			word32 a0_216;
			word32 a1_217;
			word32 a2_218;
			word32 a3_219;
			word32 a4_220;
			word32 a5_221;
			word32 a7_222;
			word32 s2_223;
			word32 s3_224;
			word32 s4_225;
			word32 s5_226;
			word32 s6_227;
			word32 s7_228;
			word32 s8_229;
			word32 s9_230;
			word32 s10_231;
			word32 s11_232;
			word32 t4_233;
			printf(ra, &g_t230BC1DC, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_215, out a0_216, out a1_217, out a2_218, out a3_219, out a4_220, out a5_221, out a7_222, out s2_223, out s3_224, out s4_225, out s5_226, out s6_227, out s7_228, out s8_229, out s9_230, out s10_231, out s11_232, out t4_233);
			return;
		}
		a0_49 = (struct Eq_274 *) &g_t230BC1F8;
	}
	word32 s1_196;
	word32 a0_197;
	word32 a1_198;
	word32 a2_199;
	word32 a3_200;
	word32 a4_201;
	word32 a5_202;
	word32 a7_203;
	word32 s2_204;
	word32 s3_205;
	word32 s4_206;
	word32 s5_207;
	word32 s6_208;
	word32 s7_209;
	word32 s8_210;
	word32 s9_211;
	word32 s10_212;
	word32 s11_213;
	word32 t4_214;
	printf(ra, a0_49, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_196, out a0_197, out a1_198, out a2_199, out a3_200, out a4_201, out a5_202, out a7_203, out s2_204, out s3_205, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_212, out s11_213, out t4_214);
}

// 23055B22: void exchange_func(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void exchange_func(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	Eq_2 a3_22;
	word32 a0_116;
	word32 a4_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s10_121;
	word32 s11_122;
	Eq_2 ra_26 = bt_gatt_get_mtu(ra, a0, a3, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out a0_116, out a3_22, out a4_117, out s2_118, out s3_119, out s4_120, out s10_121, out s11_122);
	word32 s6_109;
	word32 s5_108;
	word32 s4_107;
	word32 s3_106;
	word32 s2_105;
	word32 a7_104;
	word32 a5_103;
	word32 a4_102;
	word32 a3_101;
	word32 a2_100;
	word32 a1_99;
	word32 a0_98;
	word32 s1_97;
	word32 s7_110;
	word32 s8_111;
	word32 s9_112;
	word32 s10_113;
	word32 s11_114;
	word32 t4_115;
	printf(ra_26, &g_t230BC974, a3_22, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_97, out a0_98, out a1_99, out a2_100, out a3_101, out a4_102, out a5_103, out a7_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115);
}

word32 g_dw23055B3A = 3577185834;
// 23055B54: void ble_auth_pairing_confirm(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_auth_pairing_confirm(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	Eq_2 a0_5 = g_t4200F4B0;
	if (a0_5 != 0x00)
		bt_conn_auth_pairing_confirm(a0_5);
	else
	{
		word32 s1_81;
		word32 a0_82;
		word32 a1_83;
		word32 a2_84;
		word32 a3_85;
		word32 a4_86;
		word32 a5_87;
		word32 a7_88;
		word32 s2_89;
		word32 s3_90;
		word32 s4_91;
		word32 s5_92;
		word32 s6_93;
		word32 s7_94;
		word32 s8_95;
		word32 s9_96;
		word32 s10_97;
		word32 s11_98;
		word32 t4_99;
		printf(ra, &g_t230B9228, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_81, out a0_82, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a7_88, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95, out s9_96, out s10_97, out s11_98, out t4_99);
	}
}

// 23055B6E: void ble_auth_passkey_confirm(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_auth_passkey_confirm(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	Eq_2 a0_5 = g_t4200F4B0;
	if (a0_5 != 0x00)
		bt_conn_auth_passkey_confirm(a0_5);
	else
	{
		word32 s1_81;
		word32 a0_82;
		word32 a1_83;
		word32 a2_84;
		word32 a3_85;
		word32 a4_86;
		word32 a5_87;
		word32 a7_88;
		word32 s2_89;
		word32 s3_90;
		word32 s4_91;
		word32 s5_92;
		word32 s6_93;
		word32 s7_94;
		word32 s8_95;
		word32 s9_96;
		word32 s10_97;
		word32 s11_98;
		word32 t4_99;
		printf(ra, &g_t230B9228, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_81, out a0_82, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a7_88, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95, out s9_96, out s10_97, out s11_98, out t4_99);
	}
}

// 23055B88: void ble_auth_cancel(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_auth_cancel(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	Eq_2 a0_5 = g_t4200F4B0;
	if (a0_5 != 0x00)
		bt_conn_auth_cancel(a0_5);
	else
	{
		word32 s1_81;
		word32 a0_82;
		word32 a1_83;
		word32 a2_84;
		word32 a3_85;
		word32 a4_86;
		word32 a5_87;
		word32 a7_88;
		word32 s2_89;
		word32 s3_90;
		word32 s4_91;
		word32 s5_92;
		word32 s6_93;
		word32 s7_94;
		word32 s8_95;
		word32 s9_96;
		word32 s10_97;
		word32 s11_98;
		word32 t4_99;
		printf(ra, &g_t230B9228, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_81, out a0_82, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a7_88, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95, out s9_96, out s10_97, out s11_98, out t4_99);
	}
}

