pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23055BA2: void ble_auth(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_auth(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_13;
	Eq_2 a3_9;
	if (bt_conn_auth_cb_register(0x4200DED0, out a3_9) != 0x00)
		a0_13 = (struct Eq_274 *) &g_t230BC010;
	else
		a0_13 = (struct Eq_274 *) &g_t230BC03C;
	word32 a4_64;
	word32 a5_65;
	word32 a3_63;
	word32 a2_62;
	word32 a1_61;
	word32 a0_60;
	word32 s1_59;
	word32 a7_66;
	word32 s2_67;
	word32 s3_68;
	word32 s4_69;
	word32 s5_70;
	word32 s6_71;
	word32 s7_72;
	word32 s8_73;
	word32 s9_74;
	word32 s10_75;
	word32 s11_76;
	word32 t4_77;
	printf(ra, a0_13, a3_9, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_59, out a0_60, out a1_61, out a2_62, out a3_63, out a4_64, out a5_65, out a7_66, out s2_67, out s3_68, out s4_69, out s5_70, out s6_71, out s7_72, out s8_73, out s9_74, out s10_75, out s11_76, out t4_77);
}

// 23055BCE: void ble_security(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void ble_security(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	struct Eq_274 * a0_100;
	byte bLoc11_137 = SLICE(s0, byte, 24);
	if (g_t4200F4B0 == 0x00)
		a0_100 = (struct Eq_274 *) &g_t230BC2F8;
	else
	{
		if (a2 == 0x02)
		{
			word32 a4_270;
			word32 s8_271;
			word32 a1_269;
			get_uint8_from_string(0x4200F4B0, (word32) a3 + 4, fp + ~0x10, out a0, out a1_269, out a3, out a4_270, out s8_271);
		}
		word32 a0_44;
		word32 mstatus_268;
		word32 s3_267;
		word32 s2_266;
		word32 a4_265;
		word32 s1_264;
		ra = bt_conn_set_security(ra, *a0, a0, (word32) bLoc11_137, a3, s2, s3, mstatus, dwLoc20, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1_264, out a0_44, out a3, out a4_265, out s2_266, out s3_267, out mstatus_268);
		if (a0_44 != 0x00)
		{
			word32 s1_272;
			word32 a0_273;
			word32 a1_274;
			word32 a2_275;
			word32 a3_276;
			word32 a4_277;
			word32 a5_278;
			word32 a7_279;
			word32 s2_280;
			word32 s3_281;
			word32 s4_282;
			word32 s5_283;
			word32 s6_284;
			word32 s7_285;
			word32 s8_286;
			word32 s9_287;
			word32 s10_288;
			word32 s11_289;
			word32 t4_290;
			printf(ra, &g_t230BC338, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_272, out a0_273, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278, out a7_279, out s2_280, out s3_281, out s4_282, out s5_283, out s6_284, out s7_285, out s8_286, out s9_287, out s10_288, out s11_289, out t4_290);
			return;
		}
		a0_100 = (struct Eq_274 *) &g_t230BC360;
	}
	word32 s1_291;
	word32 a0_292;
	word32 a1_293;
	word32 a2_294;
	word32 a3_295;
	word32 a4_296;
	word32 a5_297;
	word32 a7_298;
	word32 s2_299;
	word32 s3_300;
	word32 s4_301;
	word32 s5_302;
	word32 s6_303;
	word32 s7_304;
	word32 s8_305;
	word32 s9_306;
	word32 s10_307;
	word32 s11_308;
	word32 t4_309;
	printf(ra, a0_100, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_291, out a0_292, out a1_293, out a2_294, out a3_295, out a4_296, out a5_297, out a7_298, out s2_299, out s3_300, out s4_301, out s5_302, out s6_303, out s7_304, out s8_305, out s9_306, out s10_307, out s11_308, out t4_309);
}

// 23055C34: void ble_select_conn(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8)
void ble_select_conn(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8)
{
	struct Eq_274 * a0_92;
	if (a2 != 0x03)
		a0_92 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 s8_229;
		word32 a4_228;
		word32 a3_227;
		word32 a1_226;
		word32 a0_225;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + -24, out a0_225, out a1_226, out a3_227, out a4_228, out s8_229);
		word32 s3_234;
		word32 s2_233;
		word32 a3_232;
		word32 a0_231;
		word32 s1_230;
		get_bytearray_from_string(fp + -32, 0x06, dwArgF8, out s1_230, out a0_231, out a3_232, out s2_233, out s3_234);
		reverse_bytearray(fp + -32, fp + -23, 0x06);
		Eq_2 a0_61;
		Eq_2 a4_73;
		word32 s8_241;
		word32 s5_240;
		word32 s4_239;
		word32 s3_238;
		word32 s2_237;
		word32 a2_236;
		word32 s1_235;
		bt_conn_lookup_addr_le(0x00, fp + -24, mstatus, out s1_235, out a0_61, out a2_236, out a3, out a4_73, out s2_237, out s3_238, out s4_239, out s5_240, out s8_241);
		Eq_2 s1_77 = a0_61;
		if (a0_61 != 0x00)
		{
			if (g_t4200F4B0 != 0x00)
			{
				word32 a3_261;
				word32 a4_262;
				word32 a5_263;
				s1_77 = bt_conn_unref(0x4200F4B0, a3, a4_73, mstatus, out a3_261, out a4_262, out a5_263);
			}
			*s1_77 = 0x4200F4B0;
			return;
		}
		a0_92 = (struct Eq_274 *) &g_t230BC380;
	}
	word32 a1_244;
	word32 a2_245;
	word32 a0_243;
	word32 s1_242;
	word32 a3_246;
	word32 a4_247;
	word32 a5_248;
	word32 a7_249;
	word32 s2_250;
	word32 s3_251;
	word32 s4_252;
	word32 s5_253;
	word32 s6_254;
	word32 s7_255;
	word32 s8_256;
	word32 s9_257;
	word32 s10_258;
	word32 s11_259;
	word32 t4_260;
	printf(ra, a0_92, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_242, out a0_243, out a1_244, out a2_245, out a3_246, out a4_247, out a5_248, out a7_249, out s2_250, out s3_251, out s4_252, out s5_253, out s6_254, out s7_255, out s8_256, out s9_257, out s10_258, out s11_259, out t4_260);
}

