pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23055CAA: void ble_disconnect(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void ble_disconnect(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	struct Eq_274 * a0_152;
	Eq_2 dwLoc18_224;
	byte bLoc21_193 = SLICE(s0, byte, 24);
	if (a2 != 0x03)
		a0_152 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 s8_314;
		word32 a4_313;
		word32 a3_312;
		word32 a1_311;
		word32 a0_310;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + -33, out a0_310, out a1_311, out a3_312, out a4_313, out s8_314);
		word32 s1_315;
		word32 a0_316;
		word32 a3_317;
		word32 s2_318;
		word32 s3_319;
		get_bytearray_from_string(fp + -32, 0x06, dwArgE8, out s1_315, out a0_316, out a3_317, out s2_318, out s3_319);
		reverse_bytearray(fp + -32, fp + -23, 0x06);
		Eq_2 a0_63;
		Eq_2 s1_67;
		Eq_2 s2_68;
		Eq_2 s3_69;
		word32 a2_320;
		word32 a4_321;
		word32 s4_322;
		word32 s5_323;
		word32 s8_324;
		bt_conn_lookup_addr_le(0x00, fp + -24, mstatus, out s1_67, out a0_63, out a2_320, out a3, out a4_321, out s2_68, out s3_69, out s4_322, out s5_323, out s8_324);
		dwLoc18_224 = SEQ(nLoc17, (byte) (word32) bLoc21_193);
		if (a0_63 != 0x00)
		{
			struct Eq_274 * a0_111;
			word32 a0_81;
			Eq_2 s0_90;
			Eq_2 a3_93;
			ptr32 mstatus_95;
			word32 s1_325;
			word32 a4_326;
			word32 a5_327;
			word32 s2_328;
			word32 s3_329;
			word32 s4_330;
			word32 s5_331;
			Eq_2 ra_96 = bt_conn_disconnect(ra, a0_63, s1_67, a0_63, 0x13, a3, s2_68, s3_69, mstatus, dwLoc40, dwLoc3C, dwLoc38, dwLoc34, dwLoc30, dwLoc2C, dwLoc28, s0, dwLoc1C, dwLoc18_224, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg34, dwArg38, dwArg3C, a3, dwArg48, dwArg4C, dwArg54, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_90, out s1_325, out a0_81, out a3_93, out a4_326, out a5_327, out s2_328, out s3_329, out s4_330, out s5_331, out mstatus_95);
			if (a0_81 != 0x00)
				a0_111 = (struct Eq_274 *) &g_t230BC15C;
			else
				a0_111 = (struct Eq_274 *) &g_t230BC174;
			Eq_2 a3_124;
			Eq_2 a4_125;
			word32 s1_351;
			word32 a0_352;
			word32 a1_353;
			word32 a2_354;
			word32 a5_355;
			word32 a7_356;
			word32 s2_357;
			word32 s3_358;
			word32 s4_359;
			word32 s5_360;
			word32 s6_361;
			word32 s7_362;
			word32 s8_363;
			word32 s9_364;
			word32 s10_365;
			word32 s11_366;
			word32 t4_367;
			printf(ra_96, a0_111, a3_93, dwLoc38, dwLoc18_224, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_351, out a0_352, out a1_353, out a2_354, out a3_124, out a4_125, out a5_355, out a7_356, out s2_357, out s3_358, out s4_359, out s5_360, out s6_361, out s7_362, out s8_363, out s9_364, out s10_365, out s11_366, out t4_367);
			word32 a3_368;
			word32 a4_369;
			word32 a5_370;
			bt_conn_unref(s0_90, a3_124, a4_125, mstatus_95, out a3_368, out a4_369, out a5_370);
			return;
		}
		a0_152 = (struct Eq_274 *) &g_t230B9228;
	}
	word32 s1_332;
	word32 a0_333;
	word32 a1_334;
	word32 a2_335;
	word32 a3_336;
	word32 a4_337;
	word32 a5_338;
	word32 a7_339;
	word32 s2_340;
	word32 s3_341;
	word32 s4_342;
	word32 s5_343;
	word32 s6_344;
	word32 s7_345;
	word32 s8_346;
	word32 s9_347;
	word32 s10_348;
	word32 s11_349;
	word32 t4_350;
	printf(ra, a0_152, a3, dwLoc38, dwLoc18_224, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_332, out a0_333, out a1_334, out a2_335, out a3_336, out a4_337, out a5_338, out a7_339, out s2_340, out s3_341, out s4_342, out s5_343, out s6_344, out s7_345, out s8_346, out s9_347, out s10_348, out s11_349, out t4_350);
}

// 23055D3C: void ble_connect(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register word32 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
void ble_connect(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, Eq_2 a4, word32 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0128)
{
	struct Eq_274 * a0_155;
	word24 nLoc1F_255 = SLICE(s2, word24, 8);
	word32 a4_301;
	word32 a5_302;
	word32 a1_299;
	word32 a2_300;
	word32 t1_297;
	word32 a0_298;
	Eq_2 a3_126;
	Eq_2 ra_133 = memset(ra, fp + -40, 0x00, 0x06, out t1_297, out a0_298, out a1_299, out a2_300, out a3_126, out a4_301, out a5_302);
	if (a2 != 0x03)
		a0_155 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 s8_307;
		word32 a4_306;
		word32 a3_305;
		word32 a0_303;
		word32 a1_304;
		get_uint8_from_string(a3, (word32) a3 + 4, fp + -41, out a0_303, out a1_304, out a3_305, out a4_306, out s8_307);
		word32 s3_311;
		word32 s2_310;
		word32 a0_309;
		word32 s1_308;
		Eq_2 a3_60;
		Eq_2 s0_65 = get_bytearray_from_string(fp + -40, 0x06, dwArgF8, out s1_308, out a0_309, out a3_60, out s2_310, out s3_311);
		Eq_2 s2_103 = 0x230BC000;
		Eq_2 dwLoc2C_224 = SEQ(~0x00, nLoc2C);
		Eq_2 dwLoc20_256 = SEQ(nLoc1F_255, ~0x00);
		do
		{
			s0_65 = (word32) s0_65 + 1;
			Eq_2 s1_100;
			word32 t4_327;
			word32 s11_326;
			word32 s10_325;
			word32 s9_324;
			word32 s8_323;
			word32 s7_322;
			word32 s6_321;
			word32 s5_320;
			word32 s4_319;
			word32 s3_318;
			word32 a7_317;
			word32 a5_316;
			word32 a4_315;
			word32 a2_314;
			word32 a1_313;
			word32 a0_312;
			ra_133 = printf(ra_133, (word32) s2_103 + 0x00C4, a3_60, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_100, out a0_312, out a1_313, out a2_314, out a3_60, out a4_315, out a5_316, out a7_317, out s2_103, out s3_318, out s4_319, out s5_320, out s6_321, out s7_322, out s8_323, out s9_324, out s10_325, out s11_326, out t4_327);
		} while (s0_65 != s1_100);
		reverse_bytearray(fp + -40, fp + -31, 0x06);
		word32 a0_123;
		ra_133 = bt_conn_create_le(ra_133, s0_65, s1_100, fp + -32, fp + -24, s2_103, mstatus, dwLoc30, dwLoc2C_224, dwLoc28, a4, dwLoc20_256, s0, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out a0_123, out a3_126);
		if (a0_123 == 0x00)
			a0_155 = (struct Eq_274 *) &g_t230BC0D8;
		else
			a0_155 = (struct Eq_274 *) &g_t230BC0EC;
	}
	word32 a3_332;
	word32 a2_331;
	word32 a1_330;
	word32 a0_329;
	word32 s1_328;
	word32 a4_333;
	word32 a5_334;
	word32 a7_335;
	word32 s2_336;
	word32 s3_337;
	word32 s4_338;
	word32 s5_339;
	word32 s6_340;
	word32 s7_341;
	word32 s8_342;
	word32 s9_343;
	word32 s10_344;
	word32 s11_345;
	word32 t4_346;
	printf(ra_133, a0_155, a3_126, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_328, out a0_329, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334, out a7_335, out s2_336, out s3_337, out s4_338, out s5_339, out s6_340, out s7_341, out s8_342, out s9_343, out s10_344, out s11_345, out t4_346);
	0x00 = dwArg0128;
}

