pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23055DF2: void ble_stop_advertise(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void ble_stop_advertise(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	struct Eq_274 * a0_39;
	Eq_2 a3_12;
	word32 a0_37;
	word32 s5_121;
	word32 s1_115;
	word32 a4_116;
	word32 a5_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s6_122;
	word32 s7_123;
	word32 s8_124;
	word32 s9_125;
	word32 mstatus_126;
	Eq_2 ra_18 = bt_le_adv_stop(ra, s0, a3, a4, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg54, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s1_115, out a0_37, out a3_12, out a4_116, out a5_117, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s7_123, out s8_124, out s9_125, out mstatus_126);
	if (a0_37 != 0x00)
		a0_39 = (struct Eq_274 *) &g_t230BC618;
	else
		a0_39 = (struct Eq_274 *) &g_t230BC638;
	word32 s1_127;
	word32 a0_128;
	word32 a1_129;
	word32 a2_130;
	word32 a3_131;
	word32 a4_132;
	word32 a5_133;
	word32 a7_134;
	word32 s2_135;
	word32 s3_136;
	word32 s4_137;
	word32 s5_138;
	word32 s6_139;
	word32 s7_140;
	word32 s8_141;
	word32 s9_142;
	word32 s10_143;
	word32 s11_144;
	word32 t4_145;
	printf(ra_18, a0_39, a3_12, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_127, out a0_128, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out a7_134, out s2_135, out s3_136, out s4_137, out s5_138, out s6_139, out s7_140, out s8_141, out s9_142, out s10_143, out s11_144, out t4_145);
}

// 23055E16: void ble_get_device_name(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_get_device_name(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	if (bt_get_name() == 0x00)
	{
		word32 s1_110;
		word32 a0_111;
		word32 a1_112;
		word32 a2_113;
		word32 a3_114;
		word32 a4_115;
		word32 a5_116;
		word32 a7_117;
		word32 s2_118;
		word32 s3_119;
		word32 s4_120;
		word32 s5_121;
		word32 s6_122;
		word32 s7_123;
		word32 s8_124;
		word32 s9_125;
		word32 s10_126;
		word32 s11_127;
		word32 t4_128;
		printf(ra, &g_t230BC278, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_110, out a0_111, out a1_112, out a2_113, out a3_114, out a4_115, out a5_116, out a7_117, out s2_118, out s3_119, out s4_120, out s5_121, out s6_122, out s7_123, out s8_124, out s9_125, out s10_126, out s11_127, out t4_128);
	}
	else
	{
		word32 s1_91;
		word32 a0_92;
		word32 a1_93;
		word32 a2_94;
		word32 a3_95;
		word32 a4_96;
		word32 a5_97;
		word32 a7_98;
		word32 s2_99;
		word32 s3_100;
		word32 s4_101;
		word32 s5_102;
		word32 s6_103;
		word32 s7_104;
		word32 s8_105;
		word32 s9_106;
		word32 s10_107;
		word32 s11_108;
		word32 t4_109;
		printf(ra, &g_t230BC264, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_91, out a0_92, out a1_93, out a2_94, out a3_95, out a4_96, out a5_97, out a7_98, out s2_99, out s3_100, out s4_101, out s5_102, out s6_103, out s7_104, out s8_105, out s9_106, out s10_107, out s11_108, out t4_109);
	}
}

// 23055E42: void ble_start_advertise(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack word32 dwArgCC, Stack ptr32 dwArg0124)
void ble_start_advertise(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a2, Eq_2 a3, word32 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, word32 dwArgCC, ptr32 dwArg0124)
{
	struct Eq_274 * a0_127;
	byte bLoc2A_385 = SLICE(s4, byte, 16);
	byte bLoc29_395 = SLICE(s4, byte, 24);
	if ((a2 + -3 & ~0x02) != 0x00)
	{
		a0_127 = (struct Eq_274 *) &g_t230B67B4;
		goto l23055E60;
	}
	cui16 wLoc28_527;
	word32 a5_72;
	Eq_2 a3_32;
	word32 a1_655;
	word32 a0_654;
	word32 a4_656;
	word32 s8_657;
	Eq_2 s0_37 = get_uint8_from_string(s0, (word32) a3 + 4, fp + -42, out a0_654, out a1_655, out a3_32, out a4_656, out s8_657);
	word32 s2_56;
	word32 t4_674;
	word32 s10_672;
	word32 s11_673;
	word32 s8_670;
	word32 s9_671;
	word32 s7_669;
	word32 s6_668;
	word32 s5_667;
	word32 s4_666;
	word32 s3_665;
	word32 a7_664;
	word32 a1_660;
	word32 a2_661;
	word32 a4_662;
	word32 a5_663;
	word32 s1_658;
	word32 a0_659;
	ra = printf(ra, &g_t230BC52C, a3_32, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_658, out a0_659, out a1_660, out a2_661, out a3, out a4_662, out a5_663, out a7_664, out s2_56, out s3_665, out s4_666, out s5_667, out s6_668, out s7_669, out s8_670, out s9_671, out s10_672, out s11_673, out t4_674);
	word32 a5_66 = (word32) bLoc2A_385;
	if (a5_66 == 0x00)
		a5_72 = 11;
	else
	{
		if (a5_66 != 0x01)
		{
			if (a5_66 != 0x02)
			{
				a0_127 = (struct Eq_274 *) &g_t230BC53C;
				goto l23055E60;
			}
			wLoc28_527 = 0x00;
l23055EA8:
			Eq_2 a3_87;
			word32 a0_771;
			word32 a1_772;
			word32 a4_773;
			word32 s8_774;
			get_uint8_from_string(s0_37, s2_56 + 8, fp + -41, out a0_771, out a1_772, out a3_87, out a4_773, out s8_774);
			word32 s3_115;
			word32 s10_785;
			word32 s11_786;
			word32 t4_787;
			word32 a7_781;
			word32 s4_782;
			word32 s6_783;
			word32 s9_784;
			word32 a0_776;
			word32 a1_777;
			word32 a2_778;
			word32 a4_779;
			word32 a5_780;
			word32 s1_775;
			Eq_2 s2_114;
			Eq_2 s7_119;
			Eq_2 s5_117;
			Eq_2 s8_120;
			ra = printf(ra, &g_t230BC550, a3_87, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_775, out a0_776, out a1_777, out a2_778, out a3, out a4_779, out a5_780, out a7_781, out s2_114, out s3_115, out s4_782, out s5_117, out s6_783, out s7_119, out s8_120, out s9_784, out s10_785, out s11_786, out t4_787);
			up32 a5_124 = (word32) bLoc29_395;
			if (a5_124 <= 0x02)
			{
				struct Eq_309798 * a5_135;
				Eq_2 dwLoc34_467;
				word32 s1_128 = 0x4200E000;
				Eq_2 s0_129 = 0x4200DEC0;
				if (a5_124 == 0x00)
				{
					g_w4200DEC0 = 0x0101;
					a5_135 = fp + -52;
					dwLoc34_467 = SEQ(nLoc33, 0x06);
				}
				else if (a5_124 == 0x01)
				{
					g_w4200DEC0 = 0x0101;
					a5_135 = fp + -48;
				}
				else
				{
					g_w4200DEC0 = 0x0101;
					a5_135 = fp + -44;
				}
				Eq_2 dwLoc28_531;
				a5_135->dw0004 = 0x4200DEC0;
				Eq_2 a0_149 = bt_get_name();
				word32 a3_737;
				word32 a4_738;
				word32 a5_739;
				word32 a1_735;
				word32 a2_736;
				Eq_2 a0_151 = strlen(a0_149, out a1_735, out a2_736, out a3_737, out a4_738, out a5_739);
				g_b4200DEC8 = 0x09;
				g_b4200DEC9 = (byte) a0_151;
				g_t4200DECC = a0_149;
				if (s3_115 == 0x05)
				{
					Eq_2 a3_184;
					word32 a2_681;
					word32 a4_682;
					word32 a5_683;
					word32 a2_676;
					word32 a3_677;
					word32 a4_678;
					word32 a5_679;
					word32 a0_680;
					word32 a0_675;
					s0_129 = get_uint16_from_string(get_uint16_from_string(0x4200DEC0, (word32) s2_114 + 0x0C, fp + -38, out a0_675, out a2_676, out a3_677, out a4_678, out a5_679), (word32) s2_114 + 16, fp + -36, out a0_680, out a2_681, out a3_184, out a4_682, out a5_683);
					Eq_2 a3_202;
					word32 s9_712;
					word32 s10_713;
					word32 s11_714;
					word32 t4_715;
					word32 s4_710;
					word32 s6_711;
					word32 a3_705;
					word32 a4_706;
					word32 a5_707;
					word32 a7_708;
					word32 s3_709;
					word32 s11_700;
					word32 t4_701;
					word32 a0_702;
					word32 a1_703;
					word32 a2_704;
					word32 s7_696;
					word32 s8_697;
					word32 s9_698;
					word32 s10_699;
					word32 s2_691;
					word32 s3_692;
					word32 s4_693;
					word32 s5_694;
					word32 s6_695;
					word32 a1_686;
					word32 a2_687;
					word32 a4_688;
					word32 a5_689;
					word32 a7_690;
					word32 s1_684;
					word32 a0_685;
					ra = printf(printf(ra, &g_t230BC570, a3_184, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_684, out a0_685, out a1_686, out a2_687, out a3_202, out a4_688, out a5_689, out a7_690, out s2_691, out s3_692, out s4_693, out s5_694, out s6_695, out s7_696, out s8_697, out s9_698, out s10_699, out s11_700, out t4_701), &g_t230BC584, a3_202, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_128, out a0_702, out a1_703, out a2_704, out a3_705, out a4_706, out a5_707, out a7_708, out s2_114, out s3_709, out s4_710, out s5_117, out s6_711, out s7_119, out s8_120, out s9_712, out s10_713, out s11_714, out t4_715);
					dwLoc28_531 = SEQ(0xA0, wLoc28_527);
				}
				Eq_2 a3_249;
				if ((word32) bLoc2A_385 <= 0x01)
					a3_249 = s1_128 + -320;
				else
					a3_249.u0 = 0x00;
				word32 a0_282;
				word32 s6_766;
				word32 s7_767;
				word32 s8_768;
				word32 s9_769;
				word32 mstatus_770;
				word32 s3_764;
				word32 s5_765;
				word32 a4_762;
				word32 s2_763;
				word32 s0_759;
				word32 s1_760;
				word32 a1_761;
				ra = bt_le_adv_start(ra, s0_129, fp + -40, a3_249, s2_114, s5_117, s7_119, s8_120, mstatus, dwLoc3C, dwLoc38, dwLoc34_467, dwLoc28_531, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwLoc04, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArg0124, out s0_759, out s1_760, out a0_282, out a1_761, out a3, out a4_762, out s2_763, out s3_764, out s5_765, out s6_766, out s7_767, out s8_768, out s9_769, out mstatus_770);
				if (a0_282 != 0x00)
				{
					word32 s10_732;
					word32 s11_733;
					word32 t4_734;
					word32 s5_727;
					word32 s6_728;
					word32 s7_729;
					word32 s8_730;
					word32 s9_731;
					word32 a5_722;
					word32 a7_723;
					word32 s2_724;
					word32 s3_725;
					word32 s4_726;
					word32 a0_717;
					word32 a1_718;
					word32 a2_719;
					word32 a3_720;
					word32 a4_721;
					word32 s1_716;
					printf(ra, &g_t230BC598, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_716, out a0_717, out a1_718, out a2_719, out a3_720, out a4_721, out a5_722, out a7_723, out s2_724, out s3_725, out s4_726, out s5_727, out s6_728, out s7_729, out s8_730, out s9_731, out s10_732, out s11_733, out t4_734);
					return;
				}
				a0_127 = (struct Eq_274 *) &g_t230BC5C0;
			}
			else
				a0_127 = (struct Eq_274 *) &g_t230BC55C;
l23055E60:
			word32 s11_757;
			word32 t4_758;
			word32 s6_752;
			word32 s7_753;
			word32 s8_754;
			word32 s9_755;
			word32 s10_756;
			word32 a7_747;
			word32 s2_748;
			word32 s3_749;
			word32 s4_750;
			word32 s5_751;
			word32 a1_742;
			word32 a2_743;
			word32 a3_744;
			word32 a4_745;
			word32 a5_746;
			word32 s1_740;
			word32 a0_741;
			printf(ra, a0_127, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_740, out a0_741, out a1_742, out a2_743, out a3_744, out a4_745, out a5_746, out a7_747, out s2_748, out s3_749, out s4_750, out s5_751, out s6_752, out s7_753, out s8_754, out s9_755, out s10_756, out s11_757, out t4_758);
			return;
		}
		a5_72 = 0x08;
	}
	wLoc28_527 = SEQ((byte) a5_72, 0x00);
	goto l23055EA8;
}

// 23055FDE: void ble_set_adv_channel(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void ble_set_adv_channel(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	struct Eq_274 * a0_31;
	if (a2 != 0x02)
		a0_31 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 a1_87;
		word32 a0_86;
		word32 a4_88;
		word32 s8_89;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + ~0x10, out a0_86, out a1_87, out a3, out a4_88, out s8_89);
		if (set_adv_channel_map(0x07) == 0x00)
			a0_31 = (struct Eq_274 *) &g_t230BC3A0;
		else
			a0_31 = (struct Eq_274 *) &g_t230BC3BC;
	}
	word32 s1_90;
	word32 a0_91;
	word32 a1_92;
	word32 a2_93;
	word32 a3_94;
	word32 a4_95;
	word32 a5_96;
	word32 a7_97;
	word32 s2_98;
	word32 s3_99;
	word32 s4_100;
	word32 s5_101;
	word32 s6_102;
	word32 s7_103;
	word32 s8_104;
	word32 s9_105;
	word32 s10_106;
	word32 s11_107;
	word32 t4_108;
	printf(ra, a0_31, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_90, out a0_91, out a1_92, out a2_93, out a3_94, out a4_95, out a5_96, out a7_97, out s2_98, out s3_99, out s4_100, out s5_101, out s6_102, out s7_103, out s8_104, out s9_105, out s10_106, out s11_107, out t4_108);
}

// 2305602A: void ble_stop_scan(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void ble_stop_scan(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	word32 a0_12;
	Eq_2 a3_15;
	word32 s6_170;
	word32 s5_169;
	word32 s4_168;
	word32 s3_167;
	word32 s2_166;
	word32 a4_165;
	word32 s1_164;
	word32 s7_171;
	word32 s8_172;
	word32 s9_173;
	word32 mstatus_174;
	Eq_2 ra_25 = bt_le_scan_stop(ra, s0, a3, a4, s2, s3, mstatus, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg44, dwArg48, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s1_164, out a0_12, out a3_15, out a4_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out mstatus_174);
	if (a0_12 == 0x00)
	{
		word32 s1_194;
		word32 a0_195;
		word32 a1_196;
		word32 a2_197;
		word32 a3_198;
		word32 a4_199;
		word32 a5_200;
		word32 a7_201;
		word32 s2_202;
		word32 s3_203;
		word32 s4_204;
		word32 s5_205;
		word32 s6_206;
		word32 s7_207;
		word32 s8_208;
		word32 s9_209;
		word32 s10_210;
		word32 s11_211;
		word32 t4_212;
		printf(ra_25, &g_t230BC674, a3_15, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_194, out a0_195, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200, out a7_201, out s2_202, out s3_203, out s4_204, out s5_205, out s6_206, out s7_207, out s8_208, out s9_209, out s10_210, out s11_211, out t4_212);
	}
	else
	{
		word32 s1_175;
		word32 a0_176;
		word32 a1_177;
		word32 a2_178;
		word32 a3_179;
		word32 a4_180;
		word32 a5_181;
		word32 a7_182;
		word32 s2_183;
		word32 s3_184;
		word32 s4_185;
		word32 s5_186;
		word32 s6_187;
		word32 s7_188;
		word32 s8_189;
		word32 s9_190;
		word32 s10_191;
		word32 s11_192;
		word32 t4_193;
		printf(ra_25, &g_t230BC650, a3_15, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_175, out a0_176, out a1_177, out a2_178, out a3_179, out a4_180, out a5_181, out a7_182, out s2_183, out s3_184, out s4_185, out s5_186, out s6_187, out s7_188, out s8_189, out s9_190, out s10_191, out s11_192, out t4_193);
	}
}

// 23056056: void ble_disable(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void ble_disable(Eq_2 ra, Eq_2 s0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	struct Eq_274 * a0_38;
	word32 a0_9;
	Eq_2 a3_14;
	Eq_2 ra_19 = bt_disable(ra, s0, a4, mstatus, dwLoc08, dwArg08, dwArg14, dwArg40, dwArg44, dwArg48, dwArg50, dwArg54, dwArg68, ra, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out a0_9, out a3_14);
	if (a0_9 != 0x00)
		a0_38 = (struct Eq_274 *) &g_t230BC104;
	else
		a0_38 = (struct Eq_274 *) &g_t230BC140;
	word32 a5_121;
	word32 s1_115;
	word32 a0_116;
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	word32 a7_122;
	word32 s2_123;
	word32 s3_124;
	word32 s4_125;
	word32 s5_126;
	word32 s6_127;
	word32 s7_128;
	word32 s8_129;
	word32 s9_130;
	word32 s10_131;
	word32 s11_132;
	word32 t4_133;
	printf(ra_19, a0_38, a3_14, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_115, out a0_116, out a1_117, out a2_118, out a3_119, out a4_120, out a5_121, out a7_122, out s2_123, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129, out s9_130, out s10_131, out s11_132, out t4_133);
}

