pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305607A: void discover_func(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a0, Register word32 a1, Register (ptr32 Eq_310492) a2, Register Eq_2 a3, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg7C, Stack word32 dwArgE8)
void discover_func(Eq_2 ra, Eq_2 s1, byte * a0, word32 a1, struct Eq_310492 * a2, Eq_2 a3, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg7C, word32 dwArgE8)
{
	if (a1 != 0x00)
	{
		up32 a5_13 = (word32) a2->b0028;
		if (a5_13 == 0x02)
		{
			struct Eq_310571 * s1_31;
			word32 s2_868;
			word32 a7_867;
			word32 a5_866;
			word32 a4_865;
			word32 a3_864;
			word32 a2_863;
			word32 a1_862;
			word32 a3_859;
			word32 s1_860;
			word32 a0_861;
			word32 s3_869;
			word32 s4_870;
			word32 s5_871;
			word32 s6_872;
			word32 s7_873;
			word32 s8_874;
			word32 s9_875;
			word32 s10_876;
			word32 s11_877;
			word32 t4_878;
			printf(bt_uuid_to_str(ra, a0, fp + -56, 37, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s1_31, out a3_859), &g_t230BC914, (word32) s1_31->w0004, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_860, out a0_861, out a1_862, out a2_863, out a3_864, out a4_865, out a5_866, out a7_867, out s2_868, out s3_869, out s4_870, out s5_871, out s6_872, out s7_873, out s8_874, out s9_875, out s10_876, out s11_877, out t4_878);
		}
		else if (a5_13 < 0x02)
		{
			struct Eq_310630 * s1_91;
			word32 a3_879;
			word32 s1_880;
			word32 a0_881;
			word32 a1_882;
			word32 a2_883;
			word32 a3_884;
			word32 a4_885;
			word32 a5_886;
			word32 a7_887;
			word32 s2_888;
			word32 s3_889;
			word32 s4_890;
			word32 s5_891;
			word32 s6_892;
			word32 s7_893;
			word32 s8_894;
			word32 s9_895;
			word32 s10_896;
			word32 s11_897;
			word32 t4_898;
			printf(bt_uuid_to_str(ra, a0, fp + -56, 37, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s1_91, out a3_879), &g_t230BC824, (word32) s1_91->w0004, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_880, out a0_881, out a1_882, out a2_883, out a3_884, out a4_885, out a5_886, out a7_887, out s2_888, out s3_889, out s4_890, out s5_891, out s6_892, out s7_893, out s8_894, out s9_895, out s10_896, out s11_897, out t4_898);
		}
		else if (a5_13 == 0x03)
		{
			struct Eq_310686 * s1_151;
			Eq_2 a3_180;
			struct Eq_310688 * s1_184;
			word32 a3_899;
			word32 a0_900;
			word32 a1_901;
			word32 a2_902;
			word32 a4_903;
			word32 a5_904;
			word32 a7_905;
			word32 s2_906;
			word32 s3_907;
			word32 s4_908;
			word32 s5_909;
			word32 s6_910;
			word32 s7_911;
			word32 s8_912;
			word32 s9_913;
			word32 s10_914;
			word32 s11_915;
			word32 t4_916;
			Eq_2 ra_183 = printf(bt_uuid_to_str(ra, a0, fp + -56, 37, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s1_151, out a3_899), &g_t230BC858, (word32) s1_151->w0004, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_184, out a0_900, out a1_901, out a2_902, out a3_180, out a4_903, out a5_904, out a7_905, out s2_906, out s3_907, out s4_908, out s5_909, out s6_910, out s7_911, out s8_912, out s9_913, out s10_914, out s11_915, out t4_916);
			ui32 s0_198 = (word32) s1_184->b0006;
			word32 s1_917;
			word32 a0_918;
			word32 a1_919;
			word32 a2_920;
			word32 a4_921;
			word32 a5_922;
			word32 a7_923;
			word32 s2_924;
			word32 s3_925;
			word32 s4_926;
			word32 s5_927;
			word32 s6_928;
			word32 s7_929;
			word32 s8_930;
			word32 s9_931;
			word32 s10_932;
			word32 s11_933;
			word32 t4_934;
			Eq_2 a3_205;
			Eq_2 ra_208 = printf(ra_183, &g_t230BC898, a3_180, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_917, out a0_918, out a1_919, out a2_920, out a3_205, out a4_921, out a5_922, out a7_923, out s2_924, out s3_925, out s4_926, out s5_927, out s6_928, out s7_929, out s8_930, out s9_931, out s10_932, out s11_933, out t4_934);
			if ((s0_198 & 1) != 0x00)
			{
				word32 s1_955;
				word32 a0_956;
				word32 a1_957;
				word32 a2_958;
				word32 a4_959;
				word32 a5_960;
				word32 a7_961;
				word32 s2_962;
				word32 s3_963;
				word32 s4_964;
				word32 s5_965;
				word32 s6_966;
				word32 s7_967;
				word32 s8_968;
				word32 s9_969;
				word32 s10_970;
				word32 s11_971;
				word32 t4_972;
				ra_208 = printf(ra_208, &g_t230BC8A8, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_955, out a0_956, out a1_957, out a2_958, out a3_205, out a4_959, out a5_960, out a7_961, out s2_962, out s3_963, out s4_964, out s5_965, out s6_966, out s7_967, out s8_968, out s9_969, out s10_970, out s11_971, out t4_972);
			}
			if ((s0_198 & 2) != 0x00)
			{
				word32 s1_973;
				word32 a0_974;
				word32 a1_975;
				word32 a2_976;
				word32 a4_977;
				word32 a5_978;
				word32 a7_979;
				word32 s2_980;
				word32 s3_981;
				word32 s4_982;
				word32 s5_983;
				word32 s6_984;
				word32 s7_985;
				word32 s8_986;
				word32 s9_987;
				word32 s10_988;
				word32 s11_989;
				word32 t4_990;
				ra_208 = printf(ra_208, &g_t230BC8B4, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_973, out a0_974, out a1_975, out a2_976, out a3_205, out a4_977, out a5_978, out a7_979, out s2_980, out s3_981, out s4_982, out s5_983, out s6_984, out s7_985, out s8_986, out s9_987, out s10_988, out s11_989, out t4_990);
			}
			if ((s0_198 & 8) != 0x00)
			{
				word32 s1_991;
				word32 a0_992;
				word32 a1_993;
				word32 a2_994;
				word32 a4_995;
				word32 a5_996;
				word32 a7_997;
				word32 s2_998;
				word32 s3_999;
				word32 s4_1000;
				word32 s5_1001;
				word32 s6_1002;
				word32 s7_1003;
				word32 s8_1004;
				word32 s9_1005;
				word32 s10_1006;
				word32 s11_1007;
				word32 t4_1008;
				ra_208 = printf(ra_208, &g_t230BC8C0, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_991, out a0_992, out a1_993, out a2_994, out a3_205, out a4_995, out a5_996, out a7_997, out s2_998, out s3_999, out s4_1000, out s5_1001, out s6_1002, out s7_1003, out s8_1004, out s9_1005, out s10_1006, out s11_1007, out t4_1008);
			}
			if ((s0_198 & 4) != 0x00)
			{
				word32 s1_1009;
				word32 a0_1010;
				word32 a1_1011;
				word32 a2_1012;
				word32 a4_1013;
				word32 a5_1014;
				word32 a7_1015;
				word32 s2_1016;
				word32 s3_1017;
				word32 s4_1018;
				word32 s5_1019;
				word32 s6_1020;
				word32 s7_1021;
				word32 s8_1022;
				word32 s9_1023;
				word32 s10_1024;
				word32 s11_1025;
				word32 t4_1026;
				ra_208 = printf(ra_208, &g_t230BC8CC, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1009, out a0_1010, out a1_1011, out a2_1012, out a3_205, out a4_1013, out a5_1014, out a7_1015, out s2_1016, out s3_1017, out s4_1018, out s5_1019, out s6_1020, out s7_1021, out s8_1022, out s9_1023, out s10_1024, out s11_1025, out t4_1026);
			}
			if ((s0_198 & 16) != 0x00)
			{
				word32 s1_1027;
				word32 a0_1028;
				word32 a1_1029;
				word32 a2_1030;
				word32 a4_1031;
				word32 a5_1032;
				word32 a7_1033;
				word32 s2_1034;
				word32 s3_1035;
				word32 s4_1036;
				word32 s5_1037;
				word32 s6_1038;
				word32 s7_1039;
				word32 s8_1040;
				word32 s9_1041;
				word32 s10_1042;
				word32 s11_1043;
				word32 t4_1044;
				ra_208 = printf(ra_208, &g_t230BC8E0, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1027, out a0_1028, out a1_1029, out a2_1030, out a3_205, out a4_1031, out a5_1032, out a7_1033, out s2_1034, out s3_1035, out s4_1036, out s5_1037, out s6_1038, out s7_1039, out s8_1040, out s9_1041, out s10_1042, out s11_1043, out t4_1044);
			}
			if ((s0_198 & 32) != 0x00)
			{
				word32 s1_1045;
				word32 a0_1046;
				word32 a1_1047;
				word32 a2_1048;
				word32 a4_1049;
				word32 a5_1050;
				word32 a7_1051;
				word32 s2_1052;
				word32 s3_1053;
				word32 s4_1054;
				word32 s5_1055;
				word32 s6_1056;
				word32 s7_1057;
				word32 s8_1058;
				word32 s9_1059;
				word32 s10_1060;
				word32 s11_1061;
				word32 t4_1062;
				ra_208 = printf(ra_208, &g_t230BC8EC, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1045, out a0_1046, out a1_1047, out a2_1048, out a3_205, out a4_1049, out a5_1050, out a7_1051, out s2_1052, out s3_1053, out s4_1054, out s5_1055, out s6_1056, out s7_1057, out s8_1058, out s9_1059, out s10_1060, out s11_1061, out t4_1062);
			}
			if ((s0_198 & 64) != 0x00)
			{
				word32 s1_1063;
				word32 a0_1064;
				word32 a1_1065;
				word32 a2_1066;
				word32 a4_1067;
				word32 a5_1068;
				word32 a7_1069;
				word32 s2_1070;
				word32 s3_1071;
				word32 s4_1072;
				word32 s5_1073;
				word32 s6_1074;
				word32 s7_1075;
				word32 s8_1076;
				word32 s9_1077;
				word32 s10_1078;
				word32 s11_1079;
				word32 t4_1080;
				ra_208 = printf(ra_208, &g_t230BC8F8, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1063, out a0_1064, out a1_1065, out a2_1066, out a3_205, out a4_1067, out a5_1068, out a7_1069, out s2_1070, out s3_1071, out s4_1072, out s5_1073, out s6_1074, out s7_1075, out s8_1076, out s9_1077, out s10_1078, out s11_1079, out t4_1080);
			}
			if ((int32) (byte) s0_198 < 0x00)
			{
				word32 s1_1081;
				word32 a0_1082;
				word32 a1_1083;
				word32 a2_1084;
				word32 a3_1085;
				word32 a4_1086;
				word32 a5_1087;
				word32 a7_1088;
				word32 s2_1089;
				word32 s3_1090;
				word32 s4_1091;
				word32 s5_1092;
				word32 s6_1093;
				word32 s7_1094;
				word32 s8_1095;
				word32 s9_1096;
				word32 s10_1097;
				word32 s11_1098;
				word32 t4_1099;
				printf(ra_208, &g_t230BC904, a3_205, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_1081, out a0_1082, out a1_1083, out a2_1084, out a3_1085, out a4_1086, out a5_1087, out a7_1088, out s2_1089, out s3_1090, out s4_1091, out s5_1092, out s6_1093, out s7_1094, out s8_1095, out s9_1096, out s10_1097, out s11_1098, out t4_1099);
			}
		}
		else
		{
			Eq_2 a3_465;
			word32 s1_935;
			word32 s1_936;
			word32 a0_937;
			word32 a1_938;
			word32 a2_939;
			word32 a3_940;
			word32 a4_941;
			word32 a5_942;
			word32 a7_943;
			word32 s2_944;
			word32 s3_945;
			word32 s4_946;
			word32 s5_947;
			word32 s6_948;
			word32 s7_949;
			word32 s8_950;
			word32 s9_951;
			word32 s10_952;
			word32 s11_953;
			word32 t4_954;
			printf(bt_uuid_to_str(ra, a0, fp + -56, 37, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s1_935, out a3_465), &g_t230BC944, a3_465, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_936, out a0_937, out a1_938, out a2_939, out a3_940, out a4_941, out a5_942, out a7_943, out s2_944, out s3_945, out s4_946, out s5_947, out s6_948, out s7_949, out s8_950, out s9_951, out s10_952, out s11_953, out t4_954);
		}
	}
	else
	{
		Eq_2 s1_529;
		word32 a2_855;
		word32 a3_856;
		word32 a4_857;
		word32 a5_858;
		word32 s9_848;
		word32 s10_849;
		word32 s11_850;
		word32 t4_851;
		word32 t1_852;
		word32 a0_853;
		word32 a1_854;
		word32 s2_841;
		word32 s3_842;
		word32 s4_843;
		word32 s5_844;
		word32 s6_845;
		word32 s7_846;
		word32 s8_847;
		word32 a0_834;
		word32 a1_835;
		word32 a2_836;
		word32 a3_837;
		word32 a4_838;
		word32 a5_839;
		word32 a7_840;
		memset(printf(ra, &g_t230BC810, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_529, out a0_834, out a1_835, out a2_836, out a3_837, out a4_838, out a5_839, out a7_840, out s2_841, out s3_842, out s4_843, out s5_844, out s6_845, out s7_846, out s8_847, out s9_848, out s10_849, out s11_850, out t4_851), s1_529, 0x00, 44, out t1_852, out a0_853, out a1_854, out a2_855, out a3_856, out a4_857, out a5_858);
	}
}

