pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
word32 g_dw23056096 = 0x458102C0;
// 230561FE: void ble_set_data_len(Register Eq_2 ra, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148)
void ble_set_data_len(Eq_2 ra, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148)
{
	struct Eq_274 * a0_107;
	if (a2 != 0x03)
		a0_107 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		Eq_2 s0_11 = *(union Eq_2 *) 0x03;
		if (false)
			a0_107 = (struct Eq_274 *) &g_t230B9228;
		else
		{
			word32 a3_19;
			Eq_2 a3_34;
			Eq_2 a4_35;
			Eq_2 a5_36;
			word32 a0_227;
			word32 a2_228;
			word32 a4_229;
			word32 a5_230;
			word32 a0_231;
			word32 a2_232;
			get_uint16_from_string(get_uint16_from_string(s0_11, (word32) a3 + 4, fp + -20, out a0_227, out a2_228, out a3_19, out a4_229, out a5_230), a3_19 + 8, fp + -18, out a0_231, out a2_232, out a3_34, out a4_35, out a5_36);
			word32 a0_50;
			word32 s0_233;
			word32 mstatus_234;
			ra = bt_le_set_data_len(ra, s1, a3_34, a4_35, a5_36, s2, s3, mstatus, dwLoc2C, dwLoc28, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg44, dwArg48, a3, dwArg58, ra, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, out s0_233, out a0_50, out a3, out mstatus_234);
			if (a0_50 != 0x00)
			{
				word32 s1_254;
				word32 a0_255;
				word32 a1_256;
				word32 a2_257;
				word32 a3_258;
				word32 a4_259;
				word32 a5_260;
				word32 a7_261;
				word32 s2_262;
				word32 s3_263;
				word32 s4_264;
				word32 s5_265;
				word32 s6_266;
				word32 s7_267;
				word32 s8_268;
				word32 s9_269;
				word32 s10_270;
				word32 s11_271;
				word32 t4_272;
				printf(ra, &g_t230BC3D8, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260, out a7_261, out s2_262, out s3_263, out s4_264, out s5_265, out s6_266, out s7_267, out s8_268, out s9_269, out s10_270, out s11_271, out t4_272);
				return;
			}
			a0_107 = (struct Eq_274 *) &g_t230BC408;
		}
	}
	word32 s1_235;
	word32 a0_236;
	word32 a1_237;
	word32 a2_238;
	word32 a3_239;
	word32 a4_240;
	word32 a5_241;
	word32 a7_242;
	word32 s2_243;
	word32 s3_244;
	word32 s4_245;
	word32 s5_246;
	word32 s6_247;
	word32 s7_248;
	word32 s8_249;
	word32 s9_250;
	word32 s10_251;
	word32 s11_252;
	word32 t4_253;
	printf(ra, a0_107, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_235, out a0_236, out a1_237, out a2_238, out a3_239, out a4_240, out a5_241, out a7_242, out s2_243, out s3_244, out s4_245, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out t4_253);
}

// 23056278: void ble_subscribe(Register Eq_2 ra, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_subscribe(Eq_2 ra, Eq_2 s1, word32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_101;
	if (a2 != 0x04)
		a0_101 = (struct Eq_274 *) &g_t230B67B4;
	else if (false)
		a0_101 = (struct Eq_274 *) &g_t230B9228;
	else
	{
		word32 a0_282;
		word32 a2_283;
		word32 a3_284;
		word32 a4_285;
		word32 a5_286;
		Eq_2 s0_32 = get_uint16_from_string(a3, (word32) a3 + 4, 0x42017042, out a0_282, out a2_283, out a3_284, out a4_285, out a5_286);
		word32 a0_287;
		word32 a2_288;
		word32 a3_289;
		word32 a4_290;
		word32 a5_291;
		Eq_2 s0_46 = get_uint16_from_string(s0_32, (word32) s0_32 + 8, 0x42017040, out a0_287, out a2_288, out a3_289, out a4_290, out a5_291);
		Eq_2 a0_52;
		word32 a2_292;
		word32 a3_293;
		word32 a4_294;
		word32 a5_295;
		get_uint16_from_string(s0_46, (word32) s0_46 + 0x0C, 0x42017044, out a0_52, out a2_292, out a3_293, out a4_294, out a5_295);
		g_dw4201703C = 587553180;
		word32 a0_70;
		ra = bt_gatt_subscribe(ra, a0_52, 0x4201701C, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg14, dwArg18, dwArg1C, dwArg3C, s1, dwArg88, out a0_70, out a3);
		if (a0_70 != 0x00)
		{
			word32 s1_296;
			word32 a0_297;
			word32 a1_298;
			word32 a2_299;
			word32 a3_300;
			word32 a4_301;
			word32 a5_302;
			word32 a7_303;
			word32 s2_304;
			word32 s3_305;
			word32 s4_306;
			word32 s5_307;
			word32 s6_308;
			word32 s7_309;
			word32 s8_310;
			word32 s9_311;
			word32 s10_312;
			word32 s11_313;
			word32 t4_314;
			printf(ra, &g_t230BC694, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_296, out a0_297, out a1_298, out a2_299, out a3_300, out a4_301, out a5_302, out a7_303, out s2_304, out s3_305, out s4_306, out s5_307, out s6_308, out s7_309, out s8_310, out s9_311, out s10_312, out s11_313, out t4_314);
			return;
		}
		a0_101 = (struct Eq_274 *) &g_t230BC6B0;
	}
	word32 s1_263;
	word32 a0_264;
	word32 a1_265;
	word32 a2_266;
	word32 a3_267;
	word32 a4_268;
	word32 a5_269;
	word32 a7_270;
	word32 s2_271;
	word32 s3_272;
	word32 s4_273;
	word32 s5_274;
	word32 s6_275;
	word32 s7_276;
	word32 s8_277;
	word32 s9_278;
	word32 s10_279;
	word32 s11_280;
	word32 t4_281;
	printf(ra, a0_101, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_263, out a0_264, out a1_265, out a2_266, out a3_267, out a4_268, out a5_269, out a7_270, out s2_271, out s3_272, out s4_273, out s5_274, out s6_275, out s7_276, out s8_277, out s9_278, out s10_279, out s11_280, out t4_281);
}

// 23056322: void ble_write(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void ble_write(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	struct Eq_274 * a0_147;
	if (a2 != 0x05)
		a0_147 = (struct Eq_274 *) &g_t230B67B4;
	else if (g_t4200F4B0 == 0x00)
		a0_147 = (struct Eq_274 *) &g_t230B9228;
	else if (g_dw42017068 != 0x00)
		a0_147 = (struct Eq_274 *) &g_t230BC73C;
	else
	{
		word32 a0_398;
		word32 a2_399;
		word32 a3_400;
		word32 a4_401;
		word32 a5_402;
		Eq_2 s0_40 = get_uint16_from_string(0x42017050, (word32) a3 + 4, 0x4201706C, out a0_398, out a2_399, out a3_400, out a4_401, out a5_402);
		word32 a0_403;
		word32 a2_404;
		word32 a3_405;
		word32 a4_406;
		word32 a5_407;
		Eq_2 s0_54 = get_uint16_from_string(s0_40, (word32) a3 + 8, (word32) s0_40 + 30, out a0_403, out a2_404, out a3_405, out a4_406, out a5_407);
		word32 a0_408;
		word32 a2_409;
		word32 a3_410;
		word32 a4_411;
		word32 a5_412;
		Eq_311663 s3_72 = (word32) *((word32) get_uint16_from_string(s0_54, (word32) a3 + 0x0C, (word32) s0_54 + 36, out a0_408, out a2_409, out a3_410, out a4_411, out a5_412) + 36);
		if (s3_72 > 0x0200)
			s3_72.u0 = 0x0200;
		Eq_2 a3_88;
		Eq_2 s1_94;
		Eq_2 s2_95;
		Eq_2 s3_96;
		word32 a0_413;
		Eq_2 s0_93 = get_bytearray_from_string(0x42016DF4, (word32) (word16) s3_72, dwArg0108, out s1_94, out a0_413, out a3_88, out s2_95, out s3_96);
		Eq_2 a0_106 = g_t4200F4B0;
		((word32) s0_93 + 32)->u0 = 0x42016DF4;
		*((word32) s0_93 + 36) = (word16) s3_96;
		g_t23055ABE = s0_93;
		word32 a0_116;
		ra = bt_gatt_write(ra, s1_94, a0_106, (word32) s2_95 + 80, a3_88, s2_95, s3_96, mstatus, dwLoc20, s4, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out a0_116, out a3);
		if (a0_116 != 0x00)
		{
			word32 s1_414;
			word32 a0_415;
			word32 a1_416;
			word32 a2_417;
			word32 a3_418;
			word32 a4_419;
			word32 a5_420;
			word32 a7_421;
			word32 s2_422;
			word32 s3_423;
			word32 s4_424;
			word32 s5_425;
			word32 s6_426;
			word32 s7_427;
			word32 s8_428;
			word32 s9_429;
			word32 s10_430;
			word32 s11_431;
			word32 t4_432;
			printf(ra, &g_t230BC74C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_414, out a0_415, out a1_416, out a2_417, out a3_418, out a4_419, out a5_420, out a7_421, out s2_422, out s3_423, out s4_424, out s5_425, out s6_426, out s7_427, out s8_428, out s9_429, out s10_430, out s11_431, out t4_432);
			return;
		}
		a0_147 = (struct Eq_274 *) &g_t230BC764;
	}
	word32 s2_387;
	word32 a7_386;
	word32 a5_385;
	word32 a4_384;
	word32 a3_383;
	word32 a2_382;
	word32 a1_381;
	word32 a0_380;
	word32 s1_379;
	word32 s3_388;
	word32 s4_389;
	word32 s5_390;
	word32 s6_391;
	word32 s7_392;
	word32 s8_393;
	word32 s9_394;
	word32 s10_395;
	word32 s11_396;
	word32 t4_397;
	printf(ra, a0_147, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_379, out a0_380, out a1_381, out a2_382, out a3_383, out a4_384, out a5_385, out a7_386, out s2_387, out s3_388, out s4_389, out s5_390, out s6_391, out s7_392, out s8_393, out s9_394, out s10_395, out s11_396, out t4_397);
}

