pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305641E: void ble_read(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void ble_read(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	struct Eq_274 * a0_121;
	if (a2 != 0x03)
		a0_121 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		Eq_2 s0_9 = *(union Eq_2 *) 0x03;
		if (false)
			a0_121 = (struct Eq_274 *) &g_t230B9228;
		else
		{
			Eq_2 a0_38;
			Eq_2 a2_40;
			Eq_2 a3_41;
			word32 a0_288;
			word32 a2_289;
			word32 a3_290;
			word32 a4_291;
			word32 a5_292;
			word32 a4_293;
			word32 a5_294;
			get_uint16_from_string(get_uint16_from_string(s0_9, (word32) a3 + 4, 0x42017014, out a0_288, out a2_289, out a3_290, out a4_291, out a5_292), (word32) a3 + 8, 0x42017016, out a0_38, out a2_40, out a3_41, out a4_293, out a5_294);
			g_dw230564D6 = 0x42016FF4;
			((union Eq_2 *) 0x1D)->u0 = 0x42016FF4;
			word32 a0_58;
			word32 s0_295;
			word32 s1_296;
			word32 s2_297;
			word32 s3_298;
			word32 mstatus_299;
			ra = bt_gatt_read(ra, 0x42016FF4, a0_38, a2_40, a3_41, a3, 0x42017000, mstatus, dwLoc20, dwLoc1C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, out s0_295, out s1_296, out a0_58, out a3, out s2_297, out s3_298, out mstatus_299);
			if (a0_58 != 0x00)
			{
				word32 s1_300;
				word32 a0_301;
				word32 a1_302;
				word32 a2_303;
				word32 a3_304;
				word32 a4_305;
				word32 a5_306;
				word32 a7_307;
				word32 s2_308;
				word32 s3_309;
				word32 s4_310;
				word32 s5_311;
				word32 s6_312;
				word32 s7_313;
				word32 s8_314;
				word32 s9_315;
				word32 s10_316;
				word32 s11_317;
				word32 t4_318;
				printf(ra, &g_t230BC298, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_300, out a0_301, out a1_302, out a2_303, out a3_304, out a4_305, out a5_306, out a7_307, out s2_308, out s3_309, out s4_310, out s5_311, out s6_312, out s7_313, out s8_314, out s9_315, out s10_316, out s11_317, out t4_318);
				return;
			}
			a0_121 = (struct Eq_274 *) &g_t230BC2B0;
		}
	}
	word32 s1_269;
	word32 a0_270;
	word32 a1_271;
	word32 a2_272;
	word32 a3_273;
	word32 a4_274;
	word32 a5_275;
	word32 a7_276;
	word32 s2_277;
	word32 s3_278;
	word32 s4_279;
	word32 s5_280;
	word32 s6_281;
	word32 s7_282;
	word32 s8_283;
	word32 s9_284;
	word32 s10_285;
	word32 s11_286;
	word32 t4_287;
	printf(ra, a0_121, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_269, out a0_270, out a1_271, out a2_272, out a3_273, out a4_274, out a5_275, out a7_276, out s2_277, out s3_278, out s4_279, out s5_280, out s6_281, out s7_282, out s8_283, out s9_284, out s10_285, out s11_286, out t4_287);
}

// 230564BE: void read_func(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C)
void read_func(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C)
{
	Eq_2 s1_34;
	word32 s9_277;
	word32 s10_278;
	word32 s11_279;
	word32 t4_280;
	word32 s8_276;
	word32 s7_275;
	word32 s6_274;
	word32 s5_273;
	word32 s4_272;
	word32 a7_271;
	word32 a5_270;
	word32 a4_269;
	word32 a2_267;
	word32 a3_268;
	word32 a0_265;
	word32 a1_266;
	word32 t1_281;
	word32 a0_282;
	word32 a1_283;
	word32 a2_284;
	word32 a3_285;
	word32 a4_286;
	word32 a5_287;
	Eq_2 s2_108;
	Eq_2 s3_131;
	Eq_2 ra_115 = memset(printf(ra, &g_t230BCA14, a3, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_34, out a0_265, out a1_266, out a2_267, out a3_268, out a4_269, out a5_270, out a7_271, out s2_108, out s3_131, out s4_272, out s5_273, out s6_274, out s7_275, out s8_276, out s9_277, out s10_278, out s11_279, out t4_280), fp + -56, 0x00, 0x0F, out t1_281, out a0_282, out a1_283, out a2_284, out a3_285, out a4_286, out a5_287);
	if ((word32) (word16) ((word32) s1_34 - 1) <= 0x15)
	{
		Eq_2 a3_71;
		word32 a1_288;
		word32 a2_289;
		word32 a4_290;
		word32 a5_291;
		word32 a6_292;
		word32 a7_293;
		memcpy(fp + -56, s2_108, s1_34, out a1_288, out a2_289, out a3_71, out a4_290, out a5_291, out a6_292, out a7_293);
		word32 a0_294;
		word32 a1_295;
		word32 a2_296;
		word32 a4_297;
		word32 a5_298;
		word32 a7_299;
		word32 s4_300;
		word32 s5_301;
		word32 s6_302;
		word32 s7_303;
		word32 s8_304;
		word32 s9_305;
		word32 s10_306;
		word32 s11_307;
		word32 t4_308;
		int32 s1_107;
		Eq_2 a3_116;
		ra_115 = printf(ra_115, &g_t230BCA38, a3_71, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_107, out a0_294, out a1_295, out a2_296, out a3_116, out a4_297, out a5_298, out a7_299, out s2_108, out s3_131, out s4_300, out s5_301, out s6_302, out s7_303, out s8_304, out s9_305, out s10_306, out s11_307, out t4_308);
		int32 s0_104 = 0x00;
		word32 s4_105 = 0x230BD000;
		while (s0_104 < s1_107)
		{
			++s0_104;
			word32 a0_316;
			word32 a1_317;
			word32 a2_318;
			word32 a4_319;
			word32 a5_320;
			word32 a7_321;
			word32 s5_322;
			word32 s6_323;
			word32 s7_324;
			word32 s8_325;
			word32 s9_326;
			word32 s10_327;
			word32 s11_328;
			word32 t4_329;
			ra_115 = printf(ra_115, s4_105 + -0x05B4, a3_116, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_107, out a0_316, out a1_317, out a2_318, out a3_116, out a4_319, out a5_320, out a7_321, out s2_108, out s3_131, out s4_105, out s5_322, out s6_323, out s7_324, out s8_325, out s9_326, out s10_327, out s11_328, out t4_329);
		}
	}
	if (s2_108 == 0x00)
	{
		word32 t1_309;
		word32 a0_310;
		word32 a1_311;
		word32 a2_312;
		word32 a3_313;
		word32 a4_314;
		word32 a5_315;
		memset(ra_115, s3_131, 0x00, 40, out t1_309, out a0_310, out a1_311, out a2_312, out a3_313, out a4_314, out a5_315);
	}
}

word32 g_dw230564D6 = 0xDC228936;
// 23056552: void data_cb(Register (ptr32 Eq_312154) a0, Register Eq_2 a1)
void data_cb(struct Eq_312154 * a0, Eq_2 a1)
{
	if ((word32) a0->b0000 > ~0x08)
		return;
	uint32 a2_12 = (word32) a0->b0001;
	if (a2_12 > 0x1D)
		a2_12 = 0x1D;
	word32 a1_68;
	word32 a2_69;
	word32 a3_70;
	word32 a4_71;
	word32 a5_72;
	word32 a6_73;
	word32 a7_74;
	memcpy(a1, a1, a2_12 & 0x00FF, out a1_68, out a2_69, out a3_70, out a4_71, out a5_72, out a6_73, out a7_74);
}

