pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23056588: void ble_discover(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register word32 s4, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArgA4, Stack word32 dwArgC0, Stack word32 dwArgC4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128)
void ble_discover(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, word32 s4, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArgA4, word32 dwArgC0, word32 dwArgC4, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0128)
{
	struct Eq_274 * a0_155;
	byte bLoc21_227 = SLICE(s4, byte, 24);
	if (a2 != 0x05)
	{
		a0_155 = (struct Eq_274 *) &g_t230B67B4;
		goto l230565A6;
	}
	if (g_t4200F4B0 == 0x00)
	{
		a0_155 = (struct Eq_274 *) &g_t230B9228;
		goto l230565A6;
	}
	g_dw23056096 = 1107389868;
	g_w42016DCC = 0x01;
	g_w42016DD2 = ~0x00;
	word32 a1_356;
	word32 a4_357;
	word32 s8_358;
	word32 a0_355;
	get_uint8_from_string(s0, (word32) a3 + 4, fp + -33, out a0_355, out a1_356, out a3, out a4_357, out s8_358);
	word32 a5_48 = (word32) bLoc21_227;
	if (a5_48 == 0x00)
		g_b42016DD4 = 0x00;
	else
	{
		if (a5_48 != 0x01 && (a5_48 != 0x02 && (a5_48 != 0x03 && a5_48 != 0x04)))
		{
			a0_155 = (struct Eq_274 *) &g_t230BC190;
			goto l230565A6;
		}
		g_b42016DD4 = (byte) a5_48;
	}
	word32 a3_393;
	word32 a4_394;
	word32 a5_395;
	word32 a0_391;
	word32 a2_392;
	Eq_2 s0_74 = get_uint16_from_string(1107389868, (word32) a3 + 8, 0x4200F4B6, out a0_391, out a2_392, out a3_393, out a4_394, out a5_395);
	Eq_2 s2_80 = 0x4200F4B4;
	if ((word32) g_w4200F4B6 == 0x00)
		s2_80.u0 = 0x00;
	*((word32) s0_74 + 24) = s2_80;
	word32 a4_381;
	word32 a5_382;
	word32 a0_378;
	word32 a2_379;
	word32 a3_380;
	Eq_2 s0_96 = get_uint16_from_string(s0_74, (word32) a3 + 0x0C, (word32) s0_74 + 32, out a0_378, out a2_379, out a3_380, out a4_381, out a5_382);
	Eq_2 a3_105;
	word32 a2_384;
	word32 a4_385;
	word32 a5_386;
	word32 a0_383;
	get_uint16_from_string(s0_96, (word32) a3 + 16, (word32) s0_96 + 38, out a0_383, out a2_384, out a3_105, out a4_385, out a5_386);
	word32 a0_129;
	word32 s3_390;
	word32 s0_387;
	word32 s1_388;
	word32 s2_389;
	ra = bt_gatt_discover(ra, 0x42017000, g_t4200F4B0, 1107389868, a3_105, s2_80, 0x4200F4B4, dwArg00, dwArg04, dwArg4C, dwArgA4, dwArgC0, dwArgC4, dwArgE8, dwArg0108, out s0_387, out s1_388, out a0_129, out a3, out s2_389, out s3_390);
	if (a0_129 != 0x00)
	{
		word32 a7_403;
		word32 a5_402;
		word32 s5_407;
		word32 s4_406;
		word32 s3_405;
		word32 s8_410;
		word32 s6_408;
		word32 s7_409;
		word32 s10_412;
		word32 s11_413;
		word32 s9_411;
		word32 s2_404;
		word32 a2_399;
		word32 a3_400;
		word32 a4_401;
		word32 s1_396;
		word32 a0_397;
		word32 a1_398;
		word32 t4_414;
		printf(ra, &g_t230BC1AC, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_396, out a0_397, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a7_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409, out s8_410, out s9_411, out s10_412, out s11_413, out t4_414);
l23056656:
		0x00 = dwArg0128;
		return;
	}
	a0_155 = (struct Eq_274 *) &g_t230BC1C8;
l230565A6:
	word32 s10_375;
	word32 s11_376;
	word32 t4_377;
	word32 s7_372;
	word32 s8_373;
	word32 s9_374;
	word32 s6_371;
	word32 s5_370;
	word32 s4_369;
	word32 s3_368;
	word32 s2_367;
	word32 a7_366;
	word32 a1_361;
	word32 a2_362;
	word32 a3_363;
	word32 a4_364;
	word32 a5_365;
	word32 s1_359;
	word32 a0_360;
	printf(ra, a0_155, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_359, out a0_360, out a1_361, out a2_362, out a3_363, out a4_364, out a5_365, out a7_366, out s2_367, out s3_368, out s4_369, out s5_370, out s6_371, out s7_372, out s8_373, out s9_374, out s10_375, out s11_376, out t4_377);
	goto l23056656;
}

// 23056698: void ble_auth_passkey(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_auth_passkey(Eq_2 ra, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_42;
	if (a2 != 0x02)
		a0_42 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		dwArg74 = ra;
		if (false)
			a0_42 = (struct Eq_274 *) &g_t230B9228;
		else
		{
			word32 a1_182;
			word32 a2_183;
			word32 a4_184;
			word32 a5_185;
			Eq_2 a0_14 = atoi(a0, out a1_182, out a2_183, out a3, out a4_184, out a5_185);
			if (a0_14 <= 999999)
			{
				bt_conn_auth_passkey_entry(a0_14);
				return;
			}
			a0_42 = (struct Eq_274 *) &g_t230BC064;
		}
	}
	word32 s1_163;
	word32 a0_164;
	word32 a1_165;
	word32 a2_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 a7_170;
	word32 s2_171;
	word32 s3_172;
	word32 s4_173;
	word32 s5_174;
	word32 s6_175;
	word32 s7_176;
	word32 s8_177;
	word32 s9_178;
	word32 s10_179;
	word32 s11_180;
	word32 t4_181;
	printf(ra, a0_42, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_163, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out a7_170, out s2_171, out s3_172, out s4_173, out s5_174, out s6_175, out s7_176, out s8_177, out s9_178, out s10_179, out s11_180, out t4_181);
}

// 230566F6: void ble_conn_update(Register Eq_2 ra, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void ble_conn_update(Eq_2 ra, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	struct Eq_274 * a0_105;
	if (a2 != 0x05)
		a0_105 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 a0_241;
		word32 a2_242;
		word32 a3_243;
		word32 a4_244;
		word32 a5_245;
		Eq_2 s0_22 = get_uint16_from_string(a3, (word32) a3 + 4, fp + ~0x17, out a0_241, out a2_242, out a3_243, out a4_244, out a5_245);
		word32 a0_246;
		word32 a2_247;
		word32 a3_248;
		word32 a4_249;
		word32 a5_250;
		Eq_2 s0_36 = get_uint16_from_string(s0_22, (word32) s0_22 + 8, fp + ~0x15, out a0_246, out a2_247, out a3_248, out a4_249, out a5_250);
		word32 a0_251;
		word32 a2_252;
		word32 a3_253;
		word32 a4_254;
		word32 a5_255;
		Eq_2 s0_50 = get_uint16_from_string(s0_36, (word32) s0_36 + 0x0C, fp + ~0x13, out a0_251, out a2_252, out a3_253, out a4_254, out a5_255);
		Eq_2 a3_59;
		word32 a0_256;
		word32 a2_257;
		word32 a4_258;
		word32 a5_259;
		get_uint16_from_string(s0_50, (word32) s0_50 + 16, fp + ~0x11, out a0_256, out a2_257, out a3_59, out a4_258, out a5_259);
		word32 a0_87;
		ra = bt_conn_le_param_update(ra, s1, g_t4200F4B0, fp + ~0x17, a3_59, s3, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg58, dwArg5C, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out a0_87, out a3);
		if (a0_87 != 0x00)
		{
			word32 s1_260;
			word32 a0_261;
			word32 a1_262;
			word32 a2_263;
			word32 a3_264;
			word32 a4_265;
			word32 a5_266;
			word32 a7_267;
			word32 s2_268;
			word32 s3_269;
			word32 s4_270;
			word32 s5_271;
			word32 s6_272;
			word32 s7_273;
			word32 s8_274;
			word32 s9_275;
			word32 s10_276;
			word32 s11_277;
			word32 t4_278;
			printf(ra, &g_t230BC08C, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out a7_267, out s2_268, out s3_269, out s4_270, out s5_271, out s6_272, out s7_273, out s8_274, out s9_275, out s10_276, out s11_277, out t4_278);
			return;
		}
		a0_105 = (struct Eq_274 *) &g_t230BC0AC;
	}
	word32 s1_279;
	word32 a0_280;
	word32 a1_281;
	word32 a2_282;
	word32 a3_283;
	word32 a4_284;
	word32 a5_285;
	word32 a7_286;
	word32 s2_287;
	word32 s3_288;
	word32 s4_289;
	word32 s5_290;
	word32 s6_291;
	word32 s7_292;
	word32 s8_293;
	word32 s9_294;
	word32 s10_295;
	word32 s11_296;
	word32 t4_297;
	printf(ra, a0_105, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_279, out a0_280, out a1_281, out a2_282, out a3_283, out a4_284, out a5_285, out a7_286, out s2_287, out s3_288, out s4_289, out s5_290, out s6_291, out s7_292, out s8_293, out s9_294, out s10_295, out s11_296, out t4_297);
}

// 2305676E: void ble_unpair(Register Eq_2 ra, Register Eq_2 s0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void ble_unpair(Eq_2 ra, Eq_2 s0, word32 a2, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	struct Eq_274 * a0_89;
	if (a2 != 0x03)
		a0_89 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 a0_189;
		word32 a1_190;
		word32 a3_191;
		word32 a4_192;
		word32 s8_193;
		get_uint8_from_string(s0, (word32) a3 + 4, fp + -24, out a0_189, out a1_190, out a3_191, out a4_192, out s8_193);
		Eq_2 s1_38;
		Eq_2 s2_39;
		word32 a0_194;
		word32 a3_195;
		word32 s3_196;
		Eq_2 s0_37 = get_bytearray_from_string(fp + -32, 0x06, dwArgF8, out s1_38, out a0_194, out a3_195, out s2_39, out s3_196);
		reverse_bytearray(fp + -32, fp + -23, 0x06);
		word32 a0_59;
		word32 s0_197;
		word32 s1_198;
		word32 s2_199;
		word32 s3_200;
		word32 s4_201;
		word32 s5_202;
		word32 mstatus_203;
		ra = bt_unpair(ra, s0_37, s1_38, 0x00, fp + -24, s2_39, s4, mstatus, dwLoc2C, dwLoc28, dwLoc24, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_197, out s1_198, out a0_59, out a3, out s2_199, out s3_200, out s4_201, out s5_202, out mstatus_203);
		if (a0_59 != 0x00)
			a0_89 = (struct Eq_274 *) &g_t230BC6C0;
		else
			a0_89 = (struct Eq_274 *) &g_t230BC6D4;
	}
	word32 s1_204;
	word32 a0_205;
	word32 a1_206;
	word32 a2_207;
	word32 a3_208;
	word32 a4_209;
	word32 a5_210;
	word32 a7_211;
	word32 s2_212;
	word32 s3_213;
	word32 s4_214;
	word32 s5_215;
	word32 s6_216;
	word32 s7_217;
	word32 s8_218;
	word32 s9_219;
	word32 s10_220;
	word32 s11_221;
	word32 t4_222;
	printf(ra, a0_89, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_204, out a0_205, out a1_206, out a2_207, out a3_208, out a4_209, out a5_210, out a7_211, out s2_212, out s3_213, out s4_214, out s5_215, out s6_216, out s7_217, out s8_218, out s9_219, out s10_220, out s11_221, out t4_222);
}

// 230567CE: void ble_start_scan(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
void ble_start_scan(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	struct Eq_274 * a0_106;
	if (a2 != 0x05)
		a0_106 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		word32 a0_247;
		word32 a1_248;
		word32 a3_249;
		word32 a4_250;
		word32 s8_251;
		Eq_2 s0_22 = get_uint8_from_string(a3, (word32) a3 + 4, fp + ~0x17, out a0_247, out a1_248, out a3_249, out a4_250, out s8_251);
		word32 a0_252;
		word32 a1_253;
		word32 a3_254;
		word32 a4_255;
		word32 s8_256;
		Eq_2 s0_36 = get_uint8_from_string(s0_22, (word32) s0_22 + 8, fp + ~0x16, out a0_252, out a1_253, out a3_254, out a4_255, out s8_256);
		word32 a0_257;
		word32 a2_258;
		word32 a3_259;
		word32 a4_260;
		word32 a5_261;
		Eq_2 s0_50 = get_uint16_from_string(s0_36, (word32) s0_36 + 0x0C, fp + ~0x15, out a0_257, out a2_258, out a3_259, out a4_260, out a5_261);
		word32 a0_75;
		word32 a0_262;
		word32 a2_263;
		word32 a3_264;
		word32 a4_265;
		word32 a5_266;
		word32 s1_267;
		word32 a1_268;
		word32 a4_269;
		word32 s2_270;
		word32 s3_271;
		word32 s4_272;
		word32 s5_273;
		word32 s6_274;
		word32 s7_275;
		word32 s11_276;
		word32 mstatus_277;
		ra = bt_le_scan_start(ra, get_uint16_from_string(s0_50, (word32) s0_50 + 16, fp + ~0x13, out a0_262, out a2_263, out a3_264, out a4_265, out a5_266), s1, fp + ~0x17, s2, s4, mstatus, dwLoc20, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg28, dwArg2C, dwArg38, dwArg3C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, out s1_267, out a0_75, out a1_268, out a3, out a4_269, out s2_270, out s3_271, out s4_272, out s5_273, out s6_274, out s7_275, out s11_276, out mstatus_277);
		if (a0_75 != 0x00)
		{
			word32 s1_278;
			word32 a0_279;
			word32 a1_280;
			word32 a2_281;
			word32 a3_282;
			word32 a4_283;
			word32 a5_284;
			word32 a7_285;
			word32 s2_286;
			word32 s3_287;
			word32 s4_288;
			word32 s5_289;
			word32 s6_290;
			word32 s7_291;
			word32 s8_292;
			word32 s9_293;
			word32 s10_294;
			word32 s11_295;
			word32 t4_296;
			printf(ra, &g_t230BC5D8, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_278, out a0_279, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a7_285, out s2_286, out s3_287, out s4_288, out s5_289, out s6_290, out s7_291, out s8_292, out s9_293, out s10_294, out s11_295, out t4_296);
			return;
		}
		a0_106 = (struct Eq_274 *) &g_t230BC5FC;
	}
	word32 s1_297;
	word32 a0_298;
	word32 a1_299;
	word32 a2_300;
	word32 a3_301;
	word32 a4_302;
	word32 a5_303;
	word32 a7_304;
	word32 s2_305;
	word32 s3_306;
	word32 s4_307;
	word32 s5_308;
	word32 s6_309;
	word32 s7_310;
	word32 s8_311;
	word32 s9_312;
	word32 s10_313;
	word32 s11_314;
	word32 t4_315;
	printf(ra, a0_106, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_297, out a0_298, out a1_299, out a2_300, out a3_301, out a4_302, out a5_303, out a7_304, out s2_305, out s3_306, out s4_307, out s5_308, out s6_309, out s7_310, out s8_311, out s9_312, out s10_313, out s11_314, out t4_315);
}

