pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23056846: void ble_set_device_name(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void ble_set_device_name(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 s4, Eq_2 s6, Eq_2 s7, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	word32 a5_239;
	word32 a4_238;
	word32 a3_237;
	word32 a2_236;
	word32 a1_235;
	Eq_2 a0_12 = strlen(a0, out a1_235, out a2_236, out a3_237, out a4_238, out a5_239);
	if (a0_12 != 0x00)
	{
		word32 a2_245;
		word32 a3_246;
		word32 a4_247;
		word32 a5_248;
		word32 a1_244;
		a0_12 = strlen(a0_12, out a1_244, out a2_245, out a3_246, out a4_247, out a5_248);
		if (a0_12 <= 0x1D)
		{
			struct Eq_274 * a0_103;
			word32 a0_72;
			Eq_2 a3_75;
			word32 s0_249;
			word32 s1_250;
			word32 s3_251;
			word32 mstatus_252;
			Eq_2 ra_85 = bt_set_name(ra, s1, a0_12, s4, s6, s7, s8, mstatus, dwLoc10, s0, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg2C, dwArg38, dwArg44, dwArg48, dwArg4C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_249, out s1_250, out a0_72, out a3_75, out s3_251, out mstatus_252);
			if (a0_72 != 0x00)
				a0_103 = (struct Eq_274 *) &g_t230BC438;
			else
				a0_103 = (struct Eq_274 *) &g_t230BC454;
			word32 s1_253;
			word32 a0_254;
			word32 a1_255;
			word32 a2_256;
			word32 a3_257;
			word32 a4_258;
			word32 a5_259;
			word32 a7_260;
			word32 s2_261;
			word32 s3_262;
			word32 s4_263;
			word32 s5_264;
			word32 s6_265;
			word32 s7_266;
			word32 s8_267;
			word32 s9_268;
			word32 s10_269;
			word32 s11_270;
			word32 t4_271;
			printf(ra_85, a0_103, a3_75, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_253, out a0_254, out a1_255, out a2_256, out a3_257, out a4_258, out a5_259, out a7_260, out s2_261, out s3_262, out s4_263, out s5_264, out s6_265, out s7_266, out s8_267, out s9_268, out s10_269, out s11_270, out t4_271);
			return;
		}
	}
	Eq_2 a3_30;
	word32 a5_243;
	word32 a4_242;
	word32 a2_241;
	word32 a1_240;
	strlen(a0_12, out a1_240, out a2_241, out a3_30, out a4_242, out a5_243);
	word32 s1_272;
	word32 a0_273;
	word32 a1_274;
	word32 a2_275;
	word32 a3_276;
	word32 a4_277;
	word32 a5_278;
	word32 a7_279;
	word32 s2_280;
	word32 s3_281;
	word32 s4_282;
	word32 s5_283;
	word32 s6_284;
	word32 s7_285;
	word32 s8_286;
	word32 s9_287;
	word32 s10_288;
	word32 s11_289;
	word32 t4_290;
	printf(ra, &g_t230BC478, a3_30, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_272, out a0_273, out a1_274, out a2_275, out a3_276, out a4_277, out a5_278, out a7_279, out s2_280, out s3_281, out s4_282, out s5_283, out s6_284, out s7_285, out s8_286, out s9_287, out s10_288, out s11_289, out t4_290);
}

// 230568A0: void ble_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_20;
	if ((word32) g_b4200F4AC != 0x00)
		a0_20 = (struct Eq_274 *) &g_t230B6478;
	else
	{
		g_t4200F4B0.u0 = 0x00;
		bt_conn_cb_register(&g_dw4200DEF0, a4);
		g_b4200F4AC = 0x01;
		a0_20 = (struct Eq_274 *) &g_t230B64A0;
	}
	word32 a7_77;
	word32 a5_76;
	word32 a4_75;
	word32 a3_74;
	word32 a2_73;
	word32 a1_72;
	word32 a0_71;
	word32 s1_70;
	word32 s2_78;
	word32 s3_79;
	word32 s4_80;
	word32 s5_81;
	word32 s6_82;
	word32 s7_83;
	word32 s8_84;
	word32 s9_85;
	word32 s10_86;
	word32 s11_87;
	word32 t4_88;
	printf(ra, a0_20, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_70, out a0_71, out a1_72, out a2_73, out a3_74, out a4_75, out a5_76, out a7_77, out s2_78, out s3_79, out s4_80, out s5_81, out s6_82, out s7_83, out s8_84, out s9_85, out s10_86, out s11_87, out t4_88);
}

// 230568EA: Register Eq_2 bt_addr_le_to_str.constprop.14(Register Eq_2 ra, Register (ptr32 byte) a0, Register Eq_2 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s3Out)
// Called from:
//      device_found
//      ble_read_local_address
//      connected
//      disconnected
//      security_changed
//      auth_passkey_display
//      auth_passkey_entry
//      auth_passkey_confirm
//      auth_cancel
//      auth_pairing_confirm
//      auth_pairing_complete
//      auth_pairing_failed
//      identity_resolved
//      ble_get_all_conn_info
Eq_2 bt_addr_le_to_str.constprop.14(Eq_2 ra, byte * a0, Eq_2 a1, Eq_2 dwArg08, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s3Out)
{
	Eq_2 a1_20;
	word32 a3_13 = (word32) *a0;
	Eq_2 s2_17 = a1;
	Eq_2 s1_18 = fp + -28;
	if (a3_13 != 0x01)
	{
		if (a3_13 != 0x00)
		{
			if (a3_13 != 0x02)
			{
				if (a3_13 != 0x03)
				{
					word32 s9_167;
					word32 s10_168;
					word32 s7_165;
					word32 s8_166;
					word32 s5_163;
					word32 s6_164;
					word32 s3_161;
					word32 s4_162;
					word32 a5_159;
					word32 a7_160;
					word32 a3_157;
					word32 a4_158;
					word32 a1_155;
					word32 a2_156;
					word32 s0_153;
					word32 a0_154;
					word32 s11_169;
					ra = snprintf(ra, fp + -28, 0x0A, &g_t230BAA20, dwLoc18, dwArg08, dwArg34, dwArg50, dwArg54, dwArg78, dwArg9C, out s0_153, out s1_18, out a0_154, out a1_155, out a2_156, out a3_157, out a4_158, out a5_159, out a7_160, out s2_17, out s3_161, out s4_162, out s5_163, out s6_164, out s7_165, out s8_166, out s9_167, out s10_168, out s11_169);
					goto l23056932;
				}
				a1_20.u0 = 587966996;
			}
			else
				a1_20.u0 = 0x230BAA08;
		}
		else
			a1_20.u0 = 587966968;
	}
	else
		a1_20.u0 = 0x230BAA00;
	word32 a4_186;
	word32 a5_187;
	strcpy(fp + -28, a1_20, out a4_186, out a5_187);
l23056932:
	ptr32 a3_88;
	ptr32 s1_94;
	ptr32 s3_98;
	word32 s0_170;
	word32 a0_171;
	word32 a1_172;
	word32 a2_173;
	word32 a4_174;
	word32 a5_175;
	word32 a7_176;
	word32 s2_177;
	word32 s4_178;
	word32 s5_179;
	word32 s6_180;
	word32 s7_181;
	word32 s8_182;
	word32 s9_183;
	word32 s10_184;
	word32 s11_185;
	Eq_2 ra_92 = snprintf(ra, s2_17, 0x1E, &g_t230BAA28, dwLoc18, dwArg08, dwArg34, s1_18, dwArg54, dwArg78, dwArg9C, out s0_170, out s1_94, out a0_171, out a1_172, out a2_173, out a3_88, out a4_174, out a5_175, out a7_176, out s2_177, out s3_98, out s4_178, out s5_179, out s6_180, out s7_181, out s8_182, out s9_183, out s10_184, out s11_185);
	0x00 = dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_94;
	a3Out = a3_88;
	s3Out = s3_98;
	return ra_92;
}

