pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23056988: void device_found(Register Eq_2 ra, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg5C, Stack word32 dwArgC8)
void device_found(Eq_2 ra, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg5C, word32 dwArgC8)
{
	Eq_2 a3_26;
	byte * s2_40;
	Eq_2 s1_73;
	word32 t1_142;
	word32 a0_143;
	word32 a1_144;
	word32 a2_145;
	word32 a4_146;
	word32 a5_147;
	word32 s0_148;
	word32 a3_149;
	word32 s3_150;
	word32 s1_151;
	word32 a0_152;
	word32 a1_153;
	word32 a2_154;
	word32 a3_155;
	word32 a4_156;
	word32 a5_157;
	word32 a7_158;
	word32 s2_159;
	word32 s3_160;
	word32 s4_161;
	word32 s5_162;
	word32 s6_163;
	word32 s7_164;
	word32 s8_165;
	word32 s9_166;
	word32 s10_167;
	word32 s11_168;
	word32 t4_169;
	printf(bt_addr_le_to_str.constprop.14(bt_data_parse(memset(ra, fp + -48, 0x00, 0x1E, out t1_142, out a0_143, out a1_144, out a2_145, out a3_26, out a4_146, out a5_147), a3_26, &g_t23056552, fp + -48, a3_26, dwArgC8, out s2_40), s2_40, fp + -80, dwLoc58, dwLoc2C, dwLoc10, dwLoc0C, dwArg18, dwArg3C, dwArgC8, out s0_148, out s1_73, out a3_149, out s3_150), &g_t230BC7C4, s1_73, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_151, out a0_152, out a1_153, out a2_154, out a3_155, out a4_156, out a5_157, out a7_158, out s2_159, out s3_160, out s4_161, out s5_162, out s6_163, out s7_164, out s8_165, out s9_166, out s10_167, out s11_168, out t4_169);
}

// 230569DE: void ble_read_local_address(Register Eq_2 ra, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArgE8)
void ble_read_local_address(Eq_2 ra, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArgE8)
{
	bt_get_local_public_address(fp + -64);
	Eq_2 a3_26;
	word32 s0_155;
	word32 s1_156;
	word32 s3_157;
	word32 s1_158;
	word32 a0_159;
	word32 a1_160;
	word32 a2_161;
	word32 a3_162;
	word32 a4_163;
	word32 a5_164;
	word32 a7_165;
	word32 s2_166;
	word32 s3_167;
	word32 s4_168;
	word32 s5_169;
	word32 s6_170;
	word32 s7_171;
	word32 s8_172;
	word32 s9_173;
	word32 s10_174;
	word32 s11_175;
	word32 t4_176;
	Eq_2 ra_59 = printf(bt_addr_le_to_str.constprop.14(ra, fp + -64, fp + -48, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_155, out s1_156, out a3_26, out s3_157), &g_t230BC2C0, a3_26, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_158, out a0_159, out a1_160, out a2_161, out a3_162, out a4_163, out a5_164, out a7_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175, out t4_176);
	bt_get_local_ramdon_address(fp + -56);
	Eq_2 a3_93;
	word32 s0_177;
	word32 s1_178;
	word32 s3_179;
	word32 s1_180;
	word32 a0_181;
	word32 a1_182;
	word32 a2_183;
	word32 a3_184;
	word32 a4_185;
	word32 a5_186;
	word32 a7_187;
	word32 s2_188;
	word32 s3_189;
	word32 s4_190;
	word32 s5_191;
	word32 s6_192;
	word32 s7_193;
	word32 s8_194;
	word32 s9_195;
	word32 s10_196;
	word32 s11_197;
	word32 t4_198;
	printf(bt_addr_le_to_str.constprop.14(ra_59, fp + -56, fp + -48, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_177, out s1_178, out a3_93, out s3_179), &g_t230BC2DC, a3_93, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_180, out a0_181, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a7_187, out s2_188, out s3_189, out s4_190, out s5_191, out s6_192, out s7_193, out s8_194, out s9_195, out s10_196, out s11_197, out t4_198);
}

// 23056A20: void connected(Register Eq_2 ra, Register word32 a0, Register word32 a1, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArgE8)
void connected(Eq_2 ra, word32 a0, word32 a1, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArgE8)
{
	Eq_2 a3_17;
	word32 * s0_23;
	word32 s3_139;
	word32 s1_138;
	Eq_2 ra_22 = bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_23, out s1_138, out a3_17, out s3_139);
	if (a1 != 0x00)
	{
		word32 s1_158;
		word32 a0_159;
		word32 a1_160;
		word32 a2_161;
		word32 a3_162;
		word32 a4_163;
		word32 a5_164;
		word32 a7_165;
		word32 s2_166;
		word32 s3_167;
		word32 s4_168;
		word32 s5_169;
		word32 s6_170;
		word32 s7_171;
		word32 s8_172;
		word32 s9_173;
		word32 s10_174;
		word32 s11_175;
		word32 t4_176;
		printf(ra_22, &g_t230BC790, a3_17, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_158, out a0_159, out a1_160, out a2_161, out a3_162, out a4_163, out a5_164, out a7_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175, out t4_176);
	}
	else
	{
		word32 * a4_49;
		word32 s1_140;
		word32 a0_141;
		word32 a1_142;
		word32 a2_143;
		word32 a3_144;
		word32 a5_145;
		word32 a7_146;
		word32 s2_147;
		word32 s3_148;
		word32 s4_149;
		word32 s5_150;
		word32 s6_151;
		word32 s7_152;
		word32 s8_153;
		word32 s9_154;
		word32 s10_155;
		word32 s11_156;
		word32 t4_157;
		printf(ra_22, &g_t230BC7B0, a3_17, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_140, out a0_141, out a1_142, out a2_143, out a3_144, out a4_49, out a5_145, out a7_146, out s2_147, out s3_148, out s4_149, out s5_150, out s6_151, out s7_152, out s8_153, out s9_154, out s10_155, out s11_156, out t4_157);
		word32 a5_66 = *a4_49;
		if (a4_49 == null)
			*s0_23 = a5_66;
	}
}

// 23056A6A: void disconnected(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArgE8)
void disconnected(Eq_2 ra, word32 a0, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArgE8)
{
	Eq_2 a3_17;
	word32 ** s0_23;
	word32 ** a4_49;
	word32 t4_133;
	word32 s11_132;
	word32 s10_131;
	word32 s9_130;
	word32 s8_129;
	word32 s7_128;
	word32 s6_127;
	word32 s5_126;
	word32 s4_125;
	word32 s3_124;
	word32 s2_123;
	word32 a7_122;
	word32 a5_121;
	word32 a3_120;
	word32 a2_119;
	word32 a1_118;
	word32 a0_117;
	word32 s1_116;
	word32 s3_115;
	word32 s1_114;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_23, out s1_114, out a3_17, out s3_115), &g_t230BC7F0, a3_17, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_116, out a0_117, out a1_118, out a2_119, out a3_120, out a4_49, out a5_121, out a7_122, out s2_123, out s3_124, out s4_125, out s5_126, out s6_127, out s7_128, out s8_129, out s9_130, out s10_131, out s11_132, out t4_133);
	word32 * a5_66 = *a4_49;
	if (a4_49 == s0_23)
		*a5_66 = 0x00;
}

// 23056AA8: void security_changed(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArgE8)
void security_changed(Eq_2 ra, word32 a0, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArgE8)
{
	Eq_2 a3_14;
	word32 s0_78;
	word32 s1_79;
	word32 s3_80;
	word32 s1_81;
	word32 a0_82;
	word32 a1_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a7_88;
	word32 s2_89;
	word32 s3_90;
	word32 s4_91;
	word32 s5_92;
	word32 s6_93;
	word32 s7_94;
	word32 s8_95;
	word32 s9_96;
	word32 s10_97;
	word32 s11_98;
	word32 t4_99;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_78, out s1_79, out a3_14, out s3_80), &g_t230BCA5C, a3_14, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_81, out a0_82, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a7_88, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95, out s9_96, out s10_97, out s11_98, out t4_99);
}

// 23056ACE: void auth_passkey_display(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack word32 dwArgF8)
void auth_passkey_display(Eq_2 ra, word32 a0, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, word32 dwArgF8)
{
	Eq_2 a3_16;
	word32 s0_82;
	word32 s1_83;
	word32 s3_84;
	word32 s1_85;
	word32 a0_86;
	word32 a1_87;
	word32 a2_88;
	word32 a3_89;
	word32 a4_90;
	word32 a5_91;
	word32 a7_92;
	word32 s2_93;
	word32 s3_94;
	word32 s4_95;
	word32 s5_96;
	word32 s6_97;
	word32 s7_98;
	word32 s8_99;
	word32 s9_100;
	word32 s10_101;
	word32 s11_102;
	word32 t4_103;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc28, dwArg04, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgF8, out s0_82, out s1_83, out a3_16, out s3_84), &g_t230BBFE0, a3_16, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_85, out a0_86, out a1_87, out a2_88, out a3_89, out a4_90, out a5_91, out a7_92, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97, out s7_98, out s8_99, out s9_100, out s10_101, out s11_102, out t4_103);
}

// 23056AF6: void auth_passkey_entry(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack word32 dwArgF8)
void auth_passkey_entry(Eq_2 ra, word32 a0, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, word32 dwArgF8)
{
	Eq_2 a3_12;
	word32 s0_75;
	word32 s1_76;
	word32 s3_77;
	word32 s1_78;
	word32 a0_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a5_84;
	word32 a7_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	word32 s9_93;
	word32 s10_94;
	word32 s11_95;
	word32 t4_96;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc28, dwArg04, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgF8, out s0_75, out s1_76, out a3_12, out s3_77), &g_t230BBFF8, a3_12, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_78, out a0_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out a7_85, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92, out s9_93, out s10_94, out s11_95, out t4_96);
}

// 23056B18: void auth_passkey_confirm(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack word32 dwArgE8)
void auth_passkey_confirm(Eq_2 ra, word32 a0, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg7C, word32 dwArgE8)
{
	Eq_2 a3_14;
	word32 s0_78;
	word32 s1_79;
	word32 s3_80;
	word32 s1_81;
	word32 a0_82;
	word32 a1_83;
	word32 a2_84;
	word32 a3_85;
	word32 a4_86;
	word32 a5_87;
	word32 a7_88;
	word32 s2_89;
	word32 s3_90;
	word32 s4_91;
	word32 s5_92;
	word32 s6_93;
	word32 s7_94;
	word32 s8_95;
	word32 s9_96;
	word32 s10_97;
	word32 s11_98;
	word32 t4_99;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc38, dwLoc0C, dwArg10, dwArg14, dwArg38, ra, dwArgE8, out s0_78, out s1_79, out a3_14, out s3_80), &g_t230BBFC0, a3_14, dwLoc38, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_81, out a0_82, out a1_83, out a2_84, out a3_85, out a4_86, out a5_87, out a7_88, out s2_89, out s3_90, out s4_91, out s5_92, out s6_93, out s7_94, out s8_95, out s9_96, out s10_97, out s11_98, out t4_99);
}

// 23056B3E: void auth_cancel(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack word32 dwArgF8)
void auth_cancel(Eq_2 ra, word32 a0, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, word32 dwArgF8)
{
	Eq_2 a3_12;
	word32 s0_75;
	word32 s1_76;
	word32 s3_77;
	word32 s1_78;
	word32 a0_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a5_84;
	word32 a7_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	word32 s9_93;
	word32 s10_94;
	word32 s11_95;
	word32 t4_96;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc28, dwArg04, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgF8, out s0_75, out s1_76, out a3_12, out s3_77), &g_t230BBF50, a3_12, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_78, out a0_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out a7_85, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92, out s9_93, out s10_94, out s11_95, out t4_96);
}

// 23056B60: void auth_pairing_confirm(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack word32 dwArgF8)
void auth_pairing_confirm(Eq_2 ra, word32 a0, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, word32 dwArgF8)
{
	Eq_2 a3_12;
	word32 s0_75;
	word32 s1_76;
	word32 s3_77;
	word32 s1_78;
	word32 a0_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a5_84;
	word32 a7_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	word32 s9_93;
	word32 s10_94;
	word32 s11_95;
	word32 t4_96;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc28, dwArg04, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgF8, out s0_75, out s1_76, out a3_12, out s3_77), &g_t230BBF88, a3_12, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_78, out a0_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out a7_85, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92, out s9_93, out s10_94, out s11_95, out t4_96);
}

// 23056B82: void auth_pairing_complete(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack word32 dwArgF8)
void auth_pairing_complete(Eq_2 ra, word32 a0, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, word32 dwArgF8)
{
	Eq_2 a3_16;
	word32 s0_22;
	word32 s1_100;
	word32 s3_101;
	Eq_2 ra_21 = bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc28, dwArg04, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgF8, out s0_22, out s1_100, out a3_16, out s3_101);
	word32 a4_107;
	word32 a3_106;
	word32 a2_105;
	word32 a1_104;
	word32 a0_103;
	word32 s1_102;
	word32 a5_108;
	word32 a7_109;
	word32 s2_110;
	word32 s3_111;
	word32 s4_112;
	word32 s5_113;
	word32 s6_114;
	word32 s7_115;
	word32 s8_116;
	word32 s9_117;
	word32 s10_118;
	word32 s11_119;
	word32 t4_120;
	printf(ra_21, &g_t230BBF78, a3_16, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_102, out a0_103, out a1_104, out a2_105, out a3_106, out a4_107, out a5_108, out a7_109, out s2_110, out s3_111, out s4_112, out s5_113, out s6_114, out s7_115, out s8_116, out s9_117, out s10_118, out s11_119, out t4_120);
}

// 23056BBE: void auth_pairing_failed(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack word32 dwArgF8)
void auth_pairing_failed(Eq_2 ra, word32 a0, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, word32 dwArgF8)
{
	Eq_2 a3_12;
	word32 s0_75;
	word32 s1_76;
	word32 s3_77;
	word32 s1_78;
	word32 a0_79;
	word32 a1_80;
	word32 a2_81;
	word32 a3_82;
	word32 a4_83;
	word32 a5_84;
	word32 a7_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	word32 s5_89;
	word32 s6_90;
	word32 s7_91;
	word32 s8_92;
	word32 s9_93;
	word32 s10_94;
	word32 s11_95;
	word32 t4_96;
	printf(bt_addr_le_to_str.constprop.14(ra, bt_conn_get_dst(a0), fp + -48, dwLoc28, dwArg04, dwArg20, dwArg24, dwArg48, dwArg6C, dwArgF8, out s0_75, out s1_76, out a3_12, out s3_77), &g_t230BBFA4, a3_12, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_78, out a0_79, out a1_80, out a2_81, out a3_82, out a4_83, out a5_84, out a7_85, out s2_86, out s3_87, out s4_88, out s5_89, out s6_90, out s7_91, out s8_92, out s9_93, out s10_94, out s11_95, out t4_96);
}

// 23056BE0: void identity_resolved(Register Eq_2 ra, Register (ptr32 byte) a2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg6C, Stack word32 dwArgD8)
void identity_resolved(Eq_2 ra, byte * a2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg6C, word32 dwArgD8)
{
	byte * s0_22;
	Eq_2 a3_43;
	word32 s1_110;
	word32 a3_111;
	word32 s3_112;
	word32 s0_113;
	word32 s1_114;
	word32 s3_115;
	word32 s1_116;
	word32 a0_117;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	word32 a5_122;
	word32 a7_123;
	word32 s2_124;
	word32 s3_125;
	word32 s4_126;
	word32 s5_127;
	word32 s6_128;
	word32 s7_129;
	word32 s8_130;
	word32 s9_131;
	word32 s10_132;
	word32 s11_133;
	word32 t4_134;
	printf(bt_addr_le_to_str.constprop.14(bt_addr_le_to_str.constprop.14(ra, a2, fp + -80, dwLoc48, dwLoc1C, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgD8, out s0_22, out s1_110, out a3_111, out s3_112), s0_22, fp + -48, dwLoc48, dwLoc1C, dwArg00, dwArg04, dwArg28, dwArg4C, dwArgD8, out s0_113, out s1_114, out a3_43, out s3_115), &g_t230BC990, a3_43, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_116, out a0_117, out a1_118, out a2_119, out a3_120, out a4_121, out a5_122, out a7_123, out s2_124, out s3_125, out s4_126, out s5_127, out s6_128, out s7_129, out s8_130, out s9_131, out s10_132, out s11_133, out t4_134);
}

// 23056C10: void ble_get_all_conn_info(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack word32 dwArgA8)
void ble_get_all_conn_info(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg1C, word32 dwArgA8)
{
	Eq_2 ra_68;
	Eq_2 a3_26;
	byte * a0_24 = bt_conn_get_remote_dev_info(fp + -88, out a3_26);
	ra_68 = ra;
	if (a0_24 > null)
	{
		Eq_2 a3_35;
		word32 s0_274;
		word32 s1_275;
		word32 s3_276;
		word32 s1_277;
		word32 a0_278;
		word32 a1_279;
		word32 a2_280;
		word32 a4_281;
		word32 a5_282;
		word32 a7_283;
		word32 s2_284;
		word32 s3_285;
		word32 s4_286;
		word32 s5_287;
		word32 s6_288;
		word32 s7_289;
		word32 s8_290;
		word32 s9_291;
		word32 s10_292;
		word32 s11_293;
		word32 t4_294;
		ra_68 = printf(bt_addr_le_to_str.constprop.14(ra, a0_24, fp + -0x0078, dwLoc78, dwLoc4C, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, dwArgA8, out s0_274, out s1_275, out a3_35, out s3_276), &g_t230BC20C, a3_35, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_277, out a0_278, out a1_279, out a2_280, out a3_26, out a4_281, out a5_282, out a7_283, out s2_284, out s3_285, out s4_286, out s5_287, out s6_288, out s7_289, out s8_290, out s9_291, out s10_292, out s11_293, out t4_294);
	}
	word32 s9_270;
	word32 s8_269;
	word32 s7_268;
	word32 s6_267;
	word32 s5_266;
	word32 s4_265;
	word32 a7_263;
	word32 s3_264;
	word32 a4_261;
	word32 a5_262;
	word32 a2_259;
	word32 a3_260;
	word32 a0_257;
	word32 a1_258;
	word32 s1_256;
	word32 s10_271;
	word32 s11_272;
	word32 t4_273;
	int32 s2_102;
	Eq_2 ra_123 = printf(ra_68, &g_t230BC22C, a3_26, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_256, out a0_257, out a1_258, out a2_259, out a3_260, out a4_261, out a5_262, out a7_263, out s2_102, out s3_264, out s4_265, out s5_266, out s6_267, out s7_268, out s8_269, out s9_270, out s10_271, out s11_272, out t4_273);
	ptr32 s0_112 = fp + -88;
	int32 s1_113 = 0x00;
	while (true)
	{
		struct Eq_314671 * s0_116 = s0_112 + 0x1C;
		if (s1_113 >= s2_102)
			break;
		Eq_2 a3_127;
		word32 s3_138;
		word32 s1_161;
		word32 s1_295;
		word32 a0_296;
		word32 a1_297;
		word32 a2_298;
		word32 a3_299;
		word32 a4_300;
		word32 a5_301;
		word32 a7_302;
		word32 s3_303;
		word32 s4_304;
		word32 s5_305;
		word32 s6_306;
		word32 s7_307;
		word32 s8_308;
		word32 s9_309;
		word32 s10_310;
		word32 s11_311;
		word32 t4_312;
		ra_123 = printf(bt_addr_le_to_str.constprop.14(ra_123, s0_116->ptrFFFFFFF4, fp + -0x0078, dwLoc78, dwLoc4C, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, dwArgA8, out s0_112, out s1_295, out a3_127, out s3_138), s3_138 + 592, a3_127, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_161, out a0_296, out a1_297, out a2_298, out a3_299, out a4_300, out a5_301, out a7_302, out s2_102, out s3_303, out s4_304, out s5_305, out s6_306, out s7_307, out s8_308, out s9_309, out s10_310, out s11_311, out t4_312);
		s1_113 = s1_161 + 0x01;
	}
}

