pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23056C82: void ble_write_without_rsp(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void ble_write_without_rsp(Eq_2 ra, word32 s0, Eq_2 s1, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB0, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	struct Eq_274 * a0_162;
	uint16 wLoc12_203 = SLICE(s0, uint16, 16);
	byte bLoc15_210 = SLICE(s2, byte, 24);
	if (a2 != 0x05)
		a0_162 = (struct Eq_274 *) &g_t230B67B4;
	else
	{
		if (g_t4200F4B0 != 0x00)
		{
			word32 a5_353;
			word32 a4_352;
			word32 a3_351;
			word32 a2_350;
			word32 a0_349;
			word32 a5_348;
			word32 a4_347;
			word32 a3_346;
			word32 a2_345;
			word32 a0_339;
			word32 a1_340;
			word32 a3_341;
			word32 a4_342;
			word32 s8_343;
			word32 a0_344;
			get_uint16_from_string(get_uint16_from_string(get_uint8_from_string(0x4200F4B0, (word32) a3 + 4, fp + ~0x14, out a0_339, out a1_340, out a3_341, out a4_342, out s8_343), (word32) a3 + 8, fp + ~0x13, out a0_344, out a2_345, out a3_346, out a4_347, out a5_348), (word32) a3 + 0x0C, fp + ~0x11, out a0_349, out a2_350, out a3_351, out a4_352, out a5_353);
			Eq_314811 a2_61 = (word32) wLoc12_203;
			if (a2_61 > 0x0200)
				a2_61.u0 = 0x0200;
			Eq_2 a0_73;
			Eq_2 s3_84;
			word32 s1_373;
			word32 a3_374;
			word32 s2_375;
			get_bytearray_from_string(0x42016DF4, (word32) (word16) a2_61, dwArg0108, out s1_373, out a0_73, out a3_374, out s2_375, out s3_84);
			Eq_2 a3_112;
			word32 s1_376;
			word32 a0_377;
			word32 a1_378;
			word32 a2_379;
			word32 a3_380;
			word32 a4_381;
			word32 a5_382;
			word32 a7_383;
			word32 s2_384;
			word32 s3_385;
			word32 s4_386;
			word32 s5_387;
			word32 s6_388;
			word32 s7_389;
			word32 s8_390;
			word32 s9_391;
			word32 s10_392;
			word32 s11_393;
			word32 t4_394;
			printf(bt_gatt_write_without_response_cb(ra, a0_73, (word32) (word16) a2_61, (word32) bLoc15_210, s3_84, s5, s6, mstatus, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg2C, dwArg48, dwArg4C, dwArg54, dwArg58, dwArg5C, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB0, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out a3_112), &g_t230BC774, a3_112, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_376, out a0_377, out a1_378, out a2_379, out a3_380, out a4_381, out a5_382, out a7_383, out s2_384, out s3_385, out s4_386, out s5_387, out s6_388, out s7_389, out s8_390, out s9_391, out s10_392, out s11_393, out t4_394);
			return;
		}
		a0_162 = (struct Eq_274 *) &g_t230B9228;
	}
	word32 a3_358;
	word32 a4_359;
	word32 a5_360;
	word32 a2_357;
	word32 a1_356;
	word32 a0_355;
	word32 s1_354;
	word32 a7_361;
	word32 s2_362;
	word32 s3_363;
	word32 s4_364;
	word32 s5_365;
	word32 s6_366;
	word32 s7_367;
	word32 s8_368;
	word32 s9_369;
	word32 s10_370;
	word32 s11_371;
	word32 t4_372;
	printf(ra, a0_162, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_354, out a0_355, out a1_356, out a2_357, out a3_358, out a4_359, out a5_360, out a7_361, out s2_362, out s3_363, out s4_364, out s5_365, out s6_366, out s7_367, out s8_368, out s9_369, out s10_370, out s11_371, out t4_372);
}

// 23056D38: void ble_cli_register()
// Called from:
//      bt_enable_cb
void ble_cli_register()
{
}

// 23056D3C: void ble_tp_recv()
void ble_tp_recv()
{
}

// 23056D40: void ble_tp_disconnected(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void ble_tp_disconnected(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_45;
	word32 a0_46;
	word32 a1_47;
	word32 a2_48;
	word32 a3_49;
	word32 a4_50;
	word32 a5_51;
	word32 a7_52;
	word32 s2_53;
	word32 s3_54;
	word32 s4_55;
	word32 s5_56;
	word32 s6_57;
	word32 s7_58;
	word32 s8_59;
	word32 s9_60;
	word32 s10_61;
	word32 s11_62;
	word32 t4_63;
	printf(ra, &g_t230ABB4C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_45, out a0_46, out a1_47, out a2_48, out a3_49, out a4_50, out a5_51, out a7_52, out s2_53, out s3_54, out s4_55, out s5_56, out s6_57, out s7_58, out s8_59, out s9_60, out s10_61, out s11_62, out t4_63);
	g_t42026640.u0 = 0x00;
}

// 23056D66: void ble_tp_connected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void ble_tp_connected(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB0, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	Eq_2 ra_110;
	Eq_2 s1_111;
	Eq_2 a5_18;
	Eq_2 a3_22;
	Eq_2 a4_23;
	Eq_2 s1_26;
	Eq_2 s2_29;
	Eq_2 s3_30;
	word32 t4_359;
	word32 s11_358;
	word32 s10_357;
	word32 s9_356;
	word32 s8_355;
	word32 s7_354;
	word32 s6_353;
	word32 s5_352;
	word32 a0_347;
	word32 a1_348;
	word32 a2_349;
	word32 a7_350;
	word32 s4_351;
	Eq_2 ra_25 = printf(ra, &g_t230ABB4C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_26, out a0_347, out a1_348, out a2_349, out a3_22, out a4_23, out a5_18, out a7_350, out s2_29, out s3_30, out s4_351, out s5_352, out s6_353, out s7_354, out s8_355, out s9_356, out s10_357, out s11_358, out t4_359);
	g_t42026640 = s1_26;
	word32 a0_46;
	Eq_2 a3_49;
	ptr32 mstatus_54;
	Eq_2 s0_56;
	Eq_2 ra_55 = bt_le_set_data_len(ra_25, s1_26, a3_22, a4_23, a5_18, s2_29, s3_30, mstatus, s0, dwLoc08, dwArg08, dwArg28, dwArg40, dwArg44, dwArg50, dwArg64, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_56, out a0_46, out a3_49, out mstatus_54);
	if (a0_46 == 0x00)
	{
		word32 a0_378;
		word32 a1_379;
		word32 a2_380;
		word32 a3_381;
		word32 a4_382;
		word32 a5_383;
		word32 a7_384;
		word32 s2_385;
		word32 s3_386;
		word32 s4_387;
		word32 s5_388;
		word32 s6_389;
		word32 s7_390;
		word32 s8_391;
		word32 s9_392;
		word32 s10_393;
		word32 s11_394;
		word32 t4_395;
		ra_110 = printf(ra_55, &g_t230BCD4C, a3_49, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_111, out a0_378, out a1_379, out a2_380, out a3_381, out a4_382, out a5_383, out a7_384, out s2_385, out s3_386, out s4_387, out s5_388, out s6_389, out s7_390, out s8_391, out s9_392, out s10_393, out s11_394, out t4_395);
	}
	else
	{
		word32 a3_363;
		word32 a2_362;
		word32 a1_361;
		word32 a0_360;
		word32 a4_364;
		word32 a5_365;
		word32 a7_366;
		word32 s2_367;
		word32 s3_368;
		word32 s4_369;
		word32 s5_370;
		word32 s6_371;
		word32 s7_372;
		word32 s8_373;
		word32 s9_374;
		word32 s10_375;
		word32 s11_376;
		word32 t4_377;
		ra_110 = printf(ra_55, &g_t230BCD70, a3_49, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_111, out a0_360, out a1_361, out a2_362, out a3_363, out a4_364, out a5_365, out a7_366, out s2_367, out s3_368, out s4_369, out s5_370, out s6_371, out s7_372, out s8_373, out s9_374, out s10_375, out s11_376, out t4_377);
	}
	Eq_2 a0_126 = *((word32) s0_56 + 1600);
	g_dw23056E8E = 0x42026620;
	word32 a0_137;
	Eq_2 a3_138;
	Eq_2 ra_146 = bt_gatt_exchange_mtu(ra_110, s0_56, s1_111, a0_126, mstatus_54, dwLoc10, s0, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB0, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out a0_137, out a3_138);
	if (a0_137 != 0x00)
	{
		word32 s1_415;
		word32 a0_416;
		word32 a1_417;
		word32 a2_418;
		word32 a3_419;
		word32 a4_420;
		word32 a5_421;
		word32 a7_422;
		word32 s2_423;
		word32 s3_424;
		word32 s4_425;
		word32 s5_426;
		word32 s6_427;
		word32 s7_428;
		word32 s8_429;
		word32 s9_430;
		word32 s10_431;
		word32 s11_432;
		word32 t4_433;
		printf(ra_146, &g_t230BCDC0, a3_138, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_415, out a0_416, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
	}
	else
	{
		word32 s1_396;
		word32 a0_397;
		word32 a1_398;
		word32 a2_399;
		word32 a3_400;
		word32 a4_401;
		word32 a5_402;
		word32 a7_403;
		word32 s2_404;
		word32 s3_405;
		word32 s4_406;
		word32 s5_407;
		word32 s6_408;
		word32 s7_409;
		word32 s8_410;
		word32 s9_411;
		word32 s10_412;
		word32 s11_413;
		word32 t4_414;
		printf(ra_146, &g_t230BCD9C, a3_138, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_396, out a0_397, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a7_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409, out s8_410, out s9_411, out s10_412, out s11_413, out t4_414);
	}
}

// 23056E04: void ble_tp_ccc_cfg_changed(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void ble_tp_ccc_cfg_changed(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	if (a1 != 0x01)
	{
		Eq_2 a5_17;
		Eq_2 a3_21;
		Eq_2 a4_22;
		word32 a0_189;
		word32 s1_188;
		word32 a1_190;
		word32 a2_191;
		word32 a7_192;
		word32 s2_193;
		word32 s3_194;
		word32 s4_195;
		word32 s5_196;
		word32 s6_197;
		word32 s7_198;
		word32 s8_199;
		word32 s9_200;
		word32 s10_201;
		word32 s11_202;
		word32 t4_203;
		printf(ra, &g_t230BCD2C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_188, out a0_189, out a1_190, out a2_191, out a3_21, out a4_22, out a5_17, out a7_192, out s2_193, out s3_194, out s4_195, out s5_196, out s6_197, out s7_198, out s8_199, out s9_200, out s10_201, out s11_202, out t4_203);
		Eq_2 a0_38 = g_t4202663C;
		word32 a0_228;
		word32 a3_229;
		word32 a4_230;
		word32 a5_231;
		word32 s2_232;
		vTaskDelete(a0_38, dwArg10, a3_21, a4_22, a5_17, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_228, out a3_229, out a4_230, out a5_231, out s2_232);
	}
	else
	{
		struct Eq_274 * a0_101;
		word32 a0_68;
		Eq_2 a3_71;
		word32 s1_76;
		word32 a2_204;
		word32 a4_205;
		word32 a5_206;
		word32 s2_207;
		word32 s3_208;
		Eq_2 ra_86 = xTaskCreate(ra, a1, 0x0100, 0x00, 0x0F, 0x4202663C, s3, mstatus, dwArg00, dwArg04, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s1_76, out a0_68, out a2_204, out a3_71, out a4_205, out a5_206, out s2_207, out s3_208);
		if (a0_68 == s1_76)
			a0_101 = (struct Eq_274 *) &g_t230BCCE0;
		else
			a0_101 = (struct Eq_274 *) &g_t230BCD08;
		word32 s1_209;
		word32 a0_210;
		word32 a1_211;
		word32 a2_212;
		word32 a3_213;
		word32 a4_214;
		word32 a5_215;
		word32 a7_216;
		word32 s2_217;
		word32 s3_218;
		word32 s4_219;
		word32 s5_220;
		word32 s6_221;
		word32 s7_222;
		word32 s8_223;
		word32 s9_224;
		word32 s10_225;
		word32 s11_226;
		word32 t4_227;
		printf(ra_86, a0_101, a3_71, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_209, out a0_210, out a1_211, out a2_212, out a3_213, out a4_214, out a5_215, out a7_216, out s2_217, out s3_218, out s4_219, out s5_220, out s6_221, out s7_222, out s8_223, out s9_224, out s10_225, out s11_226, out t4_227);
	}
}

// 23056E76: void ble_tp_tx_mtu_size(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ble_tp_tx_mtu_size(Eq_2 ra, word32 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	struct Eq_274 * a0_40;
	if (a1 == 0x00)
	{
		word32 a0_13;
		word32 s10_92;
		word32 s4_91;
		word32 s3_90;
		word32 s2_89;
		word32 a4_88;
		word32 s11_93;
		ra = bt_gatt_get_mtu(ra, g_t42026640, a3, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out a0_13, out a3, out a4_88, out s2_89, out s3_90, out s4_91, out s10_92, out s11_93);
		g_dw4200FC6C = a0_13;
		dwArg74 = ra;
		a0_40 = (struct Eq_274 *) &g_t230BCDEC;
	}
	else
		a0_40 = (struct Eq_274 *) &g_t230BCE1C;
	word32 s1_94;
	word32 a0_95;
	word32 a1_96;
	word32 a2_97;
	word32 a3_98;
	word32 a4_99;
	word32 a5_100;
	word32 a7_101;
	word32 s2_102;
	word32 s3_103;
	word32 s4_104;
	word32 s5_105;
	word32 s6_106;
	word32 s7_107;
	word32 s8_108;
	word32 s9_109;
	word32 s10_110;
	word32 s11_111;
	word32 t4_112;
	printf(ra, a0_40, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_94, out a0_95, out a1_96, out a2_97, out a3_98, out a4_99, out a5_100, out a7_101, out s2_102, out s3_103, out s4_104, out s5_105, out s6_106, out s7_107, out s8_108, out s9_109, out s10_110, out s11_111, out t4_112);
}

word32 g_dw23056E8E = 0x85AAC6A7;
// 23056EAC: void ble_tp_notify_task(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s4, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus)
void ble_tp_notify_task(Eq_2 ra, Eq_2 s0, Eq_2 s4, struct Eq_2096 * s11, ptr32 mstatus)
{
	word32 a5_179;
	word32 a4_178;
	word32 a3_177;
	word32 a2_176;
	word32 a1_175;
	word32 a0_174;
	word32 t1_173;
	Eq_2 ra_27 = memset(ra, fp + -268, 0x00, 0x00EC, out t1_173, out a0_174, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179);
	struct Eq_315530 * s5_39 = &g_dw42026000;
	struct Eq_315532 * s4_40 = &g_t4200F000;
	Eq_2 s1_41 = 1107353532;
	Eq_2 dwLoc010C_149 = SEQ(nLoc010B, 0x09);
	while (true)
	{
		Eq_2 s2_47 = s5_39->t0640;
		Eq_2 a2_56;
		Eq_2 a4_58;
		word32 s10_197;
		word32 s9_196;
		word32 s8_195;
		word32 s7_194;
		word32 s6_193;
		word32 s3_192;
		word32 s2_191;
		word32 a5_190;
		word32 a4_189;
		word32 a3_188;
		word32 a1_187;
		word32 a0_186;
		word32 s0_185;
		word32 a5_184;
		word32 a3_183;
		word32 a1_182;
		word32 a0_181;
		word32 t1_180;
		ra_27 = bt_gatt_notify_cb(memset(ra_27, fp + -300, 0x00, 0x18, out t1_180, out a0_181, out a1_182, out a2_56, out a3_183, out a4_58, out a5_184), (word32) (word16) (s4_40->dwFFFFFC6C + ~0x02), s2_47, a2_56, a4_58, s2_47, s11, mstatus, dwLoc0130, s1_41, dwLoc0128, dwLoc0124, dwLoc011C, dwLoc0118, dwLoc0114, dwLoc0110, dwLoc010C_149, dwLoc0108, dwLoc0104, dwLocEC, dwLocE8, dwLocE4, dwLocD8, dwLocC8, dwLocC4, dwLocB8, dwLocA8, dwLoc98, dwLoc90, dwLoc88, dwLoc78, dwLoc68, dwLoc58, dwLoc48, dwLoc38, s4, s0, out s0_185, out s1_41, out a0_186, out a1_187, out a3_188, out a4_189, out a5_190, out s2_191, out s3_192, out s4_40, out s5_39, out s6_193, out s7_194, out s8_195, out s9_196, out s10_197, out s11, out mstatus);
	}
}

// 23056F2E: void ble_tp_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      bt_enable_cb
void ble_tp_init(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	bt_conn_cb_register(&g_dw4200E00C, a4);
	word32 s0_76;
	word32 s1_77;
	word32 a3_78;
	word32 s5_79;
	word32 mstatus_80;
	bt_gatt_service_register(ra, s0, a3, a4, s4, s5, s6, s11, mstatus, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg70, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0128, out s0_76, out s1_77, out a3_78, out s5_79, out mstatus_80);
}

