pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23056F4E: Register word32 polling_events.constprop.1(Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_282782 a5, Register ptr32 mstatus, Stack word32 dwArg010C, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_282782 a5Out, Register out ptr32 s7Out)
// Called from:
//      k_poll
word32 polling_events.constprop.1(Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 a4, Eq_282782 a5, ptr32 mstatus, word32 dwArg010C, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_282782 & a5Out, ptr32 & s7Out)
{
	Eq_2 s9_170 = a0;
	Eq_282782 s0_168 = 0x00;
	ptr32 s2_102 = 0x01;
	a3_121 = a3;
	while (true)
	{
		Eq_2 a3_121;
		if (s0_168 >= a5)
			break;
		word32 a4_343;
		word32 a5_344;
		struct Eq_315667 * a2_133;
		irq_lock(a4, mstatus, out a2_133, out a4_343, out a5_344);
		Eq_2 a4_62 = *((word32) s9_170 + 0x0C) >> 8 & 0x0F;
		if (a4_62 != 0x02)
		{
			if (a4_62 != 0x03)
			{
				if (a4_62 != 0x01)
					goto l23056FCE;
				a2_133 = (struct Eq_315667 *) 0x02;
				if (*((word32) *((word32) s9_170 + 16) + 8) == 0x00)
					goto l23056FCE;
				goto l23057010;
			}
			word32 a5_347;
			word32 a4_346;
			if (k_queue_is_empty(*((word32) s9_170 + 16), a3_121, a4_62, mstatus, out a2_133, out a3_121, out a4_346, out a5_347) != 0x00)
				goto l23056FCE;
			a2_133 = (struct Eq_315667 *) 0x04;
			goto l23057010;
		}
		word32 a4_345;
		if (k_sem_count_get(*((word32) s9_170 + 16), a3_121, a4_62, mstatus, out a2_133, out a3_121, out a4_345) != 0x00)
		{
			a2_133 = (struct Eq_315667 *) 0x03;
l23057010:
			Eq_315728 a3_86 = *((word32) s9_170 + 0x0C);
			*((word32) s9_170 + 8) = 0x00;
			*((word32) s9_170 + 0x0C) = (a3_86 >> 0x0C & 0x0F | a2_133) << 0x0C | a3_86 & ~0x0F000000;
			s2_102 = 0x00;
			a3_121 = a3_86 & ~0x0F000000;
		}
		else
		{
l23056FCE:
			if (a2 != 0x00 && s2_102 != 0x00)
			{
				ui32 a4_107 = *((word32) s9_170 + 0x0C) >> 8 & 0x0F;
				if (a4_107 != 0x02 && a4_107 != 0x03)
				{
					if (a4_107 == 0x01)
					{
						*s9_170 = *((word32) s9_170 + 16);
						a3_121 = a2_133->t0004;
						*((word32) s9_170 + 4) = a2_133;
						struct Eq_315826 * a4_136 = (word32) a0 + ((word32) s0_168 + 20);
						a4_136->ptr0000 = a2_133;
						a4_136->t0004 = a3_121;
					}
				}
				else
				{
					struct Eq_315771 * a3_118 = *((word32) s9_170 + 16);
					*s9_170 = (char *) a3_118 + 4;
					a3_121 = a3_118->t000C;
					*((word32) s9_170 + 4) = (char *) a3_118 + 4;
					struct Eq_315787 * a4_126 = (word32) a0 + ((word32) s0_168 + 20);
					a4_126->ptr0000 = (char *) a3_118 + 4;
					a4_126->t0008 = a3_121;
				}
				*((word32) s9_170 + 8) = 0x00;
				*a3 = (word32) *a3 + 1;
			}
		}
		a3_121 = irq_unlock(a3_121, mstatus, out a4, out a5);
		s0_168 = (word32) s0_168.u0 + 1;
		s9_170 = (word32) s9_170 + 20;
	}
	0x00 = dwArg010C;
	s1Out = dwLoc4C;
	a0Out = s2_102;
	a2Out = dwArg01A8;
	a3Out = s2;
	a4Out = a4;
	a5Out = a5;
	s7Out = 0x03;
	return dwLoc08;
}

// 23057074: Register word32 k_poll_event_init(Register ui32 a1, Register ui32 a2, Register (ptr32 Eq_259348) a3, Register out ptr32 a5Out)
// Called from:
//      bt_conn_prepare_events
word32 k_poll_event_init(ui32 a1, ui32 a2, struct Eq_259348 * a3, ptr32 & a5Out)
{
	struct Eq_315840 * a0_7 = (a1 & 0x0F)->ptr000C;
	a0_7->dw0008 = 0x00;
	(((a1 & 0x0F & 0xFF0000FF | (a1 & 0x0F) << 0x08) & ~0x10000000 | (a2 & 0x01) << 16) & 0x10FFFFFF)->ptr000C = a0_7;
	a3->ptr0010 = a0_7;
	a5Out = ~0x10000000;
	return 0xFF0000FF;
}

// 230570A2: Register Eq_2 k_poll(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Register Eq_2 a4, Register Eq_282782 a5, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack word32 dwArgDC, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_282807) a5Out, Register out ptr32 s3Out, Register out Eq_282809 s4Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      hci_tx_thread
Eq_2 k_poll(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 a4, Eq_282782 a5, ptr32 mstatus, Eq_2 dwArgD8, word32 dwArgDC, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_282807 & a5Out, ptr32 & s3Out, union Eq_282809 & s4Out, ptr32 & s7Out, ptr32 & s8Out)
{
	word32 a0_30;
	Eq_2 a2_31;
	Eq_2 a5_34;
	Eq_2 a4_33;
	Eq_2 s1_108;
	ptr32 s7_251;
	Eq_2 a3_135;
	Eq_2 ra_235 = polling_events.constprop.1(a0, a2, fp + -36, a4, a5, mstatus, dwArgDC, out s1_108, out a0_30, out a2_31, out a3_135, out a4_33, out a5_34, out s7_251);
	if (a0_30 != 0x00)
	{
		Eq_2 a4_59;
		Eq_282782 a5_60;
		word32 s1_63;
		word32 a3_276;
		word32 a0_274;
		word32 a1_275;
		word32 s2_277;
		word32 s4_279;
		word32 s3_278;
		word32 s8_280;
		word32 a2_282;
		word32 a0_281;
		word32 a5_283;
		ra_235 = polling_events.constprop.1(k_sem_take(&g_dw42026644, s1_108, a2_31, a3_135, a4_33, a5_34, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_63, out a0_274, out a1_275, out a3_276, out a4_59, out a5_60, out s2_277, out s3_278, out s4_279, out s8_280), s1_63, fp + -36, a4_59, a5_60, mstatus, dwArgDC, out s1_108, out a0_281, out a2_282, out a3_135, out a4_33, out a5_283, out s7_251);
	}
	word32 a2_272;
	word32 a5_273;
	struct Eq_315899 * a4_101;
	irq_lock(a4_33, mstatus, out a2_272, out a4_101, out a5_273);
	struct Eq_315905 * a5_109 = (word32) s1_108 + 20;
	while (s1_108 >= 0x00)
	{
		a5_109->ptr000C->dw0008 = 0x00;
		uint32 a5_120 = a5_109 >> 8;
		if ((a5_120 & 0x0F) == 0x02 || ((a5_120 & 0x0F) == 0x03 || (a5_120 & 0x0F) == 0x01))
		{
			*(a5_120 & 0x0F) = (struct Eq_315899 **) a4_101;
			a4_101->dw0004 = a5_120 & 0x0F;
		}
		Eq_2 a4_141;
		word32 a5_284;
		a3_135 = irq_unlock(a3_135, mstatus, out a4_141, out a5_284);
		word32 a2_285;
		irq_lock(a4_141, mstatus, out a2_285, out a4_101, out a5_109);
		s1_108 = (word32) s1_108 - 1;
	}
	ptr32 a4_157;
	struct Eq_282807 * a5_158;
	Eq_2 a3_156 = irq_unlock(a3_135, mstatus, out a4_157, out a5_158);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_108;
	a0Out = 0x00;
	a3Out = a3_156;
	a4Out = a4_157;
	a5Out = a5_158;
	s3Out = 0x02;
	s4Out = dwArg78;
	s7Out = s7_251;
	s8Out = s5;
	return ra_235;
}

// 23057142: void k_poll_signal_raise(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_316005) a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void k_poll_signal_raise(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_316005 * a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_316016 * a4_18;
	word32 a2_136;
	word32 a5_137;
	irq_lock(a4, mstatus, out a2_136, out a4_18, out a5_137);
	*(union Eq_2 *) 0x09 = a0;
	Eq_2 s0_23 = *(union Eq_2 *) 0x01;
	a1->t000C = s0_23;
	if (s0_23 != 0x01)
	{
		a4_18->t0000 = a3;
		*((word32) a3 + 4) = a4_18;
		Eq_2 a5_34 = a4_18->t000C;
		*((word32) a5_34 + 8) = 0x00;
		(a4_18 | 0x02000000)->t000C = a5_34;
		word32 s0_138;
		word32 s1_139;
		word32 a0_140;
		word32 a1_141;
		word32 a2_142;
		word32 a4_143;
		word32 a5_144;
		word32 s2_145;
		word32 s3_146;
		word32 s4_147;
		word32 s5_148;
		word32 s6_149;
		word32 s7_150;
		word32 s8_151;
		word32 s9_152;
		word32 s10_153;
		word32 s11_154;
		k_sem_give(ra, 0x42026644, 0x02000000, a4_18 | 0x02000000, a5_34, mstatus, dwLoc0C, dwLoc08, dwArg40, dwArg44, s1, dwArg74, dwArg8C, dwArgE8, dwArg0128, dwArg0168, out s0_138, out s1_139, out a0_140, out a1_141, out a2_142, out a3, out a4_143, out a5_144, out s2_145, out s3_146, out s4_147, out s5_148, out s6_149, out s7_150, out s8_151, out s9_152, out s10_153, out s11_154);
	}
	word32 a4_155;
	word32 a5_156;
	irq_unlock(a3, mstatus, out a4_155, out a5_156);
}

// 23057198: Register Eq_2 bt_rpa_irk_matches(Register Eq_2 ra, Register ptr32 a0, Register ptr32 a1, Register out (ptr32 Eq_307373) s0Out, Register out (ptr32 Eq_307374) s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      bt_keys_find_irk
Eq_2 bt_rpa_irk_matches(Eq_2 ra, ptr32 a0, ptr32 a1, struct Eq_307373 & s0Out, struct Eq_307374 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	ptr32 a0_112;
	word32 a3_142;
	word32 a2_141;
	word32 a1_140;
	word32 a4_143;
	word32 a5_144;
	word32 a6_145;
	word32 a7_146;
	memcpy(fp + -32, a1 + 0x03, 0x03, out a1_140, out a2_141, out a3_142, out a4_143, out a5_144, out a6_145, out a7_146);
	word32 a0_45;
	Eq_2 s0_54;
	struct Eq_307374 * s1_55;
	ptr32 s2_56;
	ptr32 s3_67;
	ptr32 s5_68;
	word32 t1_147;
	word32 a0_148;
	word32 a1_149;
	word32 a2_150;
	word32 a3_151;
	word32 a4_152;
	word32 a5_153;
	word32 a1_154;
	word32 a4_155;
	word32 a5_156;
	word32 s4_157;
	Eq_2 ra_66 = bt_encrypt_le(memset(ra, fp + -29, 0x00, 0x0D, out t1_147, out a0_148, out a1_149, out a2_150, out a3_151, out a4_152, out a5_153), a0, out s0_54, out s1_55, out a0_45, out a1_154, out a4_155, out a5_156, out s2_56, out s3_67, out s4_157, out s5_68);
	if (a0_45 == 0x00)
	{
		word32 a1_158;
		word32 a2_159;
		word32 a3_160;
		word32 a4_161;
		word32 a5_162;
		word32 a6_163;
		word32 a7_164;
		memcpy(fp + -36, fp + -32, 0x03, out a1_158, out a2_159, out a3_160, out a4_161, out a5_162, out a6_163, out a7_164);
		word32 a1_165;
		word32 a2_166;
		word32 a3_167;
		word32 a4_168;
		word32 a5_169;
		a0_112 = (word32) (memcmp(s0_54, fp + -36, 0x03, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169) < 1);
	}
	else
		a0_112 = 0x00;
	s0Out = dwArgE4;
	s1Out = s1_55;
	a0Out = a0_112;
	s2Out = s2_56;
	s3Out = s3_67;
	s5Out = s5_68;
	return ra_66;
}

// 230571EC: Register word32 u8_to_dec(Register (ptr32 byte) a0, Register ui32 a1, Register Eq_2 a2)
// Called from:
//      bt_gatt_connected
word32 u8_to_dec(byte * a0, ui32 a1, Eq_2 a2)
{
	word32 a3_10 = 0x04;
	ui32 a5_15 = 0x00;
	Eq_2 a4_12 = 100;
	while (a1 != 0x00)
	{
		a3_10 += ~0x00;
		if (a3_10 == 0x00)
		{
			*a0 = 0x00;
			return a3_10;
		}
		uint32 a6_13 = a2 >> a4_12;
		if (a2 >= a4_12 || (a4_12 == 0x01 || a5_15 != 0x00))
		{
			*a0 = (byte) (a6_13 + 48);
			a1 = a1 + ~0x00 & 0x00FF;
			++a0;
			a5_15 = a5_15 + 0x01 & 0x00FF;
		}
		a2 &= a4_12;
		a4_12 >>= 0x0A;
	}
	return a3_10;
}

// 23057234: void add_round_key(Register (ptr32 Eq_316253) a0, Register Eq_2 a1)
// Called from:
//      tc_aes_encrypt
void add_round_key(struct Eq_316253 * a0, Eq_2 a1)
{
	a0->b0000 = (byte) ((word32) *((word32) a1 + 3) ^ (word32) a0->b0000);
	uint32 a5_12 = (word32) *((word32) a1 + 2) ^ (word32) a0->b0001;
	a0->b0001 = (byte) a5_12;
	struct Eq_316294 ** a5_17 = a5_12 >> 8 ^ (word32) a0->b0002;
	a0->b0002 = (byte) a5_17;
	struct Eq_316294 * a1_19 = *a5_17;
	a0->b0003 = (byte) (a5_17 ^ (word32) a0->b0003);
	a0->b0004 = (byte) ((word32) a1_19->b0007 ^ (word32) a0->b0004);
	uint32 a5_29 = (word32) a1_19->w0006 ^ (word32) a0->b0005;
	a0->b0005 = (byte) a5_29;
	struct Eq_316334 * a5_34 = a5_29 >> 8 ^ (word32) a0->b0006;
	a0->b0006 = (byte) a5_34;
	struct Eq_316346 * a1_36 = a5_34->ptr0004;
	a0->b0007 = (byte) (a5_34 ^ (word32) a0->b0007);
	a0->b0008 = (byte) ((word32) a1_36->b000B ^ (word32) a0->b0008);
	uint32 a5_46 = (word32) a1_36->w000A ^ (word32) a0->b0009;
	a0->b0009 = (byte) a5_46;
	struct Eq_316386 * a5_51 = a5_46 >> 8 ^ (word32) a0->b000A;
	a0->b000A = (byte) a5_51;
	struct Eq_316398 * a1_53 = a5_51->ptr0008;
	a0->b000B = (byte) (a5_51 ^ (word32) a0->b000B);
	a0->b000C = (byte) ((word32) a1_53->b000F ^ (word32) a0->b000C);
	uint32 a5_63 = (word32) a1_53->w000E ^ (word32) a0->b000D;
	a0->b000D = (byte) a5_63;
	ui32 a5_68 = a5_63 >> 8 ^ (word32) a0->b000E;
	a0->b000E = (byte) a5_68;
	a0->b000F = (byte) (a5_68 ^ (word32) a0->b000F);
}

// 2305730E: void shift_rows(Register Eq_2 a0)
// Called from:
//      tc_aes_encrypt
void shift_rows(Eq_2 a0)
{
	word32 a3_76;
	word32 a4_77;
	word32 a5_78;
	_copy(a0, 0x10, fp + ~0x1F, 0x10, out a3_76, out a4_77, out a5_78);
}

// 230573A2: Register (ptr32 Eq_316473) mult_row_column(Register Eq_2 a0, Register (ptr32 Eq_316473) a1, Register out Eq_316476 s1Out, Register out Eq_316477 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      tc_aes_encrypt
struct Eq_316473 * mult_row_column(Eq_2 a0, struct Eq_316473 * a1, union Eq_316476 & s1Out, union Eq_316477 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	*a0 = (byte) (_double_byte((word32) a1->b0000) ^ (((word32) a1->b0001 ^ (word32) a1->b0002) ^ (word32) a1->b0003) ^ _double_byte((word32) a1->b0001));
	*((word32) a0 + 1) = (byte) (_double_byte((word32) a1->b0001) ^ (((word32) a1->b0000 ^ (word32) a1->b0002) ^ (word32) a1->b0003) ^ _double_byte((word32) a1->b0002));
	word32 s1_53 = (word32) a1->b0001;
	word32 s2_54 = (word32) a1->b0000;
	word32 a0_55 = _double_byte((word32) a1->b0002);
	word32 a0_61 = _double_byte((word32) a1->b0003);
	Eq_316477 s2_65 = s2_54 ^ s1_53 ^ (word32) a1->b0003;
	*((word32) a0 + 2) = (byte) (a0_55 ^ s2_65 ^ a0_61);
	ui32 s1_78 = (word32) a1->b0000 ^ (word32) a1->b0001 ^ (word32) a1->b0002 ^ _double_byte((word32) a1->b0000);
	*((word32) a0 + 3) = (byte) (_double_byte((word32) a1->b0003) ^ s1_78 & 0x00FF);
	s1Out = s1_78 & 0x00FF;
	s2Out = s2_65;
	s3Out = a0;
	s4Out = dwArg04;
	return a1;
}

// 23057476: Register Eq_2 tc_aes128_set_encrypt_key(Register (ptr32 Eq_214961) a0, Register Eq_2 a1, Register out (ptr32 Eq_214961) s1Out, Register out ptr32 a0Out, Register out Eq_255067 a1Out, Register out Eq_255068 a3Out, Register out (ptr32 word32) a4Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      tc_cmac_setup
//      bt_encrypt_le
//      bt_encrypt_be
Eq_2 tc_aes128_set_encrypt_key(struct Eq_214961 * a0, Eq_2 a1, struct Eq_214961 & s1Out, ptr32 & a0Out, union Eq_255067 & a1Out, union Eq_255068 & a3Out, word32 & a4Out, ptr32 & s4Out, ptr32 & s8Out)
{
	word32 a5_180;
	word32 a6_181;
	word32 a7_182;
	word32 a2_179;
	word32 * a4_137;
	Eq_255067 a1_132;
	Eq_255068 a3_134;
	memcpy(fp + -60, 587976264, 44, out a1_132, out a2_179, out a3_134, out a4_137, out a5_180, out a6_181, out a7_182);
	ptr32 a0_103 = 0x00;
	if (a0 != null && a1 != 0x00)
	{
		Eq_2 a1_32 = a1;
		struct Eq_214961 * a4_35 = a0;
		do
		{
			a1_32 = (word32) a1_32 + 4;
			ui32 a3_48 = (word32) *((word32) a1_32 - 2);
			++a4_35;
			struct Eq_316660 * a5_50 = (word32) *a1_32 << 24 | (word32) (*((word32) a1_32 + 1)) << 16 | (word32) (*((word32) a1_32 - 1)) | a3_48 << 8;
			a4_35[0x03FF] = (struct Eq_214961) a5_50;
			a3_134 = a3_48 << 8;
		} while ((word32) a1 + 16 != a1_32);
		a1_132.u0 = 0x04;
		do
		{
			a4_137 = a1_132 & 3;
			if (a4_137 == null)
			{
				uint32 a5_64 = a5_50 >> 24 | a5_50 << 0x08;
				a4_137 = (word32) (a5_64 >> 0x10 & 0x00FF)->b230BCE74 << 16 | ((word32) (a5_64 >> 0x18)->b230BCE74 << 24 | (word32) (a5_64 & 0x00FF)->b230BCE74) | (word32) (a5_64 >> 0x08 & 0x00FF)->b230BCE74 << 8;
				a3_134 = fp + -16;
				a5_50 = ((a1_132 & -4) + (fp + -16))->dwFFFFFFD4 ^ a4_137;
			}
			a5_50 = a5_50 ^ a4_137;
			a5_50->dw000C = *a4_137 + 0x04;
			a1_132 = (word32) a1_132.u0 + 1;
		} while (a1_132 != 44);
		a0_103 = 0x01;
	}
	s1Out = a0;
	a0Out = a0_103;
	a1Out = a1_132;
	a3Out = a3_134;
	a4Out = a4_137;
	s4Out = dwArgF4;
	s8Out = dwArgD4;
	return a1;
}

// 23057550: Register Eq_2 tc_aes_encrypt(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out (ptr32 Eq_255111) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_255115 a3Out, Register out (ptr32 Eq_255116) a4Out, Register out (ptr32 Eq_255117) a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s8Out)
// Called from:
//      tc_cmac_setup
//      tc_cmac_update
//      tc_cmac_final
//      bt_encrypt_le
//      bt_encrypt_be
Eq_2 tc_aes_encrypt(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, struct Eq_255111 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_255115 & a3Out, struct Eq_255116 & a4Out, struct Eq_255117 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s8Out)
{
	if (a0 == 0x00 || (a1 == 0x00 || a2 == 0x00))
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = 0x00;
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = null;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		return ra;
	}
	else
	{
		word32 a5_350;
		word32 a4_349;
		word32 a3_348;
		_copy(fp + -64, 0x10, a1, 0x10, out a3_348, out a4_349, out a5_350);
		add_round_key(fp + -64, a2);
		Eq_2 s5_157 = (word32) a2 + 16;
		Eq_2 s3_134 = fp + -48;
		ptr32 s4_135 = 587976308;
		do
		{
			Eq_2 a5_56 = fp + -64;
			do
			{
				a5_56 = (word32) a5_56 + 1;
				*((word32) a5_56 + 0x0FFF) = (byte) (word32) ((word32) *a5_56 + s4_135);
			} while (a5_56 != s3_134);
			shift_rows(fp + -64);
			word32 s3_353;
			word32 s2_352;
			word32 s4_354;
			word32 s1_351;
			mult_row_column(s3_134, fp + -64, out s1_351, out s2_352, out s3_353, out s4_354);
			word32 s1_355;
			word32 s2_356;
			word32 s3_357;
			word32 s4_358;
			mult_row_column(fp + -44, fp + -60, out s1_355, out s2_356, out s3_357, out s4_358);
			word32 s1_359;
			word32 s2_360;
			word32 s3_361;
			word32 s4_362;
			mult_row_column(fp + -40, fp + -56, out s1_359, out s2_360, out s3_361, out s4_362);
			Eq_2 s2_133;
			Eq_2 s1_132;
			Eq_2 s0_131 = mult_row_column(fp + -36, fp + -52, out s1_132, out s2_133, out s3_134, out s4_135);
			word32 a3_363;
			word32 a4_364;
			word32 a5_365;
			_copy(fp + -64, 0x10, s3_134, 0x10, out a3_363, out a4_364, out a5_365);
			add_round_key(fp + -64, s5_157);
			s5_157 = (word32) s5_157 + 16;
		} while (s5_157 != s0_131);
		do
		{
			s1_132 = (word32) s1_132 + 1;
			*((word32) s1_132 + 0x0FFF) = (byte) (word32) ((word32) *s1_132 + s4_135);
		} while (s3_134 != s1_132);
		shift_rows(fp + -64);
		add_round_key(fp + -64, s0_131);
		word32 a3_366;
		word32 a4_367;
		word32 a5_368;
		_copy(s2_133, 0x10, fp + -64, 0x10, out a3_366, out a4_367, out a5_368);
		Eq_2 a1_221;
		Eq_255115 a3_223;
		struct Eq_255116 * a4_224;
		word32 a2_369;
		word32 a5_370;
		Eq_2 ra_226 = _set(ra, fp + -64, 0x00, 0x10, out a1_221, out a2_369, out a3_223, out a4_224, out a5_370);
		s0Out = dwArg0158;
		s1Out = s1_132;
		a0Out = 0x01;
		a1Out = a1_221;
		a3Out = a3_223;
		a4Out = a4_224;
		a5Out = (struct Eq_255117 *) 0x01;
		s2Out = s2_133;
		s3Out = s3_134;
		s4Out = dwArgF4;
		s5Out = s5_157;
		s8Out = dwArgD4;
		return ra_226;
	}
}

