pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23057644: void att_prepare_write_req()
void att_prepare_write_req()
{
}

// 23057648: Register Eq_263776 att_op_get_type(Register Eq_263776 a0, Register out Eq_263776 a4Out)
// Called from:
//      att_cb.isra.3
//      bt_att_create_pdu
//      bt_att_recv
Eq_263776 att_op_get_type(Eq_263776 a0, union Eq_263776 & a4Out)
{
	Eq_263776 a0_11;
	Eq_263776 a4_10 = 0x0E;
	if (a0 == 0x0E)
	{
l23057682:
		a0_11.u0 = 0x01;
		goto l23057684;
	}
	if (a0 <= 0x0E)
	{
		a4_10.u0 = 0x07;
		a0_11.u0 = 0x02;
		if (a0 == 0x07)
			goto l23057684;
		if (a0 <= 0x07)
		{
			a4_10.u0 = 0x03;
			if (a0 == 0x03)
				goto l23057684;
			if (a0 <= 0x03)
			{
				a4_10.u0 = 0x01;
				if (a0 == 0x01)
					goto l23057684;
				a4_10.u0 = 0x02;
				if (a0 == 0x02)
				{
					a4Out.u0 = 0x02;
					return 0x01;
				}
l2305770C:
				a0_11.u0 = 0x06;
				if ((a0 & 64) != 0x00)
				{
					a4Out = a4_10;
					return 0x00;
				}
				goto l23057684;
			}
			a4_10.u0 = 0x05;
			a0_11.u0 = 0x02;
			if (a0 == 0x05)
				goto l23057684;
			goto l23057682;
		}
		a4_10.u0 = 0x0A;
		a0_11.u0 = 0x01;
		if (a0 == 0x0A)
			goto l23057684;
		if (a0 <= 0x0A)
		{
			a4_10.u0 = 0x08;
			if (a0 != 0x08)
			{
				a4_10.u0 = 0x09;
				if (a0 == 0x09)
				{
					a4Out.u0 = 0x09;
					return 0x02;
				}
				goto l2305770C;
			}
		}
		else
		{
			a4_10.u0 = 0x0C;
			a0_11.u0 = 0x01;
			if (a0 != 0x0C)
			{
				a4Out.u0 = 0x0C;
				return 0x02;
			}
		}
		goto l23057684;
	}
	a4_10.u0 = 0x17;
	a0_11.u0 = 0x02;
	if (a0 == 0x17)
		goto l23057684;
	if (a0 <= 0x17)
	{
		a4_10.u0 = 0x11;
		if (a0 != 0x11)
		{
			if (a0 <= 0x11)
			{
				a4_10.u0 = 0x0F;
				if (a0 != 0x0F)
				{
					a4_10.u0 = 0x10;
					if (a0 == 0x10)
					{
						a4Out.u0 = 0x10;
						return 0x01;
					}
					goto l2305770C;
				}
			}
			else
			{
				a4_10.u0 = 0x13;
				a0_11.u0 = 0x02;
				if (a0 != 0x13)
				{
					a0_11.u0 = 0x01;
					if (a0 >= 0x13)
					{
						a4_10.u0 = 22;
						if (a0 == 22)
						{
							a4Out.u0 = 22;
							return 0x01;
						}
						goto l2305770C;
					}
				}
			}
		}
		goto l23057684;
	}
	a4_10.u0 = 0x1D;
	a0_11.u0 = 0x05;
	if (a0 == 0x1D)
		goto l23057684;
	if (a0 <= 0x1D)
	{
		a4_10.u0 = 0x19;
		a0_11.u0 = 0x02;
		if (a0 == 0x19)
			goto l23057684;
		a0_11.u0 = 0x01;
		if (a0 >= 0x19)
		{
			a4_10.u0 = 0x1B;
			a0_11.u0 = 0x03;
			goto l23057708;
		}
	}
	else
	{
		a4_10.u0 = 82;
		a0_11.u0 = 0x00;
		if (a0 == 82)
			goto l23057684;
		a4_10.u0 = 0x00D2;
		if (a0 != 0x00D2)
		{
			a4_10.u0 = 0x1E;
			a0_11.u0 = 0x04;
l23057708:
			if (a0 != a4_10)
				goto l2305770C;
			goto l23057684;
		}
	}
l23057684:
	a4Out = a4_10;
	return a0_11;
}

// 23057730: Register Eq_2 att_req_destroy(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_317085) a5Out)
// Called from:
//      att_reset
//      bt_att_encrypt_change
//      bt_att_req_cancel
Eq_2 att_req_destroy(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_317085 & a5Out)
{
	Eq_2 a0_10 = *((word32) a0 + 16);
	if (a0_10 != 0x00)
	{
		word32 s0_178;
		word32 a0_179;
		word32 a2_180;
		word32 a3_181;
		word32 s2_182;
		word32 s3_183;
		word32 s4_184;
		word32 s5_185;
		word32 s6_186;
		word32 s8_187;
		ra = net_buf_unref(ra, s1, a0_10, a1, a4, mstatus, dwLoc10, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_178, out s1, out a0_179, out a1, out a2_180, out a3_181, out a4, out a5, out s2_182, out s3_183, out s4_184, out s5_185, out s6_186, out s8_187, out mstatus);
	}
	Eq_2 s0_43 = *((word32) a5 + 8);
	if (a5 != 0x00)
	{
		word32 a6_62;
		word32 a7_63;
		word32 s2_64;
		word32 s3_65;
		word32 s4_66;
		word32 s5_67;
		word32 s6_68;
		word32 s8_69;
		word32 t3_72;
		word32 t4_73;
		word32 t5_74;
		word32 t6_75;
		word32 tp_76;
		a5();
	}
	ptr32 a0_87;
	ptr32 a1_88;
	ptr32 a2_89;
	ptr32 a3_90;
	ptr32 a4_91;
	struct Eq_317085 * a5_92;
	word32 t1_188;
	Eq_2 ra_93 = memset(ra, s0_43, 0x00, 0x18, out t1_188, out a0_87, out a1_88, out a2_89, out a3_90, out a4_91, out a5_92);
	a0Out = a0_87;
	a1Out = a1_88;
	a2Out = a2_89;
	a3Out = a3_90;
	a4Out = a4_91;
	a5Out = a5_92;
	return ra_93;
}

// 23057758: void att_notify(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a5, Register Eq_2 s6, Register ptr32 mstatus, Stack (ptr32 Eq_271981) dwArg44)
void att_notify(Eq_2 ra, Eq_2 s0, Eq_2 a5, Eq_2 s6, ptr32 mstatus, struct Eq_271981 * dwArg44)
{
	struct Eq_317165 * a1_14;
	word32 a2_64;
	word32 a4_65;
	word32 a5_66;
	word32 s0_67;
	word32 s1_68;
	word32 a3_69;
	word32 mstatus_70;
	bt_gatt_notification(ra, s0, s0, net_buf_simple_pull_le16(a5, out a1_14, out a2_64, out a4_65, out a5_66), dwArg44, (word32) a1_14->w000C, s6, mstatus, out s0_67, out s1_68, out a3_69, out mstatus_70);
}

// 23057784: Register Eq_2 bt_gatt_foreach_attr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 code) a2, Register Eq_266569 a3, Register (ptr32 Eq_2096) s11, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s11Out)
// Called from:
//      att_read_group_req
//      att_read_mult_req
//      att_read_req
//      att_read_type_req
//      att_find_type_req
//      att_find_info_req
//      att_signed_write_cmd
Eq_2 bt_gatt_foreach_attr(Eq_2 ra, Eq_2 a0, Eq_2 a1, <anonymous> * a2, Eq_266569 a3, struct Eq_2096 * s11, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s11Out)
{
	ptr32 a0_14;
	ptr32 a1_15;
	ptr32 a2_16;
	ptr32 a4_18;
	ptr32 a5_19;
	ptr32 s0_23;
	ptr32 s1_24;
	ptr32 s11_26;
	ptr32 s2_27;
	ptr32 s4_29;
	ptr32 s5_30;
	word32 a3_52;
	word32 s3_53;
	word32 s6_54;
	word32 s7_55;
	word32 s8_56;
	word32 s9_57;
	word32 s10_58;
	Eq_2 ra_22 = bt_gatt_foreach_attr_type(ra, a0, a1, 0x00, 0x00, 0x00, a2, a3, s11, out s0_23, out s1_24, out a0_14, out a1_15, out a2_16, out a3_52, out a4_18, out a5_19, out s2_27, out s3_53, out s4_29, out s5_30, out s6_54, out s7_55, out s8_56, out s9_57, out s10_58, out s11_26);
	s0Out = s0_23;
	s1Out = s1_24;
	a0Out = a0_14;
	a1Out = a1_15;
	a2Out = a2_16;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = s2_27;
	s4Out = s4_29;
	s5Out = s5_30;
	s11Out = s11_26;
	return ra_22;
}

// 23057792: void read_group_cb(Register word32 ra, Register (ptr32 Eq_2) a0, Register (ptr32 (ptr32 Eq_317253)) a1, Stack word32 dwArg0128)
void read_group_cb(word32 ra, union Eq_2 * a0, struct Eq_317253 ** a1, word32 dwArg0128)
{
	struct Eq_317253 * s3_17 = *a1;
	int32 s4_25 = s3_17->dw0000;
	word32 a2_314;
	word32 a5_317;
	word32 s8_319;
	word32 a6_318;
	word32 a3_315;
	word32 a4_316;
	Eq_2 a1_29;
	Eq_2 a0_28;
	bt_uuid_cmp(*a0, fp + -40, out a0_28, out a1_29, out a2_314, out a3_315, out a4_316, out a5_317, out a6_318, out s8_319);
	word32 s2_128 = 0x03000000;
	if (a0_28 != 0x00)
	{
		struct Eq_317289 * s1_44 = *a0_28;
		struct Eq_317318 * a5_53;
		word32 a3_326;
		word32 s8_329;
		word32 a4_327;
		word32 a6_328;
		word32 a2_325;
		bt_uuid_cmp(a0_28, fp + -36, out a0_28, out a1_29, out a2_325, out a3_326, out a4_327, out a5_53, out a6_328, out s8_329);
		s2_128 = 0x02FFF801;
		if (a0_28 != 0x00)
		{
			if (a5_53 != null)
			{
				uint32 a4_181 = (word32) s1_44->w0010;
				if (((word32) a5_53->b0003 << 8 | (word32) a5_53->b0002) < a4_181)
				{
					a5_53->b0002 = (byte) a4_181;
					a5_53->b0003 = (byte) (a4_181 >> 8);
				}
			}
			goto l230577FE;
		}
	}
	struct Eq_317289 * s1_69 = *a0_28;
	struct Eq_317293 * a0_70;
	byte * a5_74;
	word32 a2_78;
	word32 a1_320;
	word32 a6_323;
	word32 s8_324;
	word32 a3_321;
	word32 a4_322;
	Eq_2 s0_75 = bt_uuid_cmp(a0_28, a1_29, out a0_70, out a1_320, out a2_78, out a3_321, out a4_322, out a5_74, out a6_323, out s8_324);
	if (a0_70 != null)
	{
		*((word32) s0_75 + 16) = 0x00;
		goto l2305781C;
	}
	word32 s0_87 = a0_70->dw0008;
	Eq_2 a4_88 = (word32) *a5_74;
	if (a4_88 == 0x00 || (uint16) (s3_17->w0056 - a0_70->w000C) >= a4_88)
	{
		word32 a5_331;
		word32 a1_330;
		Eq_2 a0_97 = net_buf_simple_add(&a0_70->dw0008, 0x04, a4_88, out a1_330, out a5_331);
		*((word32) a0_97 + 16) = s0_87;
		uint32 a5_103 = (word32) s1_69->w0010;
		*a0_97 = (byte) (a5_103 & 0x00FF);
		*((word32) a0_97 + 1) = (byte) (a5_103 >> 8);
		*((word32) a4_88 + 3) = (byte) (a5_103 >> 8);
		*((word32) a4_88 + 2) = (byte) (a5_103 & 0x00FF);
		word32 a5_119 = (word32) *((word32) a4_88 + 0x0C);
		Eq_2 a0_141;
		byte * a3_143;
		s1_69->ptr0004();
		if (a0_141 < 0x00)
			goto l23057838;
		Eq_2 a4_159 = (word32) *a3_143;
		if (a4_159 == 0x00)
			*a3_143 = (byte) ((word32) a0_141 + 4);
		else if (a4_159 != (word32) a0_141 + 4)
		{
			((word32) a4_159 + 0x0C)->u2 = (word16) ((word32) *((word32) a4_159 + 0x0C) + ~0x03);
			goto l23057838;
		}
		word32 a1_332;
		word32 a5_333;
		net_buf_simple_add((word32) a0_141 + 8, a0_141, a4_159, out a1_332, out a5_333);
l230577FE:
		0x00 = dwArg0128;
	}
	else
	{
l23057838:
		goto l230577FE;
	}
}

// 230578B4: void read_type_cb(Register word32 ra, Register Eq_2 a0, Register (ptr32 Eq_317480) a1)
void read_type_cb(word32 ra, Eq_2 a0, struct Eq_317480 * a1)
{
	union Eq_2 * s3_17 = a1->ptr0000;
	Eq_2 s4_23 = *s3_17;
	word32 a0_25;
	word32 a2_219;
	word32 a3_220;
	word32 a1_218;
	word32 a5_222;
	word32 a6_223;
	word32 a4_221;
	word32 s8_224;
	Eq_2 s0_30 = bt_uuid_cmp(*a0, a1->t0004, out a0_25, out a1_218, out a2_219, out a3_220, out a4_221, out a5_222, out a6_223, out s8_224);
	if (a0_25 != 0x00)
		return;
	word32 a2_45;
	Eq_2 a4_46;
	struct Eq_317518 * a5_47;
	struct Eq_267946 * a0_44 = bt_gatt_check_perm(s4_23, a0, 0x15, out a2_45, out a4_46, out a5_47);
	*((word32) s0_30 + 20) = (byte) a0_44;
	if (a0_44 == null)
	{
		word32 s0_53 = a0_44->dw0008;
		word32 a1_225;
		word32 a5_226;
		Eq_2 a0_56 = net_buf_simple_add(&a0_44->dw0008, 0x02, a4_46, out a1_225, out a5_226);
		*((word32) a0_56 + 16) = s0_53;
		uint32 a5_60 = (word32) *((word32) a0 + 16);
		*a0_56 = (byte) a5_60;
		*((word32) a0_56 + 1) = (byte) (a5_60 >> 8);
		word32 a5_68 = (word32) *((word32) a4_46 + 0x0C);
		struct Eq_317569 * s0_77;
		Eq_2 a0_84;
		byte * a3_91;
		word32 tp_98;
		(*((word32) a0 + 4))();
		if (a0_84 >= 0x00)
		{
			Eq_2 a4_102 = (word32) *a3_91;
			if (a4_102 == 0x00)
				*a3_91 = (byte) ((word32) a0_84 + 2);
			else if (a4_102 != (word32) a0_84 + 2)
			{
				((word32) a4_102 + 0x0C)->u2 = (word16) ((word32) *((word32) a4_102 + 0x0C) + ~0x01);
				return;
			}
			word32 a5_228;
			word32 a1_227;
			net_buf_simple_add((word32) a0_84 + 8, a0_84, a4_102, out a1_227, out a5_228);
		}
		else
		{
			ui32 a0_127 = 0x0E;
			if (a0_84 <= 1)
				a0_127 = 0x00 - a0_84 & 0x00FF;
			s0_77->b0014 = (byte) a0_127;
		}
	}
	else
	{
		struct Eq_317578 * s0_133 = a5_47->ptr000C;
		if ((word32) a5_47->b0000 != 0x00)
			s0_133->b0014 = 0x00;
	}
}

// 230579AA: void find_type_cb(Register word32 ra, Register (ptr32 Eq_2) a0, Register (ptr32 (ptr32 Eq_317640)) a1)
void find_type_cb(word32 ra, union Eq_2 * a0, struct Eq_317640 ** a1)
{
	struct Eq_317640 * s3_17 = *a1;
	int32 s4_25 = s3_17->dw0000;
	Eq_2 a0_28;
	word32 a6_384;
	word32 s8_385;
	word32 a1_379;
	word32 a2_380;
	word32 a3_381;
	word32 a5_383;
	word32 a4_382;
	Eq_2 s0_103 = bt_uuid_cmp(*a0, fp + -96, out a0_28, out a1_379, out a2_380, out a3_381, out a4_382, out a5_383, out a6_384, out s8_385);
	if (a0_28 != 0x00)
	{
		struct Eq_317679 * s1_44 = *a0_28;
		word32 a0_49;
		struct Eq_317684 * a4_52;
		struct Eq_317685 * a5_53;
		word32 a6_389;
		word32 s8_390;
		word32 a1_386;
		word32 a3_388;
		word32 a2_387;
		bt_uuid_cmp(a0_28, fp + -92, out a0_49, out a1_386, out a2_387, out a3_388, out a4_52, out a5_53, out a6_389, out s8_390);
		if (a0_49 != 0x00)
		{
			if (a5_53 != null)
			{
				uint32 a4_224 = (word32) s1_44->w0010;
				if (((word32) a5_53->b0003 << 8 | (word32) a5_53->b0002) < a4_224)
				{
					a5_53->b0002 = (byte) a4_224;
					a5_53->b0003 = (byte) (a4_224 >> 8);
				}
			}
			return;
		}
		word32 s0_65 = a4_52->dw0004;
		Eq_317709 a5_69 = (uint16) (s3_17->w0056 - a4_52->w000C);
		if (a5_69 <= 0x03)
			return;
		word32 s1_71 = *((word32) a5_69 + 4);
		struct Eq_317753 * sp_77;
		struct Eq_317754 * s1_79;
		Eq_2 ra_81;
		Eq_2 a0_85;
		word32 s10_253;
		word32 s11_254;
		word32 s6_255;
		word32 s7_256;
		a5_69();
		if (a0_85 >= 0x00)
		{
			Eq_2 a4_108;
			Eq_2 a0_105;
			Eq_2 a2_102 = (word32) *((word32) s0_103 + 16);
			s0_103 = *((word32) a0_85 + 0x0C);
			if (a2_102 != a0_85)
			{
				struct Eq_274 * a0_184;
				Eq_2 a3_114;
				if (bt_uuid_create((char *) &sp_77->t0028 + 4, a0_85, a2_102, out a3_114) == 0x00)
				{
					a0_184 = (struct Eq_274 *) &g_t230BD0C8;
					goto l23057A6E;
				}
				if (bt_uuid_create((char *) &sp_77->t0008 + 16, &sp_77->t0008, a0_85 & 0x00FF, out a3_114) == 0x00)
				{
					a0_184 = (struct Eq_274 *) &g_t230BD0EC;
l23057A6E:
					word32 a5_407;
					word32 a7_408;
					word32 a4_406;
					word32 a3_405;
					word32 a2_404;
					word32 s1_401;
					word32 a1_403;
					word32 a0_402;
					word32 s2_409;
					word32 s3_410;
					word32 s4_411;
					word32 s5_412;
					word32 s6_413;
					word32 s7_414;
					word32 s8_415;
					word32 s9_416;
					word32 s10_417;
					word32 s11_418;
					word32 t4_419;
					printf(ra_81, a0_184, a3_114, sp_77->t0008, sp_77->t0028, sp_77->t0070, sp_77->t0074, sp_77->t0098, sp_77->t00BC, out s1_401, out a0_402, out a1_403, out a2_404, out a3_405, out a4_406, out a5_407, out a7_408, out s2_409, out s3_410, out s4_411, out s5_412, out s6_413, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418, out t4_419);
					goto l23057A72;
				}
				word32 a6_399;
				word32 s8_400;
				word32 a1_395;
				word32 a2_396;
				word32 a5_398;
				word32 a3_397;
				s0_103 = bt_uuid_cmp((char *) &sp_77->t0028 + 4, (char *) &sp_77->t0008 + 16, out a0_105, out a1_395, out a2_396, out a3_397, out a4_108, out a5_398, out a6_399, out s8_400);
			}
			else
			{
				word32 a5_394;
				word32 a1_391;
				word32 a3_393;
				word32 a2_392;
				a0_105 = memcmp(a0_85, &sp_77->t0008, a2_102, out a1_391, out a2_392, out a3_393, out a4_108, out a5_394);
			}
			if (a0_105 == 0x00)
			{
				struct Eq_317890 * s0_164 = *((word32) a0_105 + 4);
				s0_164->b0011 = 0x00;
				word32 a1_420;
				word32 a5_421;
				Eq_2 a0_169 = net_buf_simple_add((word32) a0_105 + 8, 0x04, a4_108, out a1_420, out a5_421);
				*((word32) a0_169 + 8) = s0_164;
				uint32 a5_174 = (word32) s1_79->w0010;
				*a0_169 = (byte) (a5_174 & 0x00FF);
				*((word32) a0_169 + 1) = (byte) (a5_174 >> 8);
				*((word32) a4_108 + 2) = (byte) (a5_174 & 0x00FF);
				*((word32) a4_108 + 3) = (byte) (a5_174 >> 8);
				return;
			}
		}
	}
l23057A72:
	*((word32) s0_103 + 8) = 0x00;
}

// 23057AD4: void find_info_cb(Register word32 a0, Register Eq_2 a4, Register (ptr32 Eq_317940) a5, Stack word32 dwArg38)
void find_info_cb(word32 a0, Eq_2 a4, struct Eq_317940 * a5, word32 dwArg38)
{
	word32 a1_13 = a5->dw0008;
	if (a5 == null)
	{
		byte * a5_24;
		word32 a1_180;
		Eq_2 a0_22 = net_buf_simple_add(a0 + 0x08, 0x01, a4, out a1_180, out a5_24);
		*((word32) a0_22 + 8) = a1_13;
		word32 a5_28 = (word32) ((word32) *a5_24 != 0x00);
		*a0_22 = (byte) (a5_28 + 0x01);
		a5 = a5_28 + 0x01;
	}
	Eq_2 a5_35 = (word32) a5->b0000;
	if (a5_35 != 0x01)
	{
		if (a5_35 != 0x02)
			goto l23057BAA;
		Eq_2 s1_64 = *(union Eq_2 *) 0x02;
		Eq_2 a4_66 = (word32) *(union Eq_2 *) 0x02;
		if (a4_66 != a5_35)
		{
l23057BAA:
			0x00 = dwArg38;
			return;
		}
		Eq_2 s0_67 = *(union Eq_2 *) 0x04;
		word32 a1_71;
		word32 a5_181;
		Eq_2 a0_70 = net_buf_simple_add(0x08, 0x12, a4_66, out a1_71, out a5_181);
		*((word32) a0_70 + 0x0C) = s0_67;
		uint32 a5_74 = (word32) *((word32) s1_64 + 16);
		*a0_70 = (byte) a5_74;
		*((word32) a0_70 + 1) = (byte) (a5_74 >> 8);
		word32 a7_188;
		word32 a5_186;
		word32 a6_187;
		word32 a4_185;
		word32 a3_184;
		word32 a2_183;
		word32 a1_182;
		memcpy((word32) a0_70 + 2, a1_71 + 0x01, 0x10, out a1_182, out a2_183, out a3_184, out a4_185, out a5_186, out a6_187, out a7_188);
	}
	else
	{
		Eq_317983 s1_36 = *a5_35;
		if ((word32) *a5_35 != 0x00)
			goto l23057BAA;
		Eq_2 s0_39 = *(union Eq_2 *) 0x04;
		word32 a5_190;
		word32 a1_189;
		Eq_2 a0_42 = net_buf_simple_add(0x08, 0x04, 0x01, out a1_189, out a5_190);
		*((word32) a0_42 + 0x0C) = s0_39;
		uint32 a5_46 = (word32) *((word32) s1_36 + 16);
		*a0_42 = (byte) a5_46;
		*((word32) a0_42 + 1) = (byte) (a5_46 >> 8);
		uint32 a5_52 = (word32) (a5_46 >> 8)->w0002;
		*(union Eq_2 *) 0x03 = (byte) a5_52;
		*(union Eq_2 *) 0x04 = (byte) (a5_52 >> 8);
	}
	goto l23057BAA;
}

// 23057BB6: void bt_att_connected(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void bt_att_connected(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 a3_19;
	Eq_2 a4_20;
	word32 a5_67;
	word32 s2_68;
	word32 s3_69;
	k_queue_init(ra, 0x14, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArgF8, dwArg0138, out a3_19, out a4_20, out a5_67, out s2_68, out s3_69);
	((word32) a0 + 86)->u2 = 0x17;
	((word32) a0 + 66)->u0 = 0x17;
	word32 a0_70;
	word32 a3_71;
	word32 a4_72;
	word32 a5_73;
	word32 s2_74;
	word32 s3_75;
	word32 s4_76;
	word32 s5_77;
	k_delayed_work_init(ra, a0, (word32) a0 + 0x00A8, a3_19, a4_20, mstatus, dwArg84, dwArgB8, dwArgD8, dwArg0118, out a0_70, out a3_71, out a4_72, out a5_73, out s2_74, out s3_75, out s4_76, out s5_77);
	((word32) a0 + 0x00A0)->u0 = 0x00;
	((word32) a0 + 0x00A4)->u0 = 0x00;
}

// 23057BF2: Register Eq_2 att_cb.isra.3(Register Eq_2 a0, Register out Eq_318164 a5Out)
// Called from:
//      att_send
//      bt_att_encrypt_change
//      bt_att_req_send
Eq_2 att_cb.isra.3(Eq_2 a0, union Eq_318164 & a5Out)
{
	Eq_2 a0_15;
	word32 a4_32;
	uint32 a0_12 = att_op_get_type((word32) *a0, out a4_32) + ~0x00 & 0x00FF;
	Eq_318164 a5_13 = 0x04;
	if (a0_12 <= 0x04)
	{
		a5_13.u0 = 587976564;
		a0_15 = *((char *) g_a230BCF74 + a0_12 * 0x04);
	}
	else
		a0_15.u0 = 0x23058128;
	a5Out = a5_13;
	return a0_15;
}

