pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23057C28: Register Eq_2 att_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      att_rsp_sent
//      bt_att_send
Eq_2 att_send(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 s2_133 = a0;
	Eq_2 a5_119 = 0x00D2;
	if ((word32) *a5 == 0x00D2)
	{
		dwArg54 = a2;
		Eq_2 a3_28;
		Eq_2 s0_34;
		ra = bt_smp_sign(ra, a0, a0, dwLoc30, dwLoc2C, dwLoc28, s0, dwLoc08, dwArg00, dwArg04, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg48, dwArg4C, dwArg6C, dwArgD8, out s0_34, out a0, out a3_28, out a5_119, out s2_133);
		s1 = a0;
		if (a0 != 0x00)
		{
			Eq_2 a1_60;
			Eq_2 a4_63;
			Eq_2 s1_66;
			ptr32 s10_67;
			ptr32 s11_68;
			ptr32 s7_74;
			ptr32 s9_76;
			ptr32 a1_82;
			ptr32 a3_84;
			ptr32 a4_85;
			ptr32 a5_86;
			ptr32 mstatus_89;
			ptr32 s1_92;
			ptr32 s2_93;
			ptr32 s3_94;
			ptr32 s4_95;
			ptr32 s5_96;
			ptr32 s6_97;
			ptr32 s8_98;
			word32 s2_331;
			word32 s3_332;
			word32 a5_329;
			word32 a7_330;
			word32 a2_327;
			word32 a3_328;
			word32 a0_326;
			word32 s4_333;
			word32 s5_334;
			word32 s6_335;
			word32 s8_336;
			word32 t4_337;
			word32 s0_338;
			word32 a0_339;
			word32 a2_340;
			Eq_2 ra_90 = net_buf_unref(printf(ra, &g_t230BCFEC, a3_28, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_66, out a0_326, out a1_60, out a2_327, out a3_328, out a4_63, out a5_329, out a7_330, out s2_331, out s3_332, out s4_333, out s5_334, out s6_335, out s7_74, out s8_336, out s9_76, out s10_67, out s11_68, out t4_337), s1_66, s0_34, a1_60, a4_63, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, a2, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_338, out s1_92, out a0_339, out a1_82, out a2_340, out a3_84, out a4_85, out a5_86, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97, out s8_98, out mstatus_89);
			0x00 = (int8) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_92;
			a0Out = s1_92;
			a1Out = a1_82;
			a3Out = a3_84;
			a4Out = a4_85;
			a5Out = a5_86;
			s2Out = s2_93;
			s3Out = s3_94;
			s4Out = s4_95;
			s5Out = s5_96;
			s6Out = s6_97;
			s7Out = s7_74;
			s8Out = s8_98;
			s9Out = s9_76;
			s10Out = s10_67;
			s11Out = s11_68;
			mstatusOut = mstatus_89;
			return ra_90;
		}
	}
	Eq_2 a2_112 = a2;
	if (a2 == 0x00)
		a2_112 = att_cb.isra.3(a0, out a5_119);
	0x00 = (int8) dwArg0128;
	ptr32 a0_146;
	ptr32 a1_147;
	ptr32 a3_149;
	ptr32 a4_150;
	ptr32 a5_151;
	ptr32 mstatus_154;
	ptr32 s0_156;
	ptr32 s1_157;
	ptr32 s10_158;
	ptr32 s11_159;
	ptr32 s2_160;
	ptr32 s3_161;
	ptr32 s4_162;
	ptr32 s5_163;
	ptr32 s6_164;
	ptr32 s7_165;
	ptr32 s8_166;
	ptr32 s9_167;
	Eq_2 ra_155 = bt_l2cap_send_cb(ra, s1, s2_133, 0x04, dwArg0100, a2_112, a5_119, mstatus, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, dwArg54, dwArg58, dwArg74, dwArg7C, dwArg88, dwArg8C, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_156, out s1_157, out a0_146, out a1_147, out a3_149, out a4_150, out a5_151, out s2_160, out s3_161, out s4_162, out s5_163, out s6_164, out s7_165, out s8_166, out s9_167, out s10_158, out s11_159, out mstatus_154);
	s0Out = s0_156;
	s1Out = s1_157;
	a0Out = a0_146;
	a1Out = a1_147;
	a3Out = a3_149;
	a4Out = a4_150;
	a5Out = a5_151;
	s2Out = s2_160;
	s3Out = s3_161;
	s4Out = s4_162;
	s5Out = s5_163;
	s6Out = s6_164;
	s7Out = s7_165;
	s8Out = s8_166;
	s9Out = s9_167;
	s10Out = s10_158;
	s11Out = s11_159;
	mstatusOut = mstatus_154;
	return ra_155;
}

// 23057C9A: void att_send_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      bt_att_encrypt_change
//      bt_att_req_send
void att_send_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	*((word32) a0 + 0x009C) = a1;
	int32 a0_22;
	struct Eq_318439 * a1_23;
	Eq_2 a4_26;
	Eq_2 a5_27;
	union Eq_2 * s1_30;
	word32 a3_221;
	word32 s2_222;
	word32 s3_223;
	word32 s4_224;
	word32 s8_225;
	k_sem_take((word32) a0 + 0x00CC, 0x00, a2, a3, a4, a5, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_30, out a0_22, out a1_23, out a3_221, out a4_26, out a5_27, out s2_222, out s3_223, out s4_224, out s8_225);
	struct Eq_318464 * s0_37 = a1_23->ptr0010;
	if (a0_22 < 0x00)
	{
		word32 s1_226;
		word32 a0_227;
		word32 a1_228;
		word32 a2_229;
		word32 a3_230;
		word32 a4_231;
		word32 a5_232;
		word32 s2_233;
		word32 s3_234;
		word32 s4_235;
		word32 s5_236;
		word32 s6_237;
		word32 s8_238;
		k_queue_append((char *) s1_30 + 0x00D8, a4_26, a5_27, mstatus, dwLoc1C, dwArg64, dwArgD8, dwArg0118, dwArg0158, out s1_226, out a0_227, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s8_238);
	}
	else
	{
		Eq_2 a0_40 = net_buf_simple_headroom(a4_26);
		s0_37->w000C = (word16) a0_40;
		*((word32) *((word32) a0_40 + 16) + 0x0E) = (word16) (word32) a1_23->w000C;
		Eq_2 s1_46 = *s1_30;
		net_buf_ref(a0_40);
		Eq_2 a5_54;
		Eq_2 a0_60;
		Eq_2 a1_61;
		Eq_2 a4_64;
		ptr32 mstatus_68;
		word32 s0_239;
		word32 s1_240;
		word32 a3_241;
		word32 a5_242;
		word32 s2_243;
		word32 s3_244;
		word32 s4_245;
		word32 s5_246;
		word32 s6_247;
		word32 s7_248;
		word32 s8_249;
		word32 s9_250;
		word32 s10_251;
		word32 s11_252;
		Eq_2 ra_69 = bt_l2cap_send_cb(ra, s1_46, s1_46, 0x04, a0_40, att_cb.isra.3(a0_40, out a5_54), a5_54, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_239, out s1_240, out a0_60, out a1_61, out a3_241, out a4_64, out a5_242, out s2_243, out s3_244, out s4_245, out s5_246, out s6_247, out s7_248, out s8_249, out s9_250, out s10_251, out s11_252, out mstatus_68);
		if (a0_60 != 0x00)
		{
			struct Eq_318571 * s0_101;
			word32 s1_253;
			word32 a0_254;
			word32 a1_255;
			word32 a2_256;
			word32 a3_257;
			word32 a4_258;
			word32 a5_259;
			word32 s2_260;
			word32 s3_261;
			word32 s4_262;
			word32 s5_263;
			word32 s6_264;
			word32 s8_265;
			word32 mstatus_266;
			net_buf_unref(ra_69, a0_60, a0_60, a1_61, a4_64, mstatus_68, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg58, a0_40, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_101, out s1_253, out a0_254, out a1_255, out a2_256, out a3_257, out a4_258, out a5_259, out s2_260, out s3_261, out s4_262, out s5_263, out s6_264, out s8_265, out mstatus_266);
			s0_101->dw0010 = 0x00;
		}
	}
}

// 23057D18: Register Eq_2 att_handle_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      att_confirm
//      att_error_rsp
//      att_mtu_rsp
//      att_reset
//      bt_att_encrypt_change
Eq_2 att_handle_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	Eq_2 a1_33;
	word32 a5_469;
	word32 s5_471;
	word32 s6_472;
	word32 s8_473;
	word32 s4_470;
	word32 a4_468;
	word32 s3_36;
	word32 s2_31;
	Eq_2 a0_25;
	Eq_2 a3_104;
	Eq_2 a2_103;
	Eq_2 s1_145 = k_delayed_work_cancel((word32) a0 + 0x00A8, a3, a4, mstatus, dwArg14, dwArg18, dwArg88, dwArg98, dwArgC8, dwArg0108, out a0_25, out a1_33, out a2_103, out a3_104, out a4_468, out a5_469, out s2_31, out s3_36, out s4_470, out s5_471, out s6_472, out s8_473);
	Eq_2 s0_132 = a0;
	Eq_2 a5_105 = *((word32) a0 + 0x009C);
	if (a5_105 == 0x00)
	{
		word32 t4_487;
		word32 s8_484;
		word32 s9_485;
		word32 s10_486;
		word32 s4_480;
		word32 s5_481;
		word32 s6_482;
		word32 s7_483;
		word32 s3_479;
		word32 a1_475;
		word32 a7_477;
		word32 s2_478;
		word32 a4_476;
		word32 a0_474;
		ra = printf(ra, &g_t230BCFD0, a3_104, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_145, out a0_474, out a1_475, out a2_103, out a3_104, out a4_476, out a5_105, out a7_477, out s2_478, out s3_479, out s4_480, out s5_481, out s6_482, out s7_483, out s8_484, out s9_485, out s10_486, out s11, out t4_487);
	}
	else
	{
		if (a5_105 != 0x42017240)
		{
			if (a0_25 != 0x00)
			{
				word32 s5_494;
				word32 s6_495;
				word32 s8_496;
				word32 a4_491;
				word32 a5_492;
				word32 s4_493;
				word32 a1_488;
				word32 a2_489;
				word32 a3_490;
				ra = net_buf_unref(ra, s1_145, a0_25, a1_33, 0x42017240, mstatus, dwLoc20, dwLoc1C, s2, dwArg08, dwArg58, s3, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_132, out s1_145, out a0_25, out a1_488, out a2_489, out a3_490, out a4_491, out a5_492, out s2_31, out s3_36, out s4_493, out s5_494, out s6_495, out s8_496, out mstatus);
				*((word32) *((word32) s0_132 + 0x009C) + 16) = 0x00;
			}
			Eq_2 a5_80 = *((word32) s0_132 + 0x009C);
			<anonymous> * a6_85 = *((word32) a5_80 + 4);
			*((word32) a5_80 + 4) = null;
			word32 s0_88 = *a0_25;
			struct Eq_318807 * sp_95;
			Eq_2 a1_102;
			Eq_2 a4_106;
			word32 s10_270;
			word32 s7_272;
			word32 s9_273;
			a6_85();
			Eq_2 a0_122 = *((word32) a5_105 + 4);
			if (a5_105 == 0x00)
			{
				word32 a1_498;
				word32 a4_499;
				word32 a0_497;
				ra = att_req_destroy(ra, s0_132, s1_145, a0_122, a1_102, a4_106, a5_105, mstatus, sp_95->t0018, sp_95->t0068, sp_95->t0088, sp_95->t0094, sp_95->t00A8, sp_95->t00C8, sp_95->t00D8, sp_95->t00E8, sp_95->t0108, sp_95->t0128, sp_95->t0148, sp_95->t0168, out a0_497, out a1_498, out a2_103, out a3_104, out a4_499, out a5_105);
			}
		}
		((word32) s0_132 + 0x009C)->u0 = 0x00;
	}
	if (*((word32) s0_132 + 0x00A0) != 0x00)
	{
		Eq_2 a1_163 = *a5_105;
		Eq_2 a4_164 = *((word32) s0_132 + 0x00A4);
		*((word32) s0_132 + 0x00A0) = a5_105;
		if (a1_163 == a4_164)
			*((word32) s0_132 + 0x00A4) = a5_105;
		att_send_req(ra, s1_145, s0_132, a1_163, a2_103, a3_104, a4_164, a5_105, mstatus, s2, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg54, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138);
	}
	s0Out = s0_132;
	a0Out = 0x00;
	s11Out = s11;
	mstatusOut = mstatus;
	return ra;
}

// 23057DBE: void att_handle_find_info_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      att_handle_find_type_rsp
//      att_handle_read_type_rsp
//      att_handle_read_rsp
//      att_handle_read_blob_rsp
//      att_handle_read_mult_rsp
//      att_handle_read_group_rsp
//      att_handle_write_rsp
//      att_handle_prepare_write_rsp
//      att_handle_exec_write_rsp
//      att_confirm
void att_handle_find_info_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 s0_71;
	word32 a0_72;
	word32 s11_73;
	word32 mstatus_74;
	att_handle_rsp(ra, s1, a0, 0x00, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s0_71, out a0_72, out s11_73, out mstatus_74);
}

// 23057DCA: void att_handle_find_type_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_handle_find_type_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	att_handle_find_info_rsp(ra, s1, a0, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23057DCE: void att_handle_read_type_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_handle_read_type_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	att_handle_find_info_rsp(ra, s1, a0, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23057DD2: void att_handle_read_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_handle_read_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	att_handle_find_info_rsp(ra, s1, a0, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23057DD6: void att_handle_read_blob_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_handle_read_blob_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	att_handle_find_info_rsp(ra, s1, a0, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

