pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23057DEA: void att_handle_exec_write_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_handle_exec_write_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	att_handle_find_info_rsp(ra, s1, a0, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23057DEE: void att_confirm(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_confirm(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	att_handle_find_info_rsp(ra, s1, a0, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158);
}

// 23057DF2: void att_error_rsp(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_319278) a2, Register (ptr32 Eq_319279) a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_error_rsp(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, struct Eq_319278 * a2, struct Eq_319279 * a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a3_120;
	Eq_2 a5_9 = *((word32) a0 + 0x009C);
	Eq_2 s0_10 = a0;
	if (a5_9 != 0x00)
	{
		a4.u0 = 0x42017240;
		if (a5_9 != 0x42017240)
		{
			struct Eq_319332 * a5_14 = g_ptr42017250;
			if (true)
			{
				a4 = a3->t0010;
				*((char *) (a3 + (word32) a5_14->w000C / 20) + 8) = (struct Eq_319279 *) a4;
				*((byte) a4.u0 + 0x0C) = (word16) (word32) a5_14->w000E;
			}
			a3_120 = (word32) a2->b0003;
			if ((word32) *((word32) *((word32) a0 + 0x009C) + 20) == 0x00)
			{
				up32 a1_36;
				s0_10 = *a0;
				if (a3_120 == 0x05)
				{
					up32 a5_33 = (word32) *((word32) a0 + 9);
					if (a5_33 > 0x01)
					{
						if (a5_33 != 0x02)
						{
							a4.u0 = 0x03;
							a1_36 = 0x04;
							if (a5_33 != 0x03)
								goto l23057E80;
						}
						else
							a1_36 = 0x03;
l23057E4C:
						word32 a0_69;
						ra = bt_conn_set_security(ra, s0_10, a0, a1_36, a3_120, s2, s3, mstatus, dwLoc20, dwLoc1C, dwLoc18, s0, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s1, out a0_69, out a3_120, out a4, out s2, out s3, out mstatus);
						if (a0_69 == 0x00)
						{
							*((word32) *((word32) s0_10 + 0x009C) + 20) = 0x01;
							return;
						}
						goto l23057E80;
					}
					goto l23057E4A;
				}
				if (a3_120 != 0x0F)
					goto l23057E80;
				a4 = (word32) *((word32) a0 + 9);
				if (a4 <= 0x01)
				{
l23057E4A:
					a1_36 = 0x02;
					goto l23057E4C;
				}
			}
l23057E80:
			word32 s11_428;
			word32 mstatus_429;
			word32 a0_427;
			word32 s0_426;
			att_handle_rsp(ra, s1, s0_10, a3_120, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s0_426, out a0_427, out s11_428, out mstatus_429);
			return;
		}
	}
	a3_120.u0 = 0x0E;
	goto l23057E80;
}

