pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23057E98: void bt_att_accept(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108)
void bt_att_accept(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArg0108)
{
	word32 s0_21;
	Eq_2 a0_20;
	struct Eq_319450 * a4_16 = *a3;
	if (a3 != 0x00)
	{
		if (a4_16->dw00E4 != 0x00)
		{
			word32 s1_175;
			word32 a0_176;
			word32 a1_177;
			word32 a2_178;
			word32 a3_179;
			word32 a4_180;
			word32 a5_181;
			word32 a7_182;
			word32 s2_183;
			word32 s3_184;
			word32 s4_185;
			word32 s5_186;
			word32 s6_187;
			word32 s7_188;
			word32 s8_189;
			word32 s9_190;
			word32 s10_191;
			word32 s11_192;
			word32 t4_193;
			printf(ra, &g_t230BD02C, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_175, out a0_176, out a1_177, out a2_178, out a3_179, out a4_180, out a5_181, out a7_182, out s2_183, out s3_184, out s4_185, out s5_186, out s6_187, out s7_188, out s8_189, out s9_190, out s10_191, out s11_192, out t4_193);
			return;
		}
		a0_20.u0 = 0x4201715C;
		s0_21 = 0x01;
	}
	else
	{
		a0_20.u0 = 0x42017078;
		s0_21 = 0x00;
	}
	Eq_2 a3_32;
	Eq_2 a4_33;
	word32 t1_194;
	word32 a0_195;
	word32 a1_196;
	word32 a2_197;
	word32 a5_198;
	Eq_2 ra_35 = memset(ra, a0_20, 0x00, 228, out t1_194, out a0_195, out a1_196, out a2_197, out a3_32, out a4_33, out a5_198);
	struct Eq_319525 * s0_40 = s0_21 + 228;
	s0_40->dw4201707C = 0x4200E034;
	word32 s2_61;
	word32 * s3_62;
	word32 s1_199;
	word32 a0_200;
	word32 a1_201;
	word32 a3_202;
	word32 a4_203;
	word32 a5_204;
	word32 s4_205;
	word32 s5_206;
	word32 s6_207;
	word32 s7_208;
	word32 s8_209;
	k_sem_init(ra_35, (char *) s0_40 + 0x00CC, &s0_40->dw4201707C + 50, 0x0A, 0x0A, a3_32, a4_33, 0x4200E034, mstatus, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, dwArgC8, dwArg0108, out s1_199, out a0_200, out a1_201, out a3_202, out a4_203, out a5_204, out s2_61, out s3_62, out s4_205, out s5_206, out s6_207, out s7_208, out s8_209);
	*s3_62 = s2_61;
}

// 23057F22: void att_mtu_rsp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_319574) a1, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void att_mtu_rsp(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_319574 * a1, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (a0 == 0x00)
		return;
	Eq_2 a3_23;
	struct Eq_319608 * a1_8 = a1->ptr0008;
	Eq_319612 a5_12 = (word32) a1_8->b0001 << 8 | (word32) a1_8->b0000;
	if (a5_12 <= 22)
		a3_23.u0 = 0x04;
	else
	{
		Eq_319612 a3_15 = a5_12;
		if (a5_12 > 0x00F7)
			a3_15.u0 = 0x00F7;
		*((word32) a0 + 66) = (word16) a3_15;
		*((word32) a0 + 86) = (word16) a3_15;
		a3_23.u0 = 0x00;
	}
	word32 s11_211;
	word32 a0_210;
	word32 mstatus_212;
	word32 s0_209;
	att_handle_rsp(ra, s1, a0, a3_23, a0, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s0_209, out a0_210, out s11_211, out mstatus_212);
}

// 23057F68: Register Eq_2 att_reset(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      bt_att_disconnected
//      att_timeout
Eq_2 att_reset(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, union Eq_2 & s0Out, ptr32 & a0Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_319694 * sp_136 = fp + ~0x0F;
	Eq_2 s1_14 = (word32) a0 + 0x00D8;
	ra_118 = ra;
	while (true)
	{
		Eq_2 ra_118;
		Eq_2 a0_23;
		Eq_2 a1_24;
		Eq_2 a3_26;
		Eq_2 a4_27;
		Eq_2 s1_32;
		word32 s8_574;
		word32 s3_572;
		word32 a5_570;
		word32 s2_571;
		word32 s4_573;
		word32 a2_569;
		Eq_2 s0_31 = k_queue_get(s1_14, 0x00, a3, a4, mstatus, s0, ra, dwArgE8, dwArg0128, out s1_32, out a0_23, out a1_24, out a2_569, out a3_26, out a4_27, out a5_570, out s2_571, out s3_572, out s4_573, out s8_574);
		if (a0_23 == 0x00)
			break;
		word32 s8_555;
		word32 s5_553;
		word32 s3_551;
		word32 a5_549;
		word32 a1_547;
		word32 s0_545;
		word32 a0_546;
		word32 s2_550;
		word32 a2_548;
		word32 s4_552;
		word32 s6_554;
		ra_118 = net_buf_unref(ra_118, s1_32, a0_23, a1_24, a4_27, mstatus, s2, s0, dwLoc08, dwArg18, dwArg68, ra, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out s0_545, out s1_14, out a0_546, out a1_547, out a2_548, out a3, out a4, out a5_549, out s2_550, out s3_551, out s4_552, out s5_553, out s6_554, out s8_555, out mstatus);
	}
	word32 s4_559;
	word32 a1_557;
	word32 a2_558;
	word32 s8_560;
	word32 a0_556;
	Eq_2 a3_75;
	Eq_2 a5_100;
	Eq_2 a4_148;
	atomic_or(s0_31, 0x04, a3_26, a4_27, mstatus, out a0_556, out a1_557, out a2_558, out a3_75, out a4_148, out a5_100, out s4_559, out s8_560);
	Eq_2 s2_105 = (word32) s0_31 + 0x00CC;
	do
	{
		word32 s1_104;
		word32 s9_567;
		word32 s6_564;
		word32 a2_561;
		word32 s10_568;
		word32 s8_566;
		word32 s7_565;
		word32 s5_563;
		word32 s4_562;
		Eq_2 a1_143;
		Eq_2 s0_103;
		Eq_2 s3_106;
		ptr32 s11_120;
		ptr32 a0_180;
		ra_118 = k_sem_give(ra_118, s2_105, a3_75, a4_148, a5_100, mstatus, dwArg04, dwArg08, dwArg50, dwArg54, dwArg78, dwArg84, dwArg9C, dwArgF8, dwArg0138, dwArg0178, out s0_103, out s1_104, out a0_180, out a1_143, out a2_561, out a3_75, out a4_148, out a5_100, out s2_105, out s3_106, out s4_562, out s5_563, out s6_564, out s7_565, out s8_566, out s9_567, out s10_568, out s11_120);
	} while (s1_104 != 0x00);
	Eq_2 s1_123 = *((word32) s0_103 + 0x00A0);
	if (s1_123 != 0x00)
	{
		s2_105 = *s1_123;
		while (true)
		{
			ptr32 mstatus_149;
			s1_123 = *((word32) a5_100 + 4);
			if (a5_100 != 0x00)
			{
				a5_100();
				mstatus = mstatus_149;
			}
			word32 a3_576;
			word32 a2_575;
			ra_118 = att_req_destroy(ra_118, s0_103, s1_123, s1_123, a1_143, a4_148, a5_100, mstatus, sp_136->t0018, sp_136->t0068, sp_136->t0088, sp_136->t0094, sp_136->t00A8, sp_136->t00C8, sp_136->t00D8, sp_136->t00E8, sp_136->t0108, sp_136->t0128, sp_136->t0148, sp_136->t0168, out a0_180, out a1_143, out a2_575, out a3_576, out a4_148, out a5_100);
			if (s2_105 == 0x00)
				break;
			s2_105 = *s2_105;
		}
	}
	Eq_2 a5_194 = *((word32) s0_103 + 0x009C);
	((word32) s0_103 + 0x00A0)->u0 = 0x00;
	((word32) s0_103 + 0x00A4)->u0 = 0x00;
	if (a5_194 != 0x00)
	{
		0x00 = (int8) dwArg38;
		ptr32 a0_214;
		ptr32 mstatus_222;
		Eq_2 s0_224;
		ptr32 s11_227;
		Eq_2 ra_223 = att_handle_rsp(ra_118, s1_123, s0_103, 0x0E, a4_148, s2_105, s3_106, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s0_224, out a0_214, out s11_227, out mstatus_222);
		s0Out = s0_224;
		a0Out = a0_214;
		s11Out = s11_227;
		mstatusOut = mstatus_222;
		return ra_223;
	}
	else
	{
		0x00 = (int8) dwArg38;
		s0Out = s0;
		a0Out = a0_180;
		s11Out = s11_120;
		mstatusOut = mstatus;
		return ra_118;
	}
}

// 23057FFE: void bt_att_disconnected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0188)
void bt_att_disconnected(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, Eq_2 dwArg0188)
{
	Eq_266569 a0_14;
	ptr32 mstatus_22;
	struct Eq_2096 * s11_27;
	struct Eq_319956 * s0_53;
	word32 s0_304;
	Eq_2 a4_102;
	Eq_2 a3_103;
	Eq_2 ra_112 = bt_gatt_disconnected(att_reset(ra, a0, a0, a3, a4, s2, mstatus, dwLoc10, s0, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_304, out a0_14, out s11_27, out mstatus_22), a0_14, s11_27, dwLoc08, out s0_53, out a3_103, out a4_102);
	Eq_2 a5_72 = s0_53->t00B8;
	if (a5_72 != 0x00)
	{
		word32 s8_313;
		word32 s6_312;
		word32 s5_311;
		word32 s4_310;
		word32 s2_308;
		word32 s3_309;
		word32 a2_306;
		word32 a5_307;
		word32 a0_305;
		k_delayed_work_del_timer((char *) s0_53 + 0x00A8, a4_102, a5_72, mstatus_22, dwArg24, dwArg98, dwArgA8, dwArgD8, dwArg0118, out a0_305, out a2_306, out a3_103, out a4_102, out a5_307, out s2_308, out s3_309, out s4_310, out s5_311, out s6_312, out s8_313);
	}
	Eq_2 a5_98 = s0_53->t00D8;
	if (a5_98 != 0x00)
	{
		word32 s1_314;
		word32 a5_315;
		word32 s2_316;
		word32 s3_317;
		word32 s4_318;
		word32 s5_319;
		word32 s6_320;
		word32 s7_321;
		word32 s8_322;
		word32 s9_323;
		ra_112 = k_queue_free(ra_112, &s0_53->t00D8, a3_103, a4_102, a5_98, mstatus_22, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0138, dwArg0178, out s1_314, out a3_103, out a4_102, out a5_315, out s2_316, out s3_317, out s4_318, out s5_319, out s6_320, out s7_321, out s8_322, out s9_323);
		s0_53->t00D8.u0 = 0x00;
	}
	if (s0_53->dw00CC == 0x00)
		return;
	word32 s1_324;
	word32 a1_325;
	word32 a3_326;
	word32 a4_327;
	word32 s2_328;
	word32 s3_329;
	word32 s5_330;
	word32 s6_331;
	word32 s7_332;
	word32 s9_333;
	word32 s10_334;
	word32 s11_335;
	k_sem_delete(ra_112, &s0_53->dw00CC, a3_103, a4_102, mstatus_22, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, dwArg0148, dwArg0188, out s1_324, out a1_325, out a3_326, out a4_327, out s2_328, out s3_329, out s5_330, out s6_331, out s7_332, out s9_333, out s10_334, out s11_335);
}

// 2305804C: void att_timeout(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void att_timeout(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	Eq_2 a3_18;
	Eq_2 a4_19;
	Eq_2 s2_25;
	struct Eq_320116 * s0_47;
	struct Eq_2096 * s11_50;
	struct Eq_320118 * s0_76;
	word32 s1_137;
	word32 a0_138;
	word32 a1_139;
	word32 a2_140;
	word32 a5_141;
	word32 a7_142;
	word32 s3_143;
	word32 s4_144;
	word32 s5_145;
	word32 s6_146;
	word32 s7_147;
	word32 s8_148;
	word32 s9_149;
	word32 s10_150;
	word32 s11_151;
	word32 t4_152;
	word32 a0_153;
	word32 mstatus_154;
	word32 a3_155;
	word32 a4_156;
	bt_gatt_disconnected(att_reset(printf(ra, &g_t230BD01C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_137, out a0_138, out a1_139, out a2_140, out a3_18, out a4_19, out a5_141, out a7_142, out s2_25, out s3_143, out s4_144, out s5_145, out s6_146, out s7_147, out s8_148, out s9_149, out s10_150, out s11_151, out t4_152), a0, (word32) a0 - 0x00A8, a3_18, a4_19, s2_25, mstatus, dwLoc10, s0, dwLoc08, dwArg04, dwArg08, dwArg24, dwArg28, dwArg2C, dwArg34, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_47, out a0_153, out s11_50, out mstatus_154), s0_47->tFFFFFF58, s11_50, dwLoc08, out s0_76, out a3_155, out a4_156);
	s0_76->dw0F58 = 0x00;
}

// 2305807C: void bt_att_encrypt_change(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188)
void bt_att_encrypt_change(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 a4, Eq_2 s2, Eq_2 s3, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188)
{
	if (a1 == 0x00)
	{
		Eq_2 a2_19;
		Eq_2 a3_20;
		struct Eq_320236 * s0_26;
		struct Eq_320237 * s1_27;
		Eq_2 ra_25 = bt_gatt_encrypt_change(ra, s11, out s0_26, out s1_27, out a2_19, out a3_20);
		Eq_2 a4_44 = (word32) s1_27->b0009;
		if (a4_44 == 0x01)
			return;
		struct Eq_320253 * a5_46 = s0_26->ptr009C;
		if (a5_46 == null)
			return;
		Eq_2 a5_47 = (word32) a5_46->b0014;
		if (a5_47 == 0x00)
			return;
		Eq_2 a3_55;
		struct Eq_320267 * a5_57;
		Eq_2 s1_60;
		word32 a1_361;
		word32 a4_362;
		word32 s2_363;
		word32 s3_364;
		word32 s4_365;
		word32 s8_366;
		Eq_2 a0_52;
		k_sem_take((char *) &s0_26->ptr009C + 48, ~0x00, a2_19, a3_20, a4_44, a5_47, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, out s1_60, out a0_52, out a1_361, out a3_55, out a4_362, out a5_57, out s2_363, out s3_364, out s4_365, out s8_366);
		word32 s0_67 = a5_57->dw0000;
		if ((word32) a5_57->b000D == 0x04)
		{
			a0_52 = atomic_get(s0_67 + 0x0098) >> 2 & 0x01;
			if (a0_52 != 0x00)
			{
				Eq_2 a5_136;
				Eq_2 a3_140;
				Eq_2 a4_141;
				Eq_2 s2_147;
				word32 s1_384;
				word32 a0_385;
				word32 a1_386;
				word32 a2_387;
				word32 a7_388;
				word32 s3_389;
				word32 s4_390;
				word32 s5_391;
				word32 s6_392;
				word32 s7_393;
				word32 s8_394;
				word32 s9_395;
				word32 s10_396;
				word32 s11_397;
				word32 t4_398;
				Eq_2 ra_143 = printf(ra_25, &g_t230BD07C, a3_55, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_384, out a0_385, out a1_386, out a2_387, out a3_140, out a4_141, out a5_136, out a7_388, out s2_147, out s3_389, out s4_390, out s5_391, out s6_392, out s7_393, out s8_394, out s9_395, out s10_396, out s11_397, out t4_398);
				word32 s0_399;
				word32 s1_400;
				word32 a0_401;
				word32 a1_402;
				word32 a2_403;
				word32 a3_404;
				word32 a4_405;
				word32 a5_406;
				word32 s2_407;
				word32 s3_408;
				word32 s4_409;
				word32 s5_410;
				word32 s6_411;
				word32 s7_412;
				word32 s8_413;
				word32 s9_414;
				word32 s10_415;
				word32 s11_416;
				k_sem_give(ra_143, s2_147, a3_140, a4_141, a5_136, mstatus, dwArg14, dwArg18, dwArg60, dwArg64, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_399, out s1_400, out a0_401, out a1_402, out a2_403, out a3_404, out a4_405, out a5_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s7_412, out s8_413, out s9_414, out s10_415, out s11_416);
				return;
			}
		}
		Eq_2 a5_86;
		struct Eq_320303 * s0_105;
		word32 s1_367;
		word32 a0_368;
		word32 a1_369;
		word32 a3_370;
		word32 a4_371;
		word32 a5_372;
		word32 s2_373;
		word32 s3_374;
		word32 s4_375;
		word32 s5_376;
		word32 s6_377;
		word32 s7_378;
		word32 s8_379;
		word32 s9_380;
		word32 s10_381;
		word32 s11_382;
		word32 mstatus_383;
		bt_l2cap_send_cb(ra_25, s1_60, s1_60, 0x04, *((word32) a0_52 + 8), att_cb.isra.3(a0_52, out a5_86), a5_86, mstatus, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_105, out s1_367, out a0_368, out a1_369, out a3_370, out a4_371, out a5_372, out s2_373, out s3_374, out s4_375, out s5_376, out s6_377, out s7_378, out s8_379, out s9_380, out s10_381, out s11_382, out mstatus_383);
		s0_105->ptr009C->dw0010 = 0x00;
	}
	else
	{
		word32 s0_417;
		word32 a0_418;
		word32 s11_419;
		word32 mstatus_420;
		att_handle_rsp(ra, s1, a0, 0x05, a4, s2, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0158, out s0_417, out a0_418, out s11_419, out mstatus_420);
	}
}

