pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23058124: void att_exec_write_req()
void att_exec_write_req()
{
}

// 23058128: void att_pdu_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      att_req_sent
//      att_cfm_sent
void att_pdu_sent(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	Eq_2 s2_20 = (word32) bt_l2cap_le_lookup_tx_cid(a0, 0x04) + 0x00D8;
	ra_25 = ra;
	do
	{
		Eq_2 ra_25;
		Eq_2 a0_31;
		Eq_2 a3_34;
		Eq_2 a4_35;
		Eq_2 s3_41;
		word32 s8_315;
		word32 s2_313;
		word32 a2_312;
		word32 a1_311;
		word32 s4_314;
		Eq_2 a5_36;
		Eq_2 s1_39 = net_buf_get(ra_25, s0, s2_20, 0x00, a3, a4, mstatus, dwArg08, dwArgB8, dwArgF8, out a0_31, out a1_311, out a2_312, out a3_34, out a4_35, out a5_36, out s2_313, out s3_41, out s4_314, out s8_315);
		if (a0_31 == 0x00)
		{
			0x00 = (int8) dwArg0128;
			word32 a0_318;
			word32 s1_317;
			word32 s11_333;
			word32 s9_331;
			word32 s10_332;
			word32 s7_329;
			word32 s8_330;
			word32 s5_327;
			word32 s6_328;
			word32 s3_325;
			word32 s4_326;
			word32 a5_323;
			word32 s2_324;
			word32 a3_321;
			word32 a4_322;
			word32 a1_319;
			word32 a2_320;
			word32 s0_316;
			k_sem_give(ra_25, (word32) s1_39 + 0x00CC, a3_34, a4_35, a5_36, mstatus, dwArg14, dwArg18, s1, ra, dwArg88, dwArg94, dwArgAC, dwArg0108, dwArg0148, dwArg0188, out s0_316, out s1_317, out a0_318, out a1_319, out a2_320, out a3_321, out a4_322, out a5_323, out s2_324, out s3_325, out s4_326, out s5_327, out s6_328, out s7_329, out s8_330, out s9_331, out s10_332, out s11_333);
			return;
		}
		Eq_2 s0_52 = *((word32) s1_39 + 0x009C);
		if (s0_52 != 0x00)
		{
			s0_52 = *((word32) a5_36 + 16);
			if (a5_36 == a0_31)
			{
				*((word32) s0_52 + 0x0C) = (word16) net_buf_simple_headroom(a4_35);
				a5_36 = (word32) *((word32) a0_31 + 0x0C);
				*((word32) s0_52 + 0x0E) = (word16) a5_36;
			}
		}
		word32 a0_72;
		word32 s11_345;
		word32 s10_344;
		word32 s9_343;
		word32 s8_342;
		word32 s7_341;
		word32 s6_340;
		word32 s5_339;
		word32 s4_338;
		word32 s3_337;
		word32 a1_335;
		word32 a5_336;
		word32 s1_334;
		ra_25 = att_send(ra_25, s0_52, s1_39, s3_41, 0x00, a5_36, mstatus, dwLoc30, dwLoc2C, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg4C, dwArg58, s3, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0, out s1_334, out a0_72, out a1_335, out a3, out a4, out a5_336, out s2_20, out s3_337, out s4_338, out s5_339, out s6_340, out s7_341, out s8_342, out s9_343, out s10_344, out s11_345, out mstatus);
	} while (a0_72 != 0x00);
	0x00 = (int8) dwArg0128;
}

// 230581A0: Register Eq_2 att_chan_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out (ptr32 Eq_291533) a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      bt_gatt_get_mtu
//      bt_att_create_pdu
//      bt_att_send
//      bt_att_req_send
//      bt_att_req_cancel
Eq_2 att_chan_get(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, struct Eq_291533 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a1_102;
	ptr32 a5_105;
	struct Eq_291533 * s0_14;
	struct Eq_274 * a0_20;
	ptr32 a4_104 = (word32) *((word32) a0 + 0x0D);
	if (a4_104 != 0x04)
		a0_20 = (struct Eq_274 *) &g_t230B9228;
	else
	{
		struct Eq_291533 * a0_12 = bt_l2cap_le_lookup_rx_cid(a0, 0x04, out a5_105);
		a1_102 = 0x04;
		s0_14 = a0_12;
		if (a0_12 == null)
		{
			word32 a0_154;
			word32 a2_155;
			word32 a7_156;
			word32 t4_157;
			ra = printf(ra, &g_t230BCF88, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_154, out a1_102, out a2_155, out a3, out a4_104, out a5_105, out a7_156, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_157);
			goto l230581D6;
		}
		if ((atomic_get(&a0_12->w0040 + 44) >> 2 & 0x01) == 0x00)
			goto l230581D6;
		a0_20 = (struct Eq_274 *) &g_t230BCFA8;
	}
	word32 a0_158;
	word32 a2_159;
	word32 a7_160;
	word32 t4_161;
	ra = printf(ra, a0_20, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_158, out a1_102, out a2_159, out a3, out a4_104, out a5_105, out a7_160, out s2, out s3, out s4, out s5, out s6, out s7, out s8, out s9, out s10, out s11, out t4_161);
	s0_14 = null;
l230581D6:
	s1Out = s1;
	a0Out = s0_14;
	a1Out = a1_102;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4_104;
	a5Out = a5_105;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = s8;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 230581F8: void att_req_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void att_req_sent(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	Eq_2 s1_30 = a1;
	Eq_2 s0_14 = a0;
	if (*((word32) bt_l2cap_le_lookup_tx_cid(a0, 0x04) + 0x009C) != 0x00)
	{
		word32 s8_170;
		word32 s6_169;
		word32 s5_168;
		word32 s4_167;
		word32 s2_166;
		word32 a5_165;
		word32 a2_164;
		word32 a1_163;
		word32 a0_162;
		s0_14 = k_delayed_work_submit(0x07000530, a3, a4, mstatus, s0, dwLoc08, dwArg14, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out s1_30, out a0_162, out a1_163, out a2_164, out a3, out a4, out a5_165, out s2_166, out s3, out s4_167, out s5_168, out s6_169, out s8_170);
	}
	att_pdu_sent(ra, s0, s1_30, s0_14, a3, a4, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg4C, dwArg58, ra, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0188);
}

// 2305822E: void att_cfm_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
// Called from:
//      att_rsp_sent
void att_cfm_sent(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	bt_l2cap_le_lookup_tx_cid(a0, 0x04);
	att_pdu_sent(ra, s0, a1, a0, a3, a4, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg4C, dwArg58, ra, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0188);
}

// 23058250: void att_rsp_sent(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188)
void att_rsp_sent(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188)
{
	att_cfm_sent(ra, s0, a0, a1, a3, a4, s3, mstatus, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg4C, dwArg58, dwArg78, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0188);
}

// 23058254: void write_cb(Register word32 ra, Register Eq_2 a0, Stack word32 dwArg38)
void write_cb(word32 ra, Eq_2 a0, word32 dwArg38)
{
	struct Eq_320928 * s0_11 = *a0;
	word32 a5_103;
	word32 a2_101;
	word32 a4_102;
	struct Eq_267946 * a0_17 = bt_gatt_check_perm(a0, a0, 42, out a2_101, out a4_102, out a5_103);
	s0_11->b0014 = (byte) a0_17;
	if (a0_17 == null)
	{
		ui32 a5_51;
		struct Eq_320950 * s0_37;
		Eq_320951 a0_40;
		word32 a6_45;
		(*((word32) a0 + 8))();
		if (a0_40 >= 0x00)
		{
			if (a0_40 == (word32) s0_37->w0010)
			{
				s0_37->b0014 = 0x00;
				goto l230582C4;
			}
			a5_51 = 0x0E;
		}
		else
		{
			a5_51 = 0x0E;
			if (a0_40 <= 1)
				a5_51 = 0x00 - a0_40 & 0x00FF;
		}
		s0_37->b0014 = (byte) a5_51;
	}
l230582C4:
	0x00 = dwArg38;
}

