pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230582D6: void read_cb(Register word32 ra, Register Eq_2 a0, Register (ptr32 (ptr32 Eq_2)) a1, Register Eq_2 a4)
void read_cb(word32 ra, Eq_2 a0, union Eq_2 ** a1, Eq_2 a4)
{
	union Eq_2 * s4_17 = *a1;
	struct Eq_320987 * a1_20 = *((word32) a0 + 8);
	Eq_2 s3_21 = *s4_17;
	word32 a1_140;
	word32 a5_141;
	*((word32) net_buf_simple_add((word32) a0 + 8, 0x00, a4, out a1_140, out a5_141) + 0x0C) = a1_20;
	a1_20->b0010 = 0x00;
	word32 a2_35;
	struct Eq_321012 * a4_36;
	word32 a5_142;
	struct Eq_267946 * a0_34 = bt_gatt_check_perm(s3_21, a0, 0x15, out a2_35, out a4_36, out a5_142);
	a1_20->b0010 = (byte) a0_34;
	if (a0_34 == null)
	{
		word32 s0_43 = a4_36->dw0008;
		word32 a5_46 = (word32) a4_36->w000C;
		struct Eq_321036 * s0_58;
		Eq_2 a0_64;
		Eq_2 a4_66;
		(*((word32) a0 + 4))();
		if (a0_64 < 0x00)
		{
			ui32 a0_82 = 0x0E;
			if (a0_64 <= 1)
				a0_82 = 0x00 - a0_64 & 0x00FF;
			s0_58->b0010 = (byte) a0_82;
		}
		else
		{
			word32 a5_144;
			word32 a1_143;
			net_buf_simple_add((word32) a0_64 + 8, a0_64, a4_66, out a1_143, out a5_144);
		}
	}
}

// 23058374: Register Eq_2 bt_att_create_pdu(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register uint32 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out (ptr32 Eq_263775) s0Out, Register out Eq_263776 s1Out, Register out (ptr32 Eq_263775) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_263782) s2Out, Register out (ptr32 Eq_263783) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      gatt_notify
//      gatt_indicate
//      bt_gatt_exchange_mtu
//      gatt_read_type_rsp
//      bt_gatt_read
//      bt_gatt_write_without_response_cb
//      bt_gatt_write
//      gatt_prepare_write_rsp
//      bt_gatt_unsubscribe
//      att_indicate
//      att_mtu_req
//      send_err_rsp.part.7
//      att_read_group_req
//      att_read_mult_req
//      att_read_req
//      att_read_type_req
//      att_find_type_req
//      att_find_info_req
//      att_signed_write_cmd
Eq_2 bt_att_create_pdu(Eq_2 ra, Eq_2 s1, Eq_2 a0, uint32 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgE8, struct Eq_263775 & s0Out, union Eq_263776 & s1Out, struct Eq_263775 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, struct Eq_263782 & s2Out, struct Eq_263783 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	struct Eq_263775 * a0_20;
	word32 a1_269;
	word32 s4_270;
	word32 s7_271;
	word32 s8_272;
	word32 s9_273;
	word32 s10_274;
	Eq_2 s5_124;
	ptr32 s6_125;
	struct Eq_263782 * s2_121;
	struct Eq_263783 * s3_122;
	ptr32 s11_120;
	Eq_263776 s1_118;
	Eq_2 a4_115;
	ptr32 a5_104;
	ptr32 a2_113;
	Eq_2 a3_114;
	Eq_2 ra_117 = att_chan_get(ra, a0, a3, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out s1_118, out a0_20, out a1_269, out a2_113, out a3_114, out a4_115, out a5_104, out s2_121, out s3_122, out s4_270, out s5_124, out s6_125, out s7_271, out s8_272, out s9_273, out s10_274, out s11_120);
	struct Eq_263775 * s0_155 = a0_20;
	if (a0_20 == null)
	{
l230583A2:
		s0Out = s0_155;
		s1Out = s1_118;
		a0Out = s0_155;
		a2Out = a2_113;
		a3Out = a3_114;
		a4Out = a4_115;
		a5Out = a5_104;
		s2Out = s2_121;
		s3Out = s3_122;
		s4Out = dwArg04;
		s5Out = s5_124;
		s6Out = s6_125;
		s11Out = s11_120;
		mstatusOut = mstatus;
		return ra_117;
	}
	if ((word32) a0_20->w0056 < a2 + 0x01)
	{
		word32 a0_275;
		word32 a1_276;
		word32 a7_277;
		word32 s4_278;
		word32 s7_279;
		word32 s8_280;
		word32 s9_281;
		word32 s10_282;
		word32 t4_283;
		ra_117 = printf(ra_117, &g_t230BD054, a3_114, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_118, out a0_275, out a1_276, out a2_113, out a3_114, out a4_115, out a5_104, out a7_277, out s2_121, out s3_122, out s4_278, out s5_124, out s6_125, out s7_279, out s8_280, out s9_281, out s10_282, out s11_120, out t4_283);
		s0_155 = null;
		goto l230583A2;
	}
	Eq_2 a2_48;
	Eq_2 a4_44;
	word32 a0_43 = att_op_get_type(s1_118, out a4_44);
	Eq_2 a5_46 = 0x02;
	if (a0_43 != 0x02)
	{
		a5_46.u0 = 0x04;
		a2_48.u0 = ~0x00;
		if (a0_43 != 0x04)
		{
l230583C8:
			ra_117 = bt_l2cap_create_pdu_timeout(ra_117, 0x00, a2_48, a3_114, a4_44, a5_46, s5_124, mstatus, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg74, dwArg7C, dwArg88, dwArgC8, dwArgE8, out s1_118, out a2_113, out a3_114, out a4_115, out s2_121, out s3_122, out s5_124, out s6_125, out s11_120, out mstatus);
			s0_155 = null;
			if (true)
			{
				word32 a0_285;
				word32 a1_286;
				word32 a7_287;
				word32 s4_288;
				word32 s7_289;
				word32 s8_290;
				word32 s9_291;
				word32 s10_292;
				word32 t4_293;
				ra_117 = printf(ra_117, &g_t230BB728, a3_114, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_118, out a0_285, out a1_286, out a2_113, out a3_114, out a4_115, out a5_104, out a7_287, out s2_121, out s3_122, out s4_288, out s5_124, out s6_125, out s7_289, out s8_290, out s9_291, out s10_292, out s11_120, out t4_293);
			}
			else
			{
				word32 a1_284;
				*net_buf_simple_add(0x08, 0x01, a4_115, out a1_284, out a5_104) = (byte) s1_118;
			}
			goto l230583A2;
		}
	}
	a2_48.u0 = 0x07000530;
	goto l230583C8;
}

// 230583F2: void att_indicate(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack (ptr32 Eq_271981) dwArg44, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void att_indicate(Eq_2 ra, Eq_2 s0, Eq_2 a5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, struct Eq_271981 * dwArg44, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	Eq_2 s0_28;
	Eq_2 s1_29;
	Eq_2 a3_36;
	ptr32 mstatus_52;
	Eq_2 a5_61;
	Eq_2 s0_64;
	Eq_2 s1_65;
	Eq_2 a0_79;
	ptr32 mstatus_81;
	word32 a1_188;
	word32 a2_189;
	word32 a4_190;
	word32 a5_191;
	word32 a2_192;
	word32 a3_193;
	word32 a4_194;
	word32 s2_195;
	word32 s3_196;
	word32 s4_197;
	word32 s5_198;
	word32 s6_199;
	word32 s11_200;
	Eq_2 ra_63 = bt_att_create_pdu(bt_gatt_notification(ra, s0, s0, net_buf_simple_pull_le16(a5, out a1_188, out a2_189, out a4_190, out a5_191), dwArg44, (word32) dwArg44->ptr0008->w000C, s6, mstatus, out s0_28, out s1_29, out a3_36, out mstatus_52), s1_29, s0_28, 0x00, a3_36, mstatus_52, dwLoc18, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, dwArg68, ra, dwArg7C, dwArgA8, dwArgC8, out s0_64, out s1_65, out a0_79, out a2_192, out a3_193, out a4_194, out a5_61, out s2_195, out s3_196, out s4_197, out s5_198, out s6_199, out s11_200, out mstatus_81);
	if (a0_79 != 0x00)
	{
		word32 s0_201;
		word32 s1_202;
		word32 a0_203;
		word32 a1_204;
		word32 a3_205;
		word32 a4_206;
		word32 a5_207;
		word32 s2_208;
		word32 s3_209;
		word32 s4_210;
		word32 s5_211;
		word32 s6_212;
		word32 s7_213;
		word32 s8_214;
		word32 s9_215;
		word32 s10_216;
		word32 s11_217;
		word32 mstatus_218;
		bt_l2cap_send_cb(ra_63, s1_65, s0_64, 0x04, a0_79, 587563566, a5_61, mstatus_81, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, dwArg68, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_201, out s1_202, out a0_203, out a1_204, out a3_205, out a4_206, out a5_207, out s2_208, out s3_209, out s4_210, out s5_211, out s6_212, out s7_213, out s8_214, out s9_215, out s10_216, out s11_217, out mstatus_218);
	}
}

// 2305843E: void att_mtu_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 Eq_321357) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138)
void att_mtu_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, struct Eq_321357 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138)
{
	if (((word32) a5->b0001 << 8 | (word32) a5->b0000) > 22)
	{
		Eq_2 a4_31;
		Eq_2 s1_36;
		Eq_2 s2_39;
		Eq_2 a0_50;
		ptr32 mstatus_52;
		word32 s11_230;
		word32 s6_229;
		word32 s5_228;
		word32 s4_227;
		word32 s3_226;
		word32 a5_225;
		word32 a3_224;
		word32 a2_223;
		word32 s0_222;
		Eq_2 ra_34 = bt_att_create_pdu(ra, a0, *a0, 0x02, a3, mstatus, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg7C, dwArgA8, dwArgC8, out s0_222, out s1_36, out a0_50, out a2_223, out a3_224, out a4_31, out a5_225, out s2_39, out s3_226, out s4_227, out s5_228, out s6_229, out s11_230, out mstatus_52);
		if (a0_50 != 0x00)
		{
			word32 a5_232;
			word32 a1_231;
			Eq_2 a0_62 = net_buf_simple_add((word32) a0_50 + 8, 0x02, a4_31, out a1_231, out a5_232);
			*a0_62 = ~0x08;
			*((word32) a0_62 + 1) = 0x00;
			Eq_321453 s0_84;
			struct Eq_321454 * s1_85;
			word32 s5_241;
			word32 s6_242;
			word32 s7_243;
			word32 s4_240;
			word32 s3_239;
			word32 s2_238;
			word32 a5_237;
			word32 a4_236;
			word32 a3_235;
			word32 a1_234;
			word32 a0_233;
			word32 s8_244;
			word32 s9_245;
			word32 s10_246;
			word32 s11_247;
			word32 mstatus_248;
			bt_l2cap_send_cb(ra_34, s1_36, s2_39, 0x04, a0_50, 0x23058250, ~0x08, mstatus_52, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg5C, s1, ra, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, out s0_84, out s1_85, out a0_233, out a1_234, out a3_235, out a4_236, out a5_237, out s2_238, out s3_239, out s4_240, out s5_241, out s6_242, out s7_243, out s8_244, out s9_245, out s10_246, out s11_247, out mstatus_248);
			Eq_321453 a5_104 = s0_84;
			if (s0_84 > 0x00F7)
				a5_104.u0 = 0x00F7;
			s1_85->w0042 = (word16) a5_104;
			s1_85->w0056 = (word16) a5_104;
		}
	}
}

// 230584C4: void send_err_rsp.part.7(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
// Called from:
//      bt_att_recv
//      att_read_group_req
//      att_read_mult_req
//      att_read_req
//      att_read_type_req
//      att_find_type_req
//      att_find_info_req
//      att_signed_write_cmd
void send_err_rsp.part.7(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 a4_28;
	uint32 s0_32;
	Eq_2 s1_33;
	word32 s2_36;
	word32 s3_37;
	Eq_2 a0_47;
	ptr32 mstatus_49;
	word32 a2_185;
	word32 a3_186;
	word32 a5_187;
	word32 s4_188;
	word32 s5_189;
	word32 s6_190;
	word32 s11_191;
	Eq_2 ra_31 = bt_att_create_pdu(ra, a0, a0, 0x04, a3, mstatus, dwLoc28, dwArg00, dwArg04, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg6C, dwArg98, dwArgB8, out s0_32, out s1_33, out a0_47, out a2_185, out a3_186, out a4_28, out a5_187, out s2_36, out s3_37, out s4_188, out s5_189, out s6_190, out s11_191, out mstatus_49);
	if (a0_47 == 0x00)
		0x00 = (int8) dwArg0128;
	else
	{
		Eq_2 a5_65;
		word32 a1_192;
		Eq_2 a0_63 = net_buf_simple_add((word32) a0_47 + 8, 0x04, a4_28, out a1_192, out a5_65);
		*((word32) a0_63 + 1) = (byte) s0_32;
		*a0_63 = (byte) s3_37;
		*((word32) a0_63 + 2) = (byte) (s0_32 >> 8);
		*((word32) a0_63 + 3) = (byte) s2_36;
		0x00 = (int8) dwArg0128;
		word32 s0_193;
		word32 s1_194;
		word32 a0_195;
		word32 a1_196;
		word32 a3_197;
		word32 a4_198;
		word32 a5_199;
		word32 s2_200;
		word32 s3_201;
		word32 s4_202;
		word32 s5_203;
		word32 s6_204;
		word32 s7_205;
		word32 s8_206;
		word32 s9_207;
		word32 s10_208;
		word32 s11_209;
		word32 mstatus_210;
		bt_l2cap_send_cb(ra_31, s1_33, s1_33, 0x04, dwArg0100, 0x23058250, a5_65, mstatus_49, dwArg30, dwArg34, dwArg40, dwArg44, dwArg48, a0_47, dwArg58, dwArg74, dwArg7C, dwArg88, dwArg8C, dwArgA4, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_193, out s1_194, out a0_195, out a1_196, out a3_197, out a4_198, out a5_199, out s2_200, out s3_201, out s4_202, out s5_203, out s6_204, out s7_205, out s8_206, out s9_207, out s10_208, out s11_209, out mstatus_210);
	}
}

// 2305852E: void bt_att_recv(Register Eq_2 ra, Register word32 a0, Register (ptr32 Eq_321652) a1, Register Eq_2 a3, Register ptr32 mstatus, Stack word32 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void bt_att_recv(Eq_2 ra, word32 a0, struct Eq_321652 * a1, Eq_2 a3, ptr32 mstatus, word32 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	struct Eq_321661 * sp_161 = fp + -48;
	if ((word32) a1->w000C == 0x00)
	{
		word32 s11_348;
		word32 t4_349;
		word32 s7_344;
		word32 s9_346;
		word32 s10_347;
		word32 s8_345;
		word32 s3_340;
		word32 s5_342;
		word32 s6_343;
		word32 s4_341;
		word32 a4_336;
		word32 a7_338;
		word32 s2_339;
		word32 a5_337;
		word32 a0_332;
		word32 a2_334;
		word32 a3_335;
		word32 a1_333;
		word32 s1_331;
		printf(ra, &g_t230BD08C, a3, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_331, out a0_332, out a1_333, out a2_334, out a3_335, out a4_336, out a5_337, out a7_338, out s2_339, out s3_340, out s4_341, out s5_342, out s6_343, out s7_344, out s8_345, out s9_346, out s10_347, out s11_348, out t4_349);
	}
	else
	{
		word32 a1_328;
		word32 a5_330;
		word32 a4_329;
		Eq_2 a0_23 = net_buf_simple_pull_mem((char *) a1 + 8, 0x01, out a1_328, out a4_329, out a5_330);
		word32 a2_27 = (word32) *a0_23;
		struct Eq_321688 * a4_29 = g_a230BD110;
		ui32 a5_31;
		ptr32 s0_139 = 587976976;
		for (a5_31 = 0x00; a5_31 != 0x1C; ++a5_31)
		{
			Eq_2 a3_113;
			Eq_2 ra_124;
			Eq_2 s3_129;
			union Eq_2 * s4_130;
			if ((word32) a4_29->b0000 == a2_27)
			{
				int32 s1_125;
				struct Eq_321744 * s1_77 = a5_31 << 0x03;
				if ((word32) a1->w000C < (word32) s1_77->b230BD111)
				{
					word32 a1_351;
					word32 a0_350;
					word32 a2_352;
					word32 a3_353;
					word32 a4_354;
					word32 a5_355;
					word32 a7_356;
					word32 s2_357;
					word32 s5_358;
					word32 s6_359;
					word32 s7_360;
					word32 s8_361;
					word32 s9_362;
					word32 s10_363;
					word32 s11_364;
					word32 t4_365;
					ra_124 = printf(ra, &g_t230BBC20, 0x1C, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_125, out a0_350, out a1_351, out a2_352, out a3_353, out a4_354, out a5_355, out a7_356, out s2_357, out s3_129, out s4_130, out s5_358, out s6_359, out s7_360, out s8_361, out s9_362, out s10_363, out s11_364, out t4_365);
					a3_113.u0 = 0x04;
				}
				else
				{
					Eq_2 a0_97;
					word32 a6_248;
					word32 t1_249;
					word32 t5_250;
					word32 t6_251;
					s1_77->ptr230BD114();
					a3_113 = a0_97;
				}
				if ((word32) (s0_139 + s1_125)->b0002 == 0x01 && (a3_113 != 0x00 && (word32) (*s3_129) != 0x00))
					goto l230585EE;
				goto l2305854E;
			}
			++a4_29;
		}
		word32 s1_366;
		word32 a0_367;
		word32 a1_368;
		word32 a2_369;
		word32 a3_370;
		word32 a4_371;
		word32 a5_372;
		word32 a7_373;
		word32 s2_374;
		word32 s5_375;
		word32 s6_376;
		word32 s7_377;
		word32 s8_378;
		word32 s9_379;
		word32 s10_380;
		word32 s11_381;
		word32 t4_382;
		ra_124 = printf(ra, &g_t230BD0AC, 0x1C, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_366, out a0_367, out a1_368, out a2_369, out a3_370, out a4_371, out a5_372, out a7_373, out s2_374, out s3_129, out s4_130, out s5_375, out s6_376, out s7_377, out s8_378, out s9_379, out s10_380, out s11_381, out t4_382);
		Eq_263776 a1_69 = (word32) *s3_129;
		word32 a4_383;
		if (att_op_get_type(a1_69, out a4_383) != 0x00)
		{
			a3_113.u0 = 0x06;
			if (a1_69 != 0x00)
			{
l230585EE:
				send_err_rsp.part.7(ra_124, *s4_130, a3_113, s3_129, mstatus, sp_161->t0000, sp_161->t0004, sp_161->t0010, sp_161->t0014, sp_161->t0020, sp_161->t0024, sp_161->t0028, sp_161->t0030, sp_161->t0034, sp_161->t0040, sp_161->t0044, sp_161->t0048, sp_161->t004C, sp_161->t0058, sp_161->t006C, sp_161->t0074, sp_161->t007C, sp_161->t0088, sp_161->t008C, sp_161->t0098, sp_161->t00A4, sp_161->t00A8, sp_161->t00B8, sp_161->t00C8, sp_161->t00D8, sp_161->t00E8, sp_161->t00F8, sp_161->t0100, sp_161->t0108, sp_161->t0118, sp_161->t0128, sp_161->t0138, sp_161->t0148, sp_161->t0158);
			}
		}
	}
l2305854E:
	0x00 = dwArg0128;
}

