pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23058606: void att_read_group_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_321994) a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void att_read_group_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_321994 * a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	Eq_2 a2_22 = (word32) a1->b000C + ~0x03 & 0x00FF;
	if (a2_22 != 0x02 && a2_22 != 0x10)
		return;
	Eq_2 s5_30 = *a0;
	word32 a1_658;
	word32 a4_659;
	word32 a5_660;
	Eq_2 a0_37 = net_buf_simple_pull_mem((char *) a1 + 8, 0x04, out a1_658, out a4_659, out a5_660);
	uint32 s0_45 = (word32) *((word32) a0_37 + 1) << 8 | (word32) (*a0_37);
	uint32 s2_52 = (word32) *((word32) a0_37 + 3) << 8 | (word32) (*((word32) a0_37 + 2));
	word32 a3_661;
	if (bt_uuid_create(fp + -72, (word32) a0_37 + 4, a2_22, out a3_661) == 0x00)
		return;
	Eq_2 a3_113;
	Eq_2 dwLoc50_385;
	Eq_2 dwLoc4C_390;
	if (s0_45 != 0x00 && (s2_52 != 0x00 && s2_52 >= s0_45))
	{
		word32 a0_76;
		word32 s8_668;
		word32 a6_667;
		word32 a5_666;
		word32 a4_665;
		word32 a3_664;
		word32 a1_662;
		word32 a2_663;
		bt_uuid_cmp(fp + -72, fp + -80, out a0_76, out a1_662, out a2_663, out a3_664, out a4_665, out a5_666, out a6_667, out s8_668);
		Eq_2 s1_184 = 0x03000000;
		dwLoc50_385 = SEQ(0xF800, bLoc4F, 0x00);
		if (a0_76 == 0x00)
		{
l23058692:
			Eq_2 a3_175;
			Eq_2 a4_189;
			Eq_2 s0_193;
			struct Eq_2096 * s11_196;
			Eq_2 s2_197;
			Eq_2 a0_208;
			ptr32 mstatus_210;
			word32 s4_687;
			word32 s6_689;
			word32 s5_688;
			word32 a3_684;
			word32 s3_686;
			word32 a5_685;
			word32 a5_681;
			word32 a2_683;
			word32 s1_682;
			word32 a1_678;
			word32 a4_680;
			word32 a2_679;
			word32 a0_677;
			word32 t1_676;
			Eq_2 ra_192 = bt_att_create_pdu(memset(ra, fp + -52, 0x00, 0x14, out t1_676, out a0_677, out a1_678, out a2_679, out a3_175, out a4_680, out a5_681), s1_184, *a0, 0x01, a3_175, mstatus, dwLoc58, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg3C, dwArg68, dwArg88, out s0_193, out s1_682, out a0_208, out a2_683, out a3_684, out a4_189, out a5_685, out s2_197, out s3_686, out s4_687, out s5_688, out s6_689, out s11_196, out mstatus_210);
			if (a0_208 == 0x00)
				return;
			word32 a1_690;
			word32 a5_691;
			*net_buf_simple_add((word32) a0_208 + 8, 0x01, a4_189, out a1_690, out a5_691) = 0x00;
			Eq_2 a1_233;
			Eq_2 a2_234;
			Eq_2 a4_236;
			Eq_2 a5_237;
			Eq_2 s5_248;
			word32 s4_696;
			word32 s11_697;
			word32 s1_693;
			word32 s2_695;
			word32 a0_694;
			word32 s0_692;
			Eq_2 ra_240 = bt_gatt_foreach_attr(ra_192, s0_193, s2_197, &g_t23057792, fp + -52, s11_196, out s0_692, out s1_693, out a0_694, out a1_233, out a2_234, out a4_236, out a5_237, out s2_695, out s4_696, out s5_248, out s11_697);
			Eq_2 s1_261 = (word32) *a5_237;
			if (s1_261 != 0x00)
			{
				word32 s11_714;
				word32 mstatus_715;
				word32 s8_711;
				word32 s10_713;
				word32 s9_712;
				word32 s5_708;
				word32 s7_710;
				word32 s6_709;
				word32 s2_705;
				word32 s4_707;
				word32 s3_706;
				word32 a3_702;
				word32 a5_704;
				word32 a4_703;
				word32 s1_699;
				word32 a1_701;
				word32 a0_700;
				word32 s0_698;
				bt_l2cap_send_cb(ra_240, s1_261, s5_248, 0x04, a2_234, 0x23058250, a5_237, mstatus_210, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwArg14, dwArg1C, dwArg28, dwArg2C, s3, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_698, out s1_699, out a0_700, out a1_701, out a3_702, out a4_703, out a5_704, out s2_705, out s3_706, out s4_707, out s5_708, out s6_709, out s7_710, out s8_711, out s9_712, out s10_713, out s11_714, out mstatus_715);
				return;
			}
			else
			{
				ptr32 mstatus_306;
				Eq_2 s3_311;
				Eq_2 s5_313;
				word32 s6_726;
				word32 s8_727;
				word32 a5_723;
				word32 s4_725;
				word32 s2_724;
				word32 a2_720;
				word32 a4_722;
				word32 a3_721;
				word32 s1_717;
				word32 a1_719;
				word32 a0_718;
				word32 s0_716;
				send_err_rsp.part.7(net_buf_unref(ra_240, s1_261, a2_234, a1_233, a4_236, mstatus_210, dwLoc60, dwLoc5C, dwLoc58, s2, dwArg18, a2_22, a0_208, s3, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_716, out s1_717, out a0_718, out a1_719, out a2_720, out a3_721, out a4_722, out a5_723, out s2_724, out s3_311, out s4_725, out s5_313, out s6_726, out s8_727, out mstatus_306), s5_313, 0x0A, s3_311, mstatus_306, dwLoc60, dwLoc5C, dwLoc50_385, dwLoc4C_390, dwLoc40, s4, s2, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg0C, dwArg14, dwArg1C, dwArg28, dwArg2C, a0_208, s3, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8);
				return;
			}
		}
		word32 a0_97;
		word32 s8_675;
		word32 a4_672;
		word32 a6_674;
		word32 a5_673;
		word32 a3_671;
		word32 a2_670;
		word32 a1_669;
		bt_uuid_cmp(fp + -72, fp + -76, out a0_97, out a1_669, out a2_670, out a3_671, out a4_672, out a5_673, out a6_674, out s8_675);
		s1_184.u0 = 0x02FFF801;
		dwLoc4C_390 = SEQ(0xF801, bLoc4B, 0x00);
		if (a0_97 == 0x00)
			goto l23058692;
		a3_113.u0 = 0x10;
	}
	else
		a3_113.u0 = 0x01;
	send_err_rsp.part.7(ra, s5_30, a3_113, a0, mstatus, dwLoc60, dwLoc5C, dwLoc50_385, dwLoc4C_390, dwLoc40, s4, s2, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg0C, dwArg14, dwArg1C, dwArg28, dwArg2C, dwArg38, s3, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8);
}

