pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23058746: void att_read_mult_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138)
void att_read_mult_req(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138)
{
	Eq_2 a3_28;
	Eq_2 s1_46;
	Eq_2 a0_60;
	ptr32 mstatus_62;
	word32 s6_396;
	word32 s5_395;
	word32 s4_394;
	word32 s3_393;
	word32 a5_392;
	word32 a4_391;
	word32 a3_390;
	word32 a5_389;
	word32 a4_388;
	word32 a2_387;
	word32 a1_386;
	word32 a0_385;
	word32 t1_384;
	struct Eq_322397 * s2_106;
	struct Eq_2096 * s11_105;
	Eq_2 s0_102;
	Eq_2 a2_188;
	Eq_2 ra_101 = bt_att_create_pdu(memset(ra, fp + -52, 0x00, 0x14, out t1_384, out a0_385, out a1_386, out a2_387, out a3_28, out a4_388, out a5_389), *s0, s0, 0x00, a3_28, mstatus, dwLoc38, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, ra, dwArg88, dwArgA8, out s0_102, out s1_46, out a0_60, out a2_188, out a3_390, out a4_391, out a5_392, out s2_106, out s3_393, out s4_394, out s5_395, out s6_396, out s11_105, out mstatus_62);
	if (a0_60 != 0x00)
	{
		Eq_2 s1_103 = 0x01;
		word32 s5_109 = 0x23058000;
		do
		{
			Eq_2 a5_75 = (word32) s2_106->w000C;
			if (s1_103 >= a5_75)
			{
				word32 s0_403;
				word32 s1_404;
				word32 a0_405;
				word32 a1_406;
				word32 a3_407;
				word32 a4_408;
				word32 a5_409;
				word32 s2_410;
				word32 s3_411;
				word32 s4_412;
				word32 s5_413;
				word32 s6_414;
				word32 s7_415;
				word32 s8_416;
				word32 s9_417;
				word32 s10_418;
				word32 s11_419;
				word32 mstatus_420;
				bt_l2cap_send_cb(ra_101, s1_103, s0_102, 0x04, a2_188, 0x23058250, a5_75, mstatus_62, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg3C, a0_60, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_403, out s1_404, out a0_405, out a1_406, out a3_407, out a4_408, out a5_409, out s2_410, out s3_411, out s4_412, out s5_413, out s6_414, out s7_415, out s8_416, out s9_417, out s10_418, out s11_419, out mstatus_420);
				goto l230587D0;
			}
			word32 a2_398;
			word32 a1_397;
			word32 a4_399;
			word32 a5_400;
			Eq_2 a0_79 = net_buf_simple_pull_le16(a5_75, out a1_397, out a2_398, out a4_399, out a5_400);
			byte bLoc24_255 = (byte) s1_103;
			Eq_2 a0_93;
			Eq_2 a1_94;
			Eq_2 a4_97;
			word32 a5_401;
			word32 s4_402;
			ra_101 = bt_gatt_foreach_attr(ra_101, a0_79, a0_79, s5_109 + 726, fp + -52, s11_105, out s0_102, out s1_103, out a0_93, out a1_94, out a2_188, out a4_97, out a5_401, out s2_106, out s4_402, out s5_109, out s11_105);
		} while ((word32) bLoc24_255 == 0x00);
		ptr32 mstatus_131;
		Eq_2 s0_133;
		Eq_2 s3_136;
		word32 s1_421;
		word32 a0_422;
		word32 a1_423;
		word32 a2_424;
		word32 a3_425;
		word32 a4_426;
		word32 a5_427;
		word32 s2_428;
		word32 s4_429;
		word32 s5_430;
		word32 s6_431;
		word32 s8_432;
		send_err_rsp.part.7(net_buf_unref(ra_101, s1_103, a0_93, a1_94, a4_97, mstatus_62, dwLoc40, dwLoc3C, dwLoc38, dwLoc18, dwArg38, s1_46, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_133, out s1_421, out a0_422, out a1_423, out a2_424, out a3_425, out a4_426, out a5_427, out s2_428, out s3_136, out s4_429, out s5_430, out s6_431, out s8_432, out mstatus_131), s0_133, (word32) bLoc24_255, s3_136, mstatus_131, dwLoc40, dwLoc3C, dwLoc30, s4, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg2C, dwArg34, dwArg3C, a0_60, dwArg4C, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118);
l230587D0:
	}
}

// 230587E8: void att_read_rsp(Register Eq_2 ra, Register Eq_2 s1, Register ui32 a3, Register Eq_2 s4, Register word32 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
// Called from:
//      att_read_blob_req
//      att_read_req
void att_read_rsp(Eq_2 ra, Eq_2 s1, ui32 a3, Eq_2 s4, word32 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	word16 wLoc2E_268 = SLICE(s6, word16, 16);
	if (bt_gatt_change_aware() != 0x00 && a3 != 0x00)
	{
		Eq_2 a3_41;
		word32 s0_58;
		struct Eq_2096 * s11_61;
		Eq_2 s2_62;
		Eq_2 s3_63;
		word32 s5_65;
		Eq_2 a0_73;
		ptr32 mstatus_75;
		word32 t1_321;
		word32 a0_322;
		word32 a1_323;
		word32 a2_324;
		word32 a4_325;
		word32 a5_326;
		word32 s1_327;
		word32 a2_328;
		word32 a3_329;
		word32 a4_330;
		word32 a5_331;
		word32 s4_332;
		word32 s6_333;
		Eq_2 ra_57 = bt_att_create_pdu(memset(ra, fp + -52, 0x00, 0x14, out t1_321, out a0_322, out a1_323, out a2_324, out a3_41, out a4_325, out a5_326), s1, s1, 0x00, a3_41, mstatus, dwLoc38, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, ra, dwArg88, dwArgA8, out s0_58, out s1_327, out a0_73, out a2_328, out a3_329, out a4_330, out a5_331, out s2_62, out s3_63, out s4_332, out s5_65, out s6_333, out s11_61, out mstatus_75);
		if (a0_73 != 0x00)
		{
			byte bLoc24_249 = (byte) s0_58;
			Eq_2 a1_91;
			Eq_2 a2_92;
			Eq_2 a4_94;
			Eq_2 a5_95;
			Eq_2 s1_100;
			word32 s0_334;
			word32 a0_335;
			word32 s2_336;
			word32 s4_337;
			word32 s5_338;
			word32 s11_339;
			Eq_2 ra_98 = bt_gatt_foreach_attr(ra_57, s2_62, s2_62, &g_t230582D6, fp + -52, s11_61, out s0_334, out s1_100, out a0_335, out a1_91, out a2_92, out a4_94, out a5_95, out s2_336, out s4_337, out s5_338, out s11_339);
			Eq_2 dwLoc30_269 = SEQ(wLoc2E_268, (word16) s5_65);
			if ((word32) bLoc24_249 != 0x00)
			{
				ptr32 mstatus_162;
				Eq_2 s1_165;
				Eq_2 s3_167;
				word32 s0_340;
				word32 a0_341;
				word32 a1_342;
				word32 a2_343;
				word32 a3_344;
				word32 a4_345;
				word32 a5_346;
				word32 s2_347;
				word32 s4_348;
				word32 s5_349;
				word32 s6_350;
				word32 s8_351;
				send_err_rsp.part.7(net_buf_unref(ra_98, s1_100, a2_92, a1_91, a4_94, mstatus_75, dwLoc40, dwLoc3C, dwLoc38, dwLoc18, dwArg38, s3_63, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_340, out s1_165, out a0_341, out a1_342, out a2_343, out a3_344, out a4_345, out a5_346, out s2_347, out s3_167, out s4_348, out s5_349, out s6_350, out s8_351, out mstatus_162), s1_165, (word32) bLoc24_249, s3_167, mstatus_162, dwLoc40, dwLoc3C, dwLoc30_269, s4, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg2C, dwArg34, dwArg3C, a0_73, dwArg4C, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118);
			}
			else
			{
				word32 s0_352;
				word32 s1_353;
				word32 a0_354;
				word32 a1_355;
				word32 a3_356;
				word32 a4_357;
				word32 a5_358;
				word32 s2_359;
				word32 s3_360;
				word32 s4_361;
				word32 s5_362;
				word32 s6_363;
				word32 s7_364;
				word32 s8_365;
				word32 s9_366;
				word32 s10_367;
				word32 s11_368;
				word32 mstatus_369;
				bt_l2cap_send_cb(ra_98, s1_100, s1_100, 0x04, a2_92, 0x23058250, a5_95, mstatus_75, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg3C, a0_73, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_352, out s1_353, out a0_354, out a1_355, out a3_356, out a4_357, out a5_358, out s2_359, out s3_360, out s4_361, out s5_362, out s6_363, out s7_364, out s8_365, out s9_366, out s10_367, out s11_368, out mstatus_369);
			}
		}
	}
	0x00 = dwArg0198;
}

// 23058898: void att_read_blob_req(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_322791) a5, Register Eq_2 s4, Register word32 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void att_read_blob_req(Eq_2 ra, Eq_2 s1, struct Eq_322791 * a5, Eq_2 s4, word32 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	ui32 a3_14 = (word32) a5->b0000 | (word32) a5->b0001 << 8;
	att_read_rsp(ra, s1, a3_14, s4, s6, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0198);
}

