pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230588BA: void att_read_req(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_322841) a5, Register Eq_2 s4, Register word32 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void att_read_req(Eq_2 ra, Eq_2 s1, struct Eq_322841 * a5, Eq_2 s4, word32 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	ui32 a3_12 = (word32) a5->b0000 | (word32) a5->b0001 << 8;
	att_read_rsp(ra, s1, a3_12, s4, s6, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0198);
}

// 230588D2: void att_read_type_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register (ptr32 Eq_322891) a1, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void att_read_type_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, struct Eq_322891 * a1, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	Eq_2 a2_22 = (word32) a1->b000C + ~0x03 & 0x00FF;
	if (a2_22 != 0x02 && a2_22 != 0x10)
		return;
	Eq_2 s4_213 = *a0;
	word32 a1_494;
	word32 a4_495;
	word32 a5_496;
	Eq_2 a0_37 = net_buf_simple_pull_mem((char *) a1 + 8, 0x04, out a1_494, out a4_495, out a5_496);
	uint32 s0_45 = (word32) *((word32) a0_37 + 1) << 8 | (word32) (*a0_37);
	uint32 s2_52 = (word32) *((word32) a0_37 + 3) << 8 | (word32) (*((word32) a0_37 + 2));
	Eq_2 s3_212 = a0;
	word32 a3_497;
	if (bt_uuid_create(fp + -76, (word32) a0_37 + 4, a2_22, out a3_497) == 0x00)
		return;
	Eq_2 a3_224;
	if (s0_45 != 0x00 && (s2_52 != 0x00 && s2_52 >= s0_45))
	{
		Eq_2 a3_78;
		Eq_2 a4_92;
		Eq_2 s0_96;
		struct Eq_2096 * s11_99;
		Eq_2 s2_100;
		Eq_2 s3_101;
		word32 a0_111;
		ptr32 mstatus_113;
		word32 s5_509;
		word32 s6_510;
		word32 a5_507;
		word32 s4_508;
		word32 a2_505;
		word32 a3_506;
		word32 a5_503;
		word32 s1_504;
		word32 a2_501;
		word32 a4_502;
		word32 a1_500;
		word32 t1_498;
		word32 a0_499;
		Eq_2 ra_95 = bt_att_create_pdu(memset(ra, fp + -56, 0x00, 0x18, out t1_498, out a0_499, out a1_500, out a2_501, out a3_78, out a4_502, out a5_503), 0x0E, *a0, 0x01, a3_78, mstatus, dwLoc58, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwLoc08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg2C, dwArg3C, dwArg68, dwArg88, out s0_96, out s1_504, out a0_111, out a2_505, out a3_506, out a4_92, out a5_507, out s2_100, out s3_101, out s4_508, out s5_509, out s6_510, out s11_99, out mstatus_113);
		if (a0_111 == 0x00)
			return;
		word32 a5_512;
		word32 a1_511;
		Eq_2 a0_123 = net_buf_simple_add(a0_111 + 0x08, 0x01, a4_92, out a1_511, out a5_512);
		*a0_123 = 0x00;
		dwLoc4C = s3_101;
		dwArg38 = a0_123;
		Eq_2 a1_136;
		Eq_2 a2_137;
		Eq_2 a4_139;
		Eq_2 a5_140;
		Eq_2 s4_150;
		word32 s5_517;
		word32 s11_518;
		word32 a0_515;
		word32 s2_516;
		word32 s1_514;
		word32 s0_513;
		Eq_2 ra_143 = bt_gatt_foreach_attr(ra_95, s0_96, s2_100, &g_t230578B4, fp + -56, s11_99, out s0_513, out s1_514, out a0_515, out a1_136, out a2_137, out a4_139, out a5_140, out s2_516, out s4_150, out s5_517, out s11_518);
		if (false)
		{
			word32 mstatus_536;
			word32 s10_534;
			word32 s11_535;
			word32 s8_532;
			word32 s9_533;
			word32 s6_530;
			word32 s7_531;
			word32 s4_528;
			word32 s5_529;
			word32 s2_526;
			word32 s3_527;
			word32 a3_523;
			word32 a5_525;
			word32 a4_524;
			word32 s1_520;
			word32 a1_522;
			word32 a0_521;
			word32 s0_519;
			bt_l2cap_send_cb(ra_143, 0x0A, s4_150, 0x04, a2_137, 0x23058250, a5_140, mstatus_113, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc18, dwLoc0C, dwLoc08, dwArg14, dwArg1C, dwArg28, dwArg2C, s3, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, out s0_519, out s1_520, out a0_521, out a1_522, out a3_523, out a4_524, out a5_525, out s2_526, out s3_527, out s4_528, out s5_529, out s6_530, out s7_531, out s8_532, out s9_533, out s10_534, out s11_535, out mstatus_536);
			return;
		}
		word32 s8_548;
		word32 s6_547;
		word32 s5_546;
		word32 s2_545;
		word32 a3_542;
		word32 a5_544;
		word32 a4_543;
		word32 a1_540;
		word32 a2_541;
		word32 s1_538;
		word32 a0_539;
		word32 s0_537;
		ra = net_buf_unref(ra_143, 0x0A, a2_137, a1_136, a4_139, mstatus_113, dwLoc60, dwLoc5C, dwLoc58, s2, dwArg18, a2_22, a0_123, s3, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s0_537, out s1_538, out a0_539, out a1_540, out a2_541, out a3_542, out a4_543, out a5_544, out s2_545, out s3_212, out s4_213, out s5_546, out s6_547, out s8_548, out mstatus);
		a3_224.u0 = 0x0A;
	}
	else
		a3_224.u0 = 0x01;
	send_err_rsp.part.7(ra, s4_213, a3_224, s3_212, mstatus, dwLoc60, dwLoc5C, dwLoc50, dwLoc4C, dwLoc40, s4, s2, dwLoc30, dwLoc2C, dwLoc20, dwLoc1C, dwLoc18, dwLoc14, dwLoc08, dwArg0C, dwArg14, dwArg1C, dwArg28, dwArg2C, dwArg38, s3, s1, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA0, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8);
}

// 230589DA: void att_find_type_req(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register Eq_2 s4, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void att_find_type_req(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, Eq_2 s4, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	Eq_2 a3_219;
	Eq_2 a0_222;
	Eq_2 dwLoc3C_339;
	Eq_2 s2_23 = *a0;
	word32 a4_505;
	word32 a5_506;
	word32 a1_504;
	Eq_2 a0_27 = net_buf_simple_pull_mem(a1 + 8, 0x06, out a1_504, out a4_505, out a5_506);
	Eq_2 s3_207 = a0;
	Eq_2 s0_34 = (word32) *((word32) a0_27 + 1) << 8 | (word32) (*a0_27);
	if (s0_34 != 0x00)
	{
		Eq_2 s1_38 = (word32) *((word32) a0_27 + 3) << 8 | (word32) (*((word32) a0_27 + 2));
		if (s1_38 != 0x00 && s1_38 >= s0_34)
		{
			word16 wLoc3A_299 = (word16) ((word32) *((word32) a0_27 + 5) << 8 | (word32) (*((word32) a0_27 + 4)));
			word32 a0_54;
			word32 s8_513;
			word32 a3_509;
			word32 a4_510;
			word32 a5_511;
			word32 a6_512;
			word32 a1_507;
			word32 a2_508;
			bt_uuid_cmp(fp + -60, fp + -56, out a0_54, out a1_507, out a2_508, out a3_509, out a4_510, out a5_511, out a6_512, out s8_513);
			Eq_2 dwLoc38_318 = SEQ(0xF800, bLoc37, 0x00);
			dwLoc3C_339 = SEQ(wLoc3A_299, bLoc3B, 0x00);
			if (a0_54 == 0x00)
			{
				Eq_2 a3_78;
				Eq_2 s0_95;
				Eq_2 s1_96;
				struct Eq_2096 * s11_98;
				Eq_2 s3_100;
				Eq_2 a0_110;
				ptr32 mstatus_112;
				word32 s6_527;
				word32 s2_524;
				word32 s4_525;
				word32 s5_526;
				word32 a3_521;
				word32 a4_522;
				word32 a5_523;
				word32 a4_518;
				word32 a5_519;
				word32 a2_520;
				word32 a1_516;
				word32 a2_517;
				word32 t1_514;
				word32 a0_515;
				Eq_2 ra_94 = bt_att_create_pdu(memset(ra, fp + -52, 0x00, 0x14, out t1_514, out a0_515, out a1_516, out a2_517, out a3_78, out a4_518, out a5_519), s1_38, *a0, 0x00, a3_78, mstatus, dwLoc38_318, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, ra, dwArg88, dwArgA8, out s0_95, out s1_96, out a0_110, out a2_520, out a3_521, out a4_522, out a5_523, out s2_524, out s3_100, out s4_525, out s5_526, out s6_527, out s11_98, out mstatus_112);
				if (a0_110 == 0x00)
					goto l23058A62;
				dwArg48.u0 = 0x00;
				Eq_2 a1_131;
				Eq_2 a2_132;
				Eq_2 a4_134;
				Eq_2 a5_135;
				Eq_2 s1_140;
				Eq_2 s4_145;
				word32 s2_530;
				word32 s5_531;
				word32 s11_532;
				word32 s0_528;
				word32 a0_529;
				Eq_2 ra_138 = bt_gatt_foreach_attr(ra_94, s0_95, s1_96, &g_t230579AA, fp + -52, s11_98, out s0_528, out s1_140, out a0_529, out a1_131, out a2_132, out a4_134, out a5_135, out s2_530, out s4_145, out s5_531, out s11_532);
				if (false)
				{
					word32 s10_548;
					word32 s11_549;
					word32 mstatus_550;
					word32 s7_545;
					word32 s8_546;
					word32 s9_547;
					word32 s4_542;
					word32 s5_543;
					word32 s6_544;
					word32 a5_539;
					word32 s2_540;
					word32 s3_541;
					word32 a1_536;
					word32 a3_537;
					word32 a4_538;
					word32 s0_533;
					word32 s1_534;
					word32 a0_535;
					bt_l2cap_send_cb(ra_138, s1_140, s4_145, 0x04, a2_132, 0x23058250, a5_135, mstatus_112, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg3C, 0x00, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_533, out s1_534, out a0_535, out a1_536, out a3_537, out a4_538, out a5_539, out s2_540, out s3_541, out s4_542, out s5_543, out s6_544, out s7_545, out s8_546, out s9_547, out s10_548, out s11_549, out mstatus_550);
					goto l23058A62;
				}
				Eq_2 s4_208;
				word32 s5_560;
				word32 s6_561;
				word32 s8_562;
				word32 a4_557;
				word32 a5_558;
				word32 s2_559;
				word32 a1_554;
				word32 a2_555;
				word32 a3_556;
				word32 s0_551;
				word32 s1_552;
				word32 a0_553;
				ra = net_buf_unref(ra_138, s1_140, a2_132, a1_131, a4_134, mstatus_112, dwLoc40, dwLoc3C_339, a0_110, dwLoc18, dwArg38, s3_100, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_551, out s1_552, out a0_553, out a1_554, out a2_555, out a3_556, out a4_557, out a5_558, out s2_559, out s3_207, out s4_208, out s5_560, out s6_561, out s8_562, out mstatus);
				a3_219.u0 = 0x0A;
				a0_222 = s4_208;
l23058A5C:
				send_err_rsp.part.7(ra, a0_222, a3_219, s3_207, mstatus, dwLoc40, dwLoc3C_339, s6, s4, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg2C, dwArg34, dwArg3C, dwArg48, dwArg4C, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118);
l23058A62:
				0x00 = dwArg0198;
				return;
			}
			a3_219.u0 = 0x0A;
l23058A56:
			a0_222 = s2_23;
			goto l23058A5C;
		}
	}
	a3_219.u0 = 0x01;
	goto l23058A56;
}

