pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23058AEC: void att_find_info_req(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_2) a0, Register (ptr32 Eq_323483) a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148)
void att_find_info_req(Eq_2 ra, Eq_2 s0, union Eq_2 * a0, struct Eq_323483 * a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148)
{
	Eq_2 a3_171;
	Eq_2 s3_159;
	Eq_2 s2_158 = *a0;
	Eq_2 s0_21 = (word32) a5->b0001 << 8 | (word32) a5->b0000;
	if (s0_21 != 0x00)
	{
		Eq_2 s1_25 = (word32) a5->b0003 << 8 | (word32) a5->b0002;
		if (s1_25 != 0x00 && s1_25 >= s0_21)
		{
			Eq_2 a3_35;
			Eq_2 s0_52;
			Eq_2 s1_53;
			struct Eq_2096 * s11_55;
			Eq_2 s3_57;
			word32 a0_67;
			ptr32 mstatus_69;
			word32 s5_425;
			word32 s6_426;
			word32 s2_423;
			word32 s4_424;
			word32 a4_421;
			word32 a5_422;
			word32 a2_419;
			word32 a3_420;
			word32 a4_417;
			word32 a5_418;
			word32 a1_415;
			word32 a2_416;
			word32 t1_413;
			word32 a0_414;
			Eq_2 ra_51 = bt_att_create_pdu(memset(ra, fp + -48, 0x00, 0x10, out t1_413, out a0_414, out a1_415, out a2_416, out a3_35, out a4_417, out a5_418), s1_25, s2_158, 0x00, a3_35, mstatus, dwLoc28, dwArg00, dwArg04, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg44, dwArg48, dwArg4C, dwArg58, s3, dwArg6C, dwArg98, dwArgB8, out s0_52, out s1_53, out a0_67, out a2_419, out a3_420, out a4_421, out a5_422, out s2_423, out s3_57, out s4_424, out s5_425, out s6_426, out s11_55, out mstatus_69);
			if (a0_67 == 0x00)
				goto l23058B3A;
			dwLoc30 = s3_57;
			Eq_2 a1_83;
			Eq_2 a2_84;
			Eq_2 a4_86;
			Eq_2 a5_87;
			Eq_2 s1_92;
			Eq_2 s2_95;
			word32 s11_431;
			word32 s4_429;
			word32 s5_430;
			word32 s0_427;
			word32 a0_428;
			Eq_2 ra_90 = bt_gatt_foreach_attr(ra_51, s0_52, s1_53, &g_t23057AD4, fp + -48, s11_55, out s0_427, out s1_92, out a0_428, out a1_83, out a2_84, out a4_86, out a5_87, out s2_95, out s4_429, out s5_430, out s11_431);
			if (a5_87 != 0x00)
			{
				word32 s11_448;
				word32 mstatus_449;
				word32 s9_446;
				word32 s10_447;
				word32 s7_444;
				word32 s8_445;
				word32 s5_442;
				word32 s6_443;
				word32 s3_440;
				word32 s4_441;
				word32 s2_439;
				word32 a4_437;
				word32 a5_438;
				word32 a1_435;
				word32 a3_436;
				word32 s1_433;
				word32 a0_434;
				word32 s0_432;
				bt_l2cap_send_cb(ra_90, s1_92, s2_95, 0x04, a2_84, 0x23058250, a5_87, mstatus_69, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg24, dwArg28, dwArg44, dwArg4C, dwArg58, s3, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_432, out s1_433, out a0_434, out a1_435, out a3_436, out a4_437, out a5_438, out s2_439, out s3_440, out s4_441, out s5_442, out s6_443, out s7_444, out s8_445, out s9_446, out s10_447, out s11_448, out mstatus_449);
				goto l23058B58;
			}
			word32 s0_450;
			word32 s1_451;
			word32 a0_452;
			word32 a1_453;
			word32 a2_454;
			word32 a3_455;
			word32 a4_456;
			word32 a5_457;
			word32 s4_458;
			word32 s5_459;
			word32 s6_460;
			word32 s8_461;
			ra = net_buf_unref(ra_90, s1_92, a2_84, a1_83, a4_86, mstatus_69, s3_57, dwLoc2C, dwLoc28, dwLoc08, dwArg48, dwArg54, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_450, out s1_451, out a0_452, out a1_453, out a2_454, out a3_455, out a4_456, out a5_457, out s2_158, out s3_159, out s4_458, out s5_459, out s6_460, out s8_461, out mstatus);
			a3_171.u0 = 0x0A;
l23058B4E:
			send_err_rsp.part.7(ra, s2_158, a3_171, s3_159, mstatus, dwLoc30, dwLoc2C, s2, s0, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg3C, dwArg44, dwArg4C, dwArg58, s3, dwArg68, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128);
l23058B3A:
			0x00 = (int8) dwArg0128;
			return;
		}
	}
	a3_171.u0 = 0x01;
	s3_159 = s3;
	goto l23058B4E;
}

// 23058B94: void att_write_rsp.constprop.10(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
// Called from:
//      att_write_req
//      att_write_cmd
//      att_signed_write_cmd
void att_write_rsp.constprop.10(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	word32 s2_63 = a1;
	word24 nLoc2F_319 = SLICE(s6, word24, 8);
	Eq_2 s1_24 = a0;
	Eq_2 s3_28 = a3;
	Eq_2 s5_30 = a4;
	if (bt_gatt_change_aware() != 0x00 && a3 != 0x00)
	{
		Eq_2 a3_42;
		word32 a5_416;
		word32 a4_415;
		word32 a2_414;
		word32 a1_413;
		word32 a0_412;
		word32 t1_411;
		Eq_2 ra_101 = memset(ra, fp + -56, 0x00, 0x18, out t1_411, out a0_412, out a1_413, out a2_414, out a3_42, out a4_415, out a5_416);
		if (a2 != 0x00)
		{
			Eq_2 a0_74;
			word32 s0_451;
			word32 a2_452;
			word32 a3_453;
			word32 a4_454;
			word32 a5_455;
			word32 s4_456;
			word32 s6_457;
			ra_101 = bt_att_create_pdu(ra_101, a0, a0, 0x00, a3_42, mstatus, dwLoc38, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg4C, ra, dwArg88, dwArgA8, out s0_451, out s1_24, out a0_74, out a2_452, out a3_453, out a4_454, out a5_455, out s2_63, out s3_28, out s4_456, out s5_30, out s6_457, out s11, out mstatus);
			dwArg44 = a0_74;
			if (a0_74 == 0x00)
				goto l23058C18;
		}
		Eq_2 a0_104;
		Eq_2 a1_105;
		Eq_2 a4_108;
		Eq_2 a5_109;
		Eq_2 s1_114;
		word32 s4_119;
		word32 s0_417;
		word32 a2_418;
		word32 s2_419;
		word32 s5_420;
		word32 s11_421;
		Eq_2 ra_112 = bt_gatt_foreach_attr(ra_101, s3_28, s3_28, &g_t23058254, fp + -56, s11, out s0_417, out s1_114, out a0_104, out a1_105, out a2_418, out a4_108, out a5_109, out s2_419, out s4_119, out s5_420, out s11_421);
		Eq_2 dwLoc30_320 = SEQ(nLoc2F_319, (byte) s2_63);
		if (true)
		{
			if (s4_119 != 0x00)
			{
				ptr32 mstatus_177;
				Eq_2 s1_180;
				word32 s2_181;
				Eq_2 s3_182;
				word32 s0_422;
				word32 a0_423;
				word32 a1_424;
				word32 a2_425;
				word32 a3_426;
				word32 a4_427;
				word32 a5_428;
				word32 s4_429;
				word32 s5_430;
				word32 s6_431;
				word32 s8_432;
				Eq_2 ra_178 = net_buf_unref(ra_112, s1_114, a0_104, a1_105, a4_108, mstatus, dwLoc40, s1_24, dwLoc38, dwLoc18, dwArg38, dwArg44, s1, dwArg64, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, out s0_422, out s1_180, out a0_423, out a1_424, out a2_425, out a3_426, out a4_427, out a5_428, out s2_181, out s3_182, out s4_429, out s5_430, out s6_431, out s8_432, out mstatus_177);
				if (s2_181 != 0x00)
					send_err_rsp.part.7(ra_178, s1_180, 0x01, s3_182, mstatus_177, dwLoc40, s1_24, dwLoc30_320, s4, dwLoc20, dwLoc1C, dwLoc18, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg2C, dwArg34, dwArg3C, s5_30, dwArg4C, s1, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118);
			}
			goto l23058C04;
		}
		if (dwArg44 == 0x00)
		{
l23058C04:
			goto l23058C18;
		}
		word32 s0_433;
		word32 s1_434;
		word32 a0_435;
		word32 a1_436;
		word32 a3_437;
		word32 a4_438;
		word32 a5_439;
		word32 s2_440;
		word32 s3_441;
		word32 s4_442;
		word32 s5_443;
		word32 s6_444;
		word32 s7_445;
		word32 s8_446;
		word32 s9_447;
		word32 s10_448;
		word32 s11_449;
		word32 mstatus_450;
		bt_l2cap_send_cb(ra_112, s1_114, s1_114, 0x04, dwArg44, 0x23058250, a5_109, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg34, dwArg3C, s5_30, dwArg4C, dwArg64, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, out s0_433, out s1_434, out a0_435, out a1_436, out a3_437, out a4_438, out a5_439, out s2_440, out s3_441, out s4_442, out s5_443, out s6_444, out s7_445, out s8_446, out s9_447, out s10_448, out s11_449, out mstatus_450);
	}
l23058C18:
	0x00 = dwArg0198;
}

// 23058C60: void att_write_req(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s4, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void att_write_req(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a5, Eq_2 s4, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	Eq_2 a4_16;
	word32 a1_95;
	word32 a2_96;
	word32 a5_97;
	Eq_2 a0_13 = net_buf_simple_pull_le16(a5, out a1_95, out a2_96, out a4_16, out a5_97);
	att_write_rsp.constprop.10(ra, s1, s0, 0x12, 0x13, a0_13, a4_16, s4, s6, s11, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, a1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0198);
}

// 23058C8C: void att_write_cmd(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a5, Register Eq_2 s4, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void att_write_cmd(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a1, Eq_2 a5, Eq_2 s4, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	Eq_2 a4_16;
	word32 a1_95;
	word32 a2_96;
	word32 a5_97;
	Eq_2 a0_13 = net_buf_simple_pull_le16(a5, out a1_95, out a2_96, out a4_16, out a5_97);
	att_write_rsp.constprop.10(ra, s1, s0, 0x00, 0x00, a0_13, a4_16, s4, s6, s11, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, a1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0198);
}

// 23058CB8: void att_signed_write_cmd(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 (ptr32 Eq_304905)) a0, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void att_signed_write_cmd(Eq_2 ra, Eq_2 s1, struct Eq_304905 ** a0, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0138, word32 dwArg0198)
{
	struct Eq_304906 * a1_15 = *((word32) a5 + 8);
	struct Eq_304905 * s3_17 = *a0;
	word32 a4_220;
	net_buf_simple_push(0x01, a5, out a4_220);
	word32 a0_32;
	Eq_2 a3_35;
	Eq_2 a4_36;
	Eq_2 s0_41;
	struct Eq_2096 * s11_44;
	Eq_2 s2_45;
	Eq_2 s3_46;
	word32 s6_49;
	Eq_2 ra_40 = bt_smp_sign_verify(ra, s3_17, a1_15, &a1_15->dw0008, dwLoc20, dwLoc1C, s2, dwLoc0C, dwArg08, dwArg10, dwArg14, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg58, dwArg5C, dwArg7C, dwArgE8, out s0_41, out a0_32, out a3_35, out a4_36, out s2_45, out s3_46, out s6_49, out s11_44);
	if (a0_32 != 0x00)
	{
		word32 s1_221;
		word32 a0_222;
		word32 a1_223;
		word32 a2_224;
		word32 a3_225;
		word32 a4_226;
		word32 a5_227;
		word32 a7_228;
		word32 s2_229;
		word32 s3_230;
		word32 s4_231;
		word32 s5_232;
		word32 s6_233;
		word32 s7_234;
		word32 s8_235;
		word32 s9_236;
		word32 s10_237;
		word32 s11_238;
		word32 t4_239;
		printf(ra_40, &g_t230BD004, a3_35, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_221, out a0_222, out a1_223, out a2_224, out a3_225, out a4_226, out a5_227, out a7_228, out s2_229, out s3_230, out s4_231, out s5_232, out s6_233, out s7_234, out s8_235, out s9_236, out s10_237, out s11_238, out t4_239);
	}
	else
	{
		word32 a1_240;
		word32 a5_241;
		net_buf_simple_pull(s2_45, 0x01, out a1_240, out a5_241);
		word32 a1_242;
		word32 a5_243;
		net_buf_simple_pull(s2_45, 0x02, out a1_242, out a5_243);
		Eq_2 s1_104 = *((word32) a4_36 + 8);
		att_write_rsp.constprop.10(ra_40, s1_104, s3_46, 0x00, 0x00, s0_41, a4_36, dwArg04, s6_49, s11_44, mstatus, dwArg00, dwArg04, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg34, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, s3, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC0, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, dwArg0198);
	}
}

// 23058D3E: Register word32 bt_att_init(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bt_conn_init
word32 bt_att_init(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	word32 a0_32;
	word32 s2_33;
	word32 s5_34;
	word32 s0_14 = bt_gatt_init(ra, a3, a4, mstatus, dwArg34, dwArg94, dwArgC8, dwArgE8, dwArg0128, out a0_32, out a3_11, out a4_12, out a5_13, out s2_33, out s5_34);
	a3Out = a3_11;
	a4Out = a4_12;
	a5Out = a5_13;
	return s0_14;
}

