pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23058D42: Register Eq_2 bt_att_get_mtu(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_267810) s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      bt_gatt_get_mtu
//      gatt_read_rsp
//      bt_gatt_write
Eq_2 bt_att_get_mtu(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_267810 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a0_30;
	ptr32 a4_10;
	struct Eq_324214 * a0_12;
	ptr32 a3_13;
	struct Eq_267810 * s1_16;
	ptr32 s10_17;
	ptr32 s11_18;
	ptr32 s2_19;
	byte * s3_20;
	ptr32 s4_21;
	word32 s9_82;
	word32 s8_81;
	word32 s7_80;
	word32 s6_79;
	word32 s5_78;
	word32 a5_77;
	word32 a2_76;
	word32 a1_75;
	Eq_2 ra_15 = att_chan_get(ra, a0, a3, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_16, out a0_12, out a1_75, out a2_76, out a3_13, out a4_10, out a5_77, out s2_19, out s3_20, out s4_21, out s5_78, out s6_79, out s7_80, out s8_81, out s9_82, out s10_17, out s11_18);
	if (a0_12 != null)
		a0_30 = (word32) a0_12->w0056;
	else
		a0_30 = 0x00;
	s1Out = s1_16;
	a0Out = a0_30;
	a2Out = dwArg10;
	a3Out = a3_13;
	a4Out = a4_10;
	s2Out = s2_19;
	s3Out = s3_20;
	s4Out = s4_21;
	s10Out = s10_17;
	s11Out = s11_18;
	return ra_15;
}

// 23058D5A: Register Eq_2 bt_att_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_263972 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      gatt_notify
//      bt_gatt_exchange_mtu
//      bt_gatt_write_without_response_cb
Eq_2 bt_att_send(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, ptr32 & s0Out, ptr32 & s1Out, union Eq_263972 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	ptr32 a1_110;
	Eq_2 a3_112;
	Eq_2 a4_113;
	ptr32 s1_118;
	ptr32 s2_119;
	ptr32 s3_120;
	ptr32 s4_121;
	ptr32 s5_122;
	ptr32 s6_123;
	ptr32 s8_124;
	Eq_263972 s0_107;
	Eq_2 s0_19 = a1;
	Eq_2 a1_22;
	Eq_2 a4_24;
	Eq_2 a0_26;
	Eq_2 a3_27;
	Eq_2 s1_30;
	word32 s8_345;
	word32 s6_344;
	word32 s5_343;
	word32 s4_342;
	word32 a2_341;
	Eq_2 s2_33;
	Eq_2 s3_34;
	Eq_2 a5_25;
	ptr32 s9_136;
	ptr32 s7_135;
	ptr32 s11_134;
	ptr32 s10_133;
	Eq_2 ra_132 = att_chan_get(ra, a0, a3, dwLoc18, dwArg30, dwArg34, dwArg58, dwArg7C, out s1_30, out a0_26, out a1_22, out a2_341, out a3_27, out a4_24, out a5_25, out s2_33, out s3_34, out s4_342, out s5_343, out s6_344, out s7_135, out s8_345, out s9_136, out s10_133, out s11_134);
	if (a0_26 == 0x00)
	{
		word32 a2_348;
		word32 a0_347;
		word32 s0_346;
		word32 a5_349;
		ra_132 = net_buf_unref(ra_132, s1_30, a1, a1_22, a4_24, mstatus, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg48, a3, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_346, out s1_118, out a0_347, out a1_110, out a2_348, out a3_112, out a4_113, out a5_349, out s2_119, out s3_120, out s4_121, out s5_122, out s6_123, out s8_124, out mstatus);
		s0_107.u0 = -57;
		goto l23058D80;
	}
	Eq_2 s1_45 = a0_26;
	if (s2_33 == 0x00)
	{
		int32 a0_50;
		Eq_2 a4_54;
		word32 a1_351;
		word32 a3_352;
		word32 s4_353;
		word32 s8_354;
		s0_19 = k_sem_take((word32) a0_26 + 0x00CC, 0x00, dwArg74, a3_27, a4_24, a5_25, mstatus, s0, ra, dwArgD8, dwArg0118, out s1_45, out a0_50, out a1_351, out a3_352, out a4_54, out a5_25, out s2_33, out s3_34, out s4_353, out s8_354);
		if (a0_50 < 0x00)
		{
			word32 a0_355;
			word32 a2_356;
			word32 a5_357;
			k_queue_append((word32) s1_45 + 0x00D8, a4_54, a5_25, mstatus, dwLoc2C, a3_27, dwArgC8, dwArg0108, dwArg0148, out s1_118, out a0_355, out a1_110, out a2_356, out a3_112, out a4_113, out a5_357, out s2_119, out s3_120, out s4_121, out s5_122, out s6_123, out s8_124);
			s0_107.u0 = 0x00;
l23058D80:
			0x00 = (int8) dwArg0128;
			s0Out = dwArgE4;
			s1Out = s1_118;
			a0Out = s0_107;
			a1Out = a1_110;
			a3Out = a3_112;
			a4Out = a4_113;
			s2Out = s2_119;
			s3Out = s3_120;
			s4Out = s4_121;
			s5Out = s5_122;
			s6Out = s6_123;
			s7Out = s7_135;
			s8Out = s8_124;
			s9Out = s9_136;
			s10Out = s10_133;
			s11Out = s11_134;
			mstatusOut = mstatus;
			return ra_132;
		}
	}
	Eq_263972 a0_78;
	Eq_2 a5_83;
	word32 s0_350;
	ra_132 = att_send(ra_132, s0_19, s1_45, s3_34, s2_33, a5_25, mstatus, dwLoc30, dwLoc2C, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg4C, dwArg58, s3, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD0, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, out s0_350, out s1_118, out a0_78, out a1_110, out a3_112, out a4_113, out a5_83, out s2_119, out s3_120, out s4_121, out s5_122, out s6_123, out s7_135, out s8_124, out s9_136, out s10_133, out s11_134, out mstatus);
	s0_107 = a0_78;
	if (a0_78 != 0x00 && s2_119 == 0x00)
	{
		word32 a0_358;
		word32 a2_359;
		word32 a5_360;
		ra_132 = k_sem_give(ra_132, s1_118 + 0x00CC, a3_112, a4_113, a5_83, mstatus, s0, dwLoc18, dwArg30, dwArg34, dwArg58, ra, dwArg7C, dwArgD8, dwArg0118, dwArg0158, out s0_107, out s1_118, out a0_358, out a1_110, out a2_359, out a3_112, out a4_113, out a5_360, out s2_119, out s3_120, out s4_121, out s5_122, out s6_123, out s7_135, out s8_124, out s9_136, out s10_133, out s11_134);
	}
	goto l23058D80;
}

// 23058DD2: void bt_att_req_send(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      bt_gatt_exchange_mtu
void bt_att_req_send(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 a1_10;
	Eq_2 a4_12;
	Eq_2 a5_13;
	Eq_2 a0_14;
	Eq_2 a3_15;
	Eq_2 s1_18;
	word32 s10_248;
	word32 s11_249;
	word32 s9_247;
	word32 s7_245;
	word32 s8_246;
	word32 s6_244;
	word32 s5_243;
	word32 s4_242;
	word32 s3_241;
	word32 s2_240;
	word32 a2_239;
	Eq_2 ra_17 = att_chan_get(ra, a0, a3, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_18, out a0_14, out a1_10, out a2_239, out a3_15, out a4_12, out a5_13, out s2_240, out s3_241, out s4_242, out s5_243, out s6_244, out s7_245, out s8_246, out s9_247, out s10_248, out s11_249);
	if (a0_14 != 0x00)
	{
		Eq_2 a4_33 = *((word32) a0_14 + 0x009C);
		if (a4_33 == 0x00)
			att_send_req(ra_17, s1_18, a0_14, a1_10, dwArg44, a3_15, a4_33, a5_13, mstatus, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, a1, dwArg74, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158);
		else
		{
			a1_10->u0 = 0x00;
			Eq_2 a4_67 = *((word32) a0_14 + 0x00A4);
			if (a4_67 == 0x00)
			{
				*((word32) a0_14 + 0x00A4) = a1_10;
				*((word32) a0_14 + 0x00A0) = a1_10;
			}
			else
			{
				*a1_10 = a4_67;
				*((word32) a0_14 + 0x00A4) = a1_10;
			}
		}
	}
	else
	{
		struct Eq_324486 * a1_75;
		word32 mstatus_263;
		word32 s8_262;
		word32 s6_261;
		word32 s5_260;
		word32 s4_259;
		word32 s2_257;
		word32 s3_258;
		word32 a4_255;
		word32 a5_256;
		word32 a3_254;
		word32 a2_253;
		word32 a0_252;
		word32 s1_251;
		word32 s0_250;
		net_buf_unref(ra_17, s1_18, a0_14, *((word32) a0_14 + 16), a4_12, mstatus, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg58, a1, dwArg78, dwArg84, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out s0_250, out s1_251, out a0_252, out a1_75, out a2_253, out a3_254, out a4_255, out a5_256, out s2_257, out s3_258, out s4_259, out s5_260, out s6_261, out s8_262, out mstatus_263);
		a1_75->dw0010 = 0x00;
	}
}

// 23058E22: Register Eq_2 bt_att_req_cancel(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_271917) s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      bt_gatt_unsubscribe
Eq_2 bt_att_req_cancel(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_271917 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	if (a0 == 0x00 || a1 == 0x00)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		s3Out = s3;
		s4Out = s4;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		return ra;
	}
	else
	{
		Eq_2 s0_10 = a1;
		Eq_2 a1_12;
		struct Eq_324565 * a0_16;
		Eq_2 a3_17;
		Eq_2 s1_20;
		struct Eq_271917 * s3_24;
		ptr32 s4_25;
		ptr32 s6_27;
		ptr32 s7_28;
		ptr32 s8_29;
		word32 s11_278;
		word32 s5_275;
		word32 s9_276;
		word32 s10_277;
		word32 s2_274;
		word32 a5_273;
		word32 a2_272;
		Eq_2 a4_14;
		Eq_2 ra_19 = att_chan_get(ra, a0, a3, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_20, out a0_16, out a1_12, out a2_272, out a3_17, out a4_14, out a5_273, out s2_274, out s3_24, out s4_25, out s5_275, out s6_27, out s7_28, out s8_29, out s9_276, out s10_277, out s11_278);
		if (a0_16 == null)
		{
			s1Out = s1_20;
			a3Out = a3_17;
			a4Out = a4_14;
			s3Out = s3_24;
			s4Out = s4_25;
			s6Out = s6_27;
			s7Out = s7_28;
			s8Out = s8_29;
			return ra_19;
		}
		else
		{
			Eq_2 a5_38;
			if (a0_16->t009C == a1)
			{
				a0_16->t009C.u0 = 0x42017240;
				a5_38.u0 = 0x42017240;
			}
			else
			{
				a5_38 = a0_16->t00A0;
				a4_14.u0 = 0x00;
				while (a5_38 != 0x00)
				{
					if (a1 == a5_38)
					{
						s0_10 = *a5_38.u0;
						if (a4_14 == 0x00)
						{
							a4_14 = a0_16->t00A4;
							a0_16->t00A0 = a5_38;
							if (s0_10 == a4_14)
								a0_16->t00A4 = a5_38;
						}
						else
						{
							*a5_38.u0 = a4_14;
							a5_38 = a0_16->t00A4;
							if (s0_10 == a5_38)
								a0_16->t00A4 = a4_14;
						}
						*s0_10 = 0x00;
						break;
					}
					a4_14 = a5_38;
					a5_38 = *a5_38.u0;
				}
			}
			Eq_2 a3_88;
			Eq_2 a4_89;
			word32 a5_282;
			word32 a0_279;
			word32 a1_280;
			word32 a2_281;
			Eq_2 ra_91 = att_req_destroy(ra_19, s0, s1_20, s0_10, a1_12, a4_14, a5_38, mstatus, dwArg18, dwArg68, dwArg88, dwArg94, dwArgA8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, out a0_279, out a1_280, out a2_281, out a3_88, out a4_89, out a5_282);
			s1Out = s1_20;
			a3Out = a3_88;
			a4Out = a4_89;
			s3Out = s3_24;
			s4Out = s4_25;
			s6Out = s6_27;
			s7Out = s7_28;
			s8Out = s8_29;
			return ra_91;
		}
	}
}

// 23058E9A: Register Eq_2 fdt32_ld(Register Eq_2 a0, Register out Eq_324668 a4Out, Register out Eq_324669 a5Out)
// Called from:
//      fdt_get_property_by_offset_
//      fdt_get_string
//      fdt_get_name
//      fdt_get_property_namelen_
//      fdt_getprop
Eq_2 fdt32_ld(Eq_2 a0, union Eq_324668 & a4Out, union Eq_324669 & a5Out)
{
	Eq_324668 a4_10 = (word32) *((word32) a0 + 3);
	Eq_324669 a5_12 = (word32) *a0 << 24 | (word32) (*((word32) a0 + 1)) << 16 | a4_10;
	Eq_2 a0_14 = (word32) *((word32) a0 + 2) << 8 | a5_12;
	a4Out = a4_10;
	a5Out = a5_12;
	return a0_14;
}

// 23058EB8: Register Eq_2 nextprop_.part.0(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_first_property_offset
//      fdt_next_property_offset
Eq_2 nextprop_.part.0(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s2_17 = a0;
	Eq_2 s0_19 = a1;
	do
	{
		ptr32 a0_33;
		ptr32 a4_36;
		ptr32 a5_37;
		ptr32 s1_41;
		ptr32 s3_43;
		ptr32 s4_44;
		ra = fdt_next_tag(ra, s2_17, s0_19, fp + -36, s5, s6, dwLoc30, dwLoc2C, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_19, out s1_41, out a0_33, out a4_36, out a5_37, out s2_17, out s3_43, out s4_44, out s5, out s6);
		if (a0_33 == s3_43)
			goto l23058EF0;
		if (a0_33 == s4_44)
		{
			if (s0_19 >= 0x00)
				s0_19.u0 = ~0x0A;
			goto l23058EF0;
		}
	} while (a0_33 == s1_41);
	s0_19.u0 = ~0x00;
l23058EF0:
	0x00 = (int8) dwArg0128;
	a0Out = s0_19;
	a4Out = a4_36;
	a5Out = a5_37;
	s2Out = s2_17;
	s3Out = s3_43;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 23058F02: Register Eq_2 fdt_get_property_by_offset_(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      fdt_get_property_namelen_
Eq_2 fdt_get_property_by_offset_(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, ptr32 & a0Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s0_42;
	word32 s0_27;
	word32 s1_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s5_32;
	ptr32 s6_33;
	Eq_2 a0_20;
	ptr32 a5_24;
	ptr32 a4_23;
	Eq_2 ra_26 = fdt_check_prop_offset_(ra, a0, a1, s5, s6, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_27, out s1_28, out a0_20, out a4_23, out a5_24, out s2_29, out s3_30, out s5_32, out s6_33);
	if (a0_20 < 0x00)
	{
		s0_42 = 0x00;
		if (s1_28 == 0x00)
			goto l23058F1E;
	}
	else
	{
		s0_42 = s0_27 + ((word32) fdt32_ld(s0_27 + 8, out a4_23, out a5_24) + s2_29);
		if (s1_28 == 0x00)
			goto l23058F1E;
		a0_20 = fdt32_ld(s0_42 + 4, out a4_23, out a5_24);
	}
	*a0_20 = s1_28;
l23058F1E:
	0x00 = dwArg38;
	a0Out = s0_42;
	a4Out = a4_23;
	a5Out = a5_24;
	s2Out = s2_29;
	s3Out = s3_30;
	s5Out = s5_32;
	s6Out = s6_33;
	return ra_26;
}

// 23058F44: Register word32 fdt_get_string(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      fdt_get_property_namelen_
word32 fdt_get_string(Eq_2 a0, Eq_2 a1, union Eq_2 * a2, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	Eq_2 s0_68;
	word32 a4_198;
	word32 a5_199;
	Eq_2 a0_23 = fdt32_ld((word32) a0 + 0x0C, out a4_198, out a5_199);
	Eq_2 s1_173 = a1;
	Eq_2 s3_182 = a0_23;
	ptr32 a5_164;
	Eq_2 a0_28 = fdt_ro_probe_(a0, out a5_164);
	if (a0_28 != 0x00)
	{
l23059004:
		s0_68.u0 = 0x00;
		if (a2 == null)
			goto l23058FC4;
		goto l2305900A;
	}
	s3_182 = a0_23 + a1;
	word32 a4_200;
	Eq_2 a0_34 = fdt32_ld((word32) a0 + 4, out a4_200, out a5_164);
	if (s3_182 < a0_34)
	{
		s2 = a0_34 - s3_182;
		word32 a4_201;
		word32 a5_202;
		Eq_2 a0_39 = fdt32_ld(a0, out a4_201, out a5_202);
		a5_164 = ~0x2FF20112;
		if (a0_39 == ~0x2FF20112)
		{
			if (a1 >= 0x00)
			{
				word32 a4_203;
				word32 a5_204;
				if (fdt32_ld((word32) a0 + 20, out a4_203, out a5_204) <= 0x10)
					goto l23058FB0;
				word32 a4_205;
				Eq_2 a0_60 = fdt32_ld((word32) a0 + 32, out a4_205, out a5_164);
				if (a1 < a0_60)
				{
					Eq_2 a0_64 = a0_60 - a1;
					if (a0_64 < s2)
						s2 = a0_64;
					goto l23058FB0;
				}
			}
		}
		else
		{
			a5_164 = 0x2FF20112;
			if (a0_39 != 0x2FF20112)
			{
				a0_28.u0 = ~0x0C;
				goto l23059004;
			}
			if (a1 < 0x00)
			{
				word32 a4_206;
				if (a1 >= 0x00 - fdt32_ld((word32) a0 + 32, out a4_206, out a5_164))
				{
					s1_173 = 0x00 - a1;
					if (s1_173 < s2)
						s2 = s1_173;
l23058FB0:
					s0_68 = a0 + s3_182;
					struct Eq_324930 * a0_81 = memchr(s0_68, 0x00, s2, out a3, out a5_164);
					if (a0_81 != null)
					{
						a0_28 = a0_81 - s0_68;
						if (a2 == null)
						{
l23058FC4:
							s1Out = s1_173;
							a0Out = s0_68;
							a3Out = a3;
							a5Out = a5_164;
							s2Out = s2;
							s3Out = s3_182;
							s4Out = dwArg04;
							return s1;
						}
l2305900A:
						*a2 = (union Eq_2 *) a0_28;
						goto l23058FC4;
					}
					a0_28.u0 = ~0x07;
					goto l23059004;
				}
			}
		}
	}
	a0_28.u0 = ~0x03;
	goto l23059004;
}

// 23059018: Register Eq_2 fdt_get_name(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a2, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_subnode_offset_namelen
Eq_2 fdt_get_name(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, union Eq_2 * a2, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg48, union Eq_2 & s0Out, union Eq_2 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s0_58;
	word32 a4_195;
	word32 a5_196;
	Eq_2 s3_165 = fdt32_ld((word32) a0 + 8, out a4_195, out a5_196);
	union Eq_2 * s2_164 = a2;
	ptr32 a5_147;
	Eq_2 a0_26 = fdt_ro_probe_(a0, out a5_147);
	if (a0_26 == 0x00)
	{
		word32 s0_41;
		word32 s1_42;
		word32 a4_197;
		ra = fdt_check_node_offset_(ra, a0, a1, s5, s6, s2, dwArg08, dwArg48, s1, out s0_41, out s1_42, out a0_26, out a4_197, out a5_147, out s2_164, out s3_165, out s5, out s6);
		if (a0_26 >= 0x00)
		{
			word32 s0_56 = (word32) s3_165 + s0_41 + s1_42;
			a5_147 = 0x0F;
			s0_58 = s0_56 + 0x04;
			word32 a4_198;
			word32 a5_199;
			if (fdt32_ld(s1_42 + 20, out a4_198, out a5_199) > 0x0F)
			{
l23059066:
				if (s2_164 == null)
					goto l2305907E;
				word32 a1_200;
				word32 a2_201;
				word32 a3_202;
				word32 a4_203;
				a0_26 = strlen(s0_58, out a1_200, out a2_201, out a3_202, out a4_203, out a5_147);
l23059070:
				*s2_164 = (union Eq_2 *) a0_26;
l2305907E:
				s0Out = s0_58;
				a0Out = s0_58;
				a5Out = a5_147;
				s2Out = s2_164;
				s3Out = s3_165;
				s4Out = dwArg04;
				s5Out = s5;
				s6Out = s6;
				return ra;
			}
			word32 a0_61 = strrchr(s0_56 + 0x04, 47, out a5_147);
			if (a0_61 != 0x00)
			{
				s0_58 = a0_61 + 1;
				goto l23059066;
			}
			a0_26.u0 = ~0x0A;
		}
	}
	s0_58.u0 = 0x00;
	if (s2_164 == null)
		goto l2305907E;
	goto l23059070;
}

