pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305908E: Register Eq_2 fdt_subnode_offset_namelen(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_subnode_offset
Eq_2 fdt_subnode_offset_namelen(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArgE8, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a5_108;
	Eq_2 a0_26 = fdt_ro_probe_(a0, out a5_108);
	Eq_2 s3_114 = a0;
	Eq_2 s2_113 = a3;
	Eq_2 s0_122 = a0_26;
	if (a0_26 == 0x00)
	{
		s5.u0 = 0x01;
		s0_122 = a1;
		while (s0_122 >= 0x00)
		{
			if (a5_108 < 0x00)
				goto l230590BE;
			if (a5_108 == s5)
			{
				Eq_2 a0_49;
				Eq_2 a5_52;
				Eq_2 s4_58;
				ra = fdt_get_name(ra, s1, s3_114, s0_122, fp + -36, s2_113, s5, s6, dwLoc38, dwArg08, out s0_122, out a0_49, out a5_52, out s2_113, out s3_114, out s4_58, out s5, out s6);
				if (a0_49 != 0x00 && a5_52 >= s2_113)
				{
					word32 a1_247;
					word32 a2_248;
					word32 a3_249;
					word32 a4_250;
					word32 a5_251;
					if (memcmp(a0_49, s4_58, s2_113, out a1_247, out a2_248, out a3_249, out a4_250, out a5_251) == 0x00)
					{
						s1 = a0_49 + s2_113;
						a5_108 = (word32) *s1;
						if (a5_108 == 0x00)
							goto l23059116;
						word32 a3_252;
						word32 a5_253;
						if (memchr(s4_58, 64, s2_113, out a3_252, out a5_253) == null)
						{
							a5_108.u0 = 64;
							if ((word32) *s1 == 64)
								goto l23059116;
						}
					}
				}
			}
			Eq_2 a0_121;
			ra = fdt_next_node(ra, s0_122, s3_114, s0_122, s5, s6, s2, dwLoc08, dwArg38, dwArgE8, out s1, out a0_121, out a5_108, out s2_113, out s3_114, out s5, out s6);
			s0_122 = a0_121;
		}
		if (a5_108 < 0x00)
		{
l230590BE:
			s0_122.u0 = ~0x00;
		}
	}
l23059116:
	s0Out = dwArg0158;
	s1Out = s1;
	a0Out = s0_122;
	a5Out = a5_108;
	s2Out = s2_113;
	s3Out = s3_114;
	s4Out = dwArgF4;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 2305912A: Register Eq_2 fdt_subnode_offset(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out (ptr32 Eq_2537) s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      aos_loop_proc
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
Eq_2 fdt_subnode_offset(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 s2, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArgE8, ptr32 & s0Out, struct Eq_2537 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 a1_19;
	word32 a2_69;
	word32 a3_70;
	word32 a4_71;
	word32 a5_72;
	Eq_2 a0_15 = strlen(a2, out a1_19, out a2_69, out a3_70, out a4_71, out a5_72);
	ptr32 a5_33;
	ptr32 s0_35;
	ptr32 s2_36;
	ptr32 s3_37;
	ptr32 s4_38;
	ptr32 a0_42;
	ptr32 s5_43;
	struct Eq_2537 * s1_48;
	ptr32 s6_49;
	Eq_2 ra_47 = fdt_subnode_offset_namelen(ra, s1, a0, a1_19, a0_15, s2, s6, dwArg08, dwArg38, dwArgE8, out s0_35, out s1_48, out a0_42, out a5_33, out s2_36, out s3_37, out s4_38, out s5_43, out s6_49);
	s0Out = s0_35;
	s1Out = s1_48;
	a0Out = a0_42;
	a5Out = a5_33;
	s2Out = s2_36;
	s3Out = s3_37;
	s4Out = s4_38;
	s5Out = s5_43;
	s6Out = s6_49;
	return ra_47;
}

// 2305914E: Register Eq_2 fdt_first_property_offset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_get_property_namelen_
Eq_2 fdt_first_property_offset(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_13;
	ptr32 a4_16;
	ptr32 a5_17;
	Eq_2 s0_20;
	ptr32 s2_22;
	ptr32 s3_23;
	Eq_2 s5_25;
	Eq_2 s6_26;
	word32 s1_88;
	Eq_2 ra_19 = fdt_check_node_offset_(ra, a0, a1, s5, s6, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_20, out s1_88, out a0_13, out a4_16, out a5_17, out s2_22, out s3_23, out s5_25, out s6_26);
	if (a0_13 < 0x00)
	{
		a0Out = a0_13;
		a4Out = a4_16;
		a5Out = a5_17;
		s2Out = s2_22;
		s3Out = s3_23;
		s5Out = s5_25;
		s6Out = s6_26;
		return ra_19;
	}
	else
	{
		Eq_2 a0_38;
		ptr32 a4_41;
		ptr32 a5_42;
		ptr32 s2_47;
		ptr32 s3_48;
		Eq_2 s5_50;
		Eq_2 s6_51;
		Eq_2 ra_44 = nextprop_.part.0(ra_19, s0_20, a0_13, s5_25, s6_26, dwArg18, dwArg58, dwArg78, dwArg0128, out a0_38, out a4_41, out a5_42, out s2_47, out s3_48, out s5_50, out s6_51);
		a0Out = a0_38;
		a4Out = a4_41;
		a5Out = a5_42;
		s2Out = s2_47;
		s3Out = s3_48;
		s5Out = s5_50;
		s6Out = s6_51;
		return ra_44;
	}
}

// 23059172: Register Eq_2 fdt_next_property_offset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_get_property_namelen_
Eq_2 fdt_next_property_offset(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg0128, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_13;
	ptr32 a4_16;
	ptr32 a5_17;
	Eq_2 s0_20;
	union Eq_2 * s2_22;
	ptr32 s3_23;
	Eq_2 s5_25;
	Eq_2 s6_26;
	word32 s1_88;
	Eq_2 ra_19 = fdt_check_prop_offset_(ra, a0, a1, s5, s6, dwLoc08, dwArg18, dwArg58, dwArg78, out s0_20, out s1_88, out a0_13, out a4_16, out a5_17, out s2_22, out s3_23, out s5_25, out s6_26);
	if (a0_13 < 0x00)
	{
		a0Out = a0_13;
		a4Out = a4_16;
		a5Out = a5_17;
		s2Out = s2_22;
		s3Out = s3_23;
		s5Out = s5_25;
		s6Out = s6_26;
		return ra_19;
	}
	else
	{
		Eq_2 a0_38;
		ptr32 a4_41;
		ptr32 a5_42;
		union Eq_2 * s2_47;
		ptr32 s3_48;
		Eq_2 s5_50;
		Eq_2 s6_51;
		Eq_2 ra_44 = nextprop_.part.0(ra_19, s0_20, a0_13, s5_25, s6_26, dwArg18, dwArg58, dwArg78, dwArg0128, out a0_38, out a4_41, out a5_42, out s2_47, out s3_48, out s5_50, out s6_51);
		a0Out = a0_38;
		a4Out = a4_41;
		a5Out = a5_42;
		s2Out = s2_47;
		s3Out = s3_48;
		s5Out = s5_50;
		s6Out = s6_51;
		return ra_44;
	}
}

// 23059196: Register Eq_2 fdt_get_property_namelen_(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Stack word32 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_getprop
Eq_2 fdt_get_property_namelen_(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, word32 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 a0_120;
	Eq_2 s6_132;
	union Eq_2 * s2_128;
	Eq_2 s3_129;
	Eq_2 s5_131;
	ptr32 a4_107;
	ptr32 a5_105;
	Eq_2 ra_126 = fdt_first_property_offset(ra, a0, a1, a5, a2, dwLoc18, dwArg28, dwArg48, dwArgF8, out a0_120, out a4_107, out a5_105, out s2_128, out s3_129, out s5_131, out s6_132);
	while (true)
	{
		ptr32 s1_137;
		Eq_2 s0_139 = a0_120;
		if (a0_120 < 0x00)
			break;
		word32 a0_60;
		ra_126 = fdt_get_property_by_offset_(ra_126, s3_129, a0_120, s5_131, s6_132, dwLoc18, dwArg08, dwArg28, dwArg48, out a0_60, out a4_107, out a5_105, out s2_128, out s3_129, out s5_131, out s6_132);
		if (a0_60 == 0x00)
		{
			s0_139.u0 = ~0x0C;
			break;
		}
		Eq_2 a0_85;
		Eq_2 a5_88;
		Eq_2 s4_93;
		word32 a4_261;
		word32 a5_262;
		Eq_2 s0_90 = fdt_get_string(s3_129, fdt32_ld(a0_60 + 0x08, out a4_261, out a5_262), fp + -36, out s1_137, out a0_85, out a3, out a5_88, out s2_128, out s3_129, out s4_93);
		if (a0_85 != 0x00 && s4_93 == a5_88)
		{
			word32 a1_263;
			word32 a2_264;
			if (memcmp(a0_85, s6_132, s4_93, out a1_263, out a2_264, out a3, out a4_107, out a5_105) == 0x00)
			{
				if (s5_131 != 0x00)
					*s5_131 = s0_90;
				goto l2305920A;
			}
		}
		ra_126 = fdt_next_property_offset(ra_126, s3_129, s0_90, s5_131, s6_132, dwLoc18, dwArg28, dwArg48, dwArgF8, out a0_120, out a4_107, out a5_105, out s2_128, out s3_129, out s5_131, out s6_132);
	}
	s1_137 = 0x00;
	if (s2_128 != null)
		*s2_128 = (union Eq_2 *) s0_139;
l2305920A:
	0x00 = (int8) dwArg0128;
	s1Out = s1_137;
	a0Out = s1_137;
	a3Out = a3;
	a4Out = a4_107;
	a5Out = a5_105;
	s2Out = s2_128;
	s3Out = s3_129;
	s5Out = s5_131;
	s6Out = s6_132;
	return ra_126;
}

// 23059224: Register Eq_2 fdt_getprop_namelen(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      fdt_getprop
Eq_2 fdt_getprop_namelen(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArgD8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 a0_15;
	ptr32 a3_18;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s5_29;
	ptr32 s6_30;
	ptr32 a4_19;
	ptr32 a5_20;
	Eq_2 ra_23 = fdt_get_property_namelen_(ra, a0, a1, a2, fp + ~0x13, dwLoc18, dwArg08, dwArg28, dwArgD8, dwArg0108, out s1_25, out a0_15, out a3_18, out a4_19, out a5_20, out s2_26, out s3_27, out s5_29, out s6_30);
	ptr32 s0_35 = a0_15;
	if (a0_15 != 0x00)
	{
		a5_20 = 0x0F;
		word32 a5_123;
		if (fdt32_ld(s1_25 + 20, out a4_19, out a5_123) <= 0x0F)
		{
			a5_20 = 0x03;
			if (true)
			{
				a5_20 = 0x07;
				word32 a5_124;
				if (fdt32_ld(a0_15 + 4, out a4_19, out a5_124) > 0x07)
				{
					s0_35 = a0_15 + 0x10;
					goto l2305925E;
				}
			}
		}
		s0_35 = a0_15 + 0x0C;
	}
l2305925E:
	s0Out = s0_35;
	s1Out = s1_25;
	a0Out = s0_35;
	a1Out = a1_16;
	a3Out = a3_18;
	a4Out = a4_19;
	a5Out = a5_20;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = dwArg04;
	s5Out = s5_29;
	s6Out = s6_30;
	s8Out = dwLoc1C;
	return ra_23;
}

// 2305926E: Register Eq_2 fdt_getprop(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg44, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_325587) s0Out, Register out (ptr32 Eq_325588) s1Out, Register out (ptr32 Eq_2) a0Out, Register out ptr32 a1Out, Register out Eq_325591 a3Out, Register out ptr32 a4Out, Register out Eq_325593 a5Out, Register out (ptr32 Eq_325594) s2Out, Register out (ptr32 Eq_325595) s3Out, Register out (ptr32 Eq_325596) s4Out, Register out (ptr32 Eq_325597) s5Out, Register out (ptr32 Eq_325598) s6Out, Register out ptr32 s8Out)
// Called from:
//      fdt_stringlist_count
//      fdt_stringlist_get
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
Eq_2 fdt_getprop(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg44, Eq_2 dwArgD8, Eq_2 dwArg0108, union Eq_325587 & s0Out, struct Eq_325588 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_325591 & a3Out, ptr32 & a4Out, union Eq_325593 & a5Out, struct Eq_325594 & s2Out, struct Eq_325595 & s3Out, struct Eq_325596 & s4Out, struct Eq_325597 & s5Out, struct Eq_325598 & s6Out, ptr32 & s8Out)
{
	Eq_2 a1_21;
	word32 a2_76;
	word32 a3_77;
	word32 a4_78;
	word32 a5_79;
	strlen(a2, out a1_21, out a2_76, out a3_77, out a4_78, out a5_79);
	ptr32 a1_31;
	Eq_325591 a3_33;
	ptr32 a4_34;
	Eq_325593 a5_35;
	union Eq_325587 * s0_39;
	struct Eq_325588 * s1_40;
	struct Eq_325594 * s2_41;
	struct Eq_325595 * s3_42;
	struct Eq_325596 * s4_43;
	struct Eq_325597 * s5_44;
	struct Eq_325598 * s6_45;
	ptr32 s8_46;
	union Eq_2 * a0_50;
	Eq_2 ra_38 = fdt_getprop_namelen(ra, a0, a1_21, dwArg44, dwArg08, dwArg28, dwArgD8, dwArg0108, out s0_39, out s1_40, out a0_50, out a1_31, out a3_33, out a4_34, out a5_35, out s2_41, out s3_42, out s4_43, out s5_44, out s6_45, out s8_46);
	s0Out = s0_39;
	s1Out = s1_40;
	a0Out = a0_50;
	a1Out = a1_31;
	a3Out = a3_33;
	a4Out = a4_34;
	a5Out = a5_35;
	s2Out = s2_41;
	s3Out = s3_42;
	s4Out = s4_43;
	s5Out = s5_44;
	s6Out = s6_45;
	s8Out = s8_46;
	return ra_38;
}

// 23059296: Register Eq_2 fdt_stringlist_count(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_board_cfg
Eq_2 fdt_stringlist_count(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgB8, Eq_2 dwArgE8, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 a0_15;
	ptr32 s3_27;
	ptr32 s5_29;
	ptr32 s6_30;
	word32 s8_126;
	word32 a5_124;
	word32 s4_125;
	word32 a3_122;
	word32 a4_123;
	word32 a1_121;
	ptr32 s0_24;
	Eq_2 s1_100;
	Eq_2 s2_101;
	Eq_2 ra_23 = fdt_getprop(ra, a0, a2, s2, dwArg08, dwArg24, dwArgB8, dwArgE8, out s0_24, out s1_100, out a0_15, out a1_121, out a3_122, out a4_123, out a5_124, out s2_101, out s3_27, out s4_125, out s5_29, out s6_30, out s8_126);
	if (a0_15 != 0x00)
	{
		s2_101 = (word32) a0_15 + s0_24;
		s1_100 = a0_15;
		s0_24 = 0x00;
		while (s1_100 < s2_101)
		{
			word32 a1_127;
			word32 a3_128;
			word32 a4_129;
			word32 a5_130;
			s1_100 = (word32) s1_100 + ((word32) strnlen(s1_100, s2_101 - s1_100, out a1_127, out a3_128, out a4_129, out a5_130) + 1);
			if (s2_101 < s1_100)
			{
				s0_24 = ~0x0E;
				break;
			}
			++s0_24;
		}
	}
	s0Out = s0_24;
	s1Out = s1_100;
	a0Out = s0_24;
	s2Out = s2_101;
	s3Out = s3_27;
	s4Out = dwArg04;
	s5Out = s5_29;
	s6Out = s6_30;
	s8Out = dwLoc1C;
	return ra_23;
}

// 230592E0: Register Eq_2 fdt_stringlist_get(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Stack Eq_2 dwArg14, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_325728) s0Out, Register out (ptr32 Eq_325729) s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_325733 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_325737) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_325740) s6Out, Register out ptr32 s8Out)
// Called from:
//      tc_fdt_wifi_module
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_board_cfg
Eq_2 fdt_stringlist_get(Eq_2 ra, Eq_2 a0, Eq_2 a2, Eq_2 dwArg14, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg0128, struct Eq_325728 & s0Out, struct Eq_325729 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_325733 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, struct Eq_325737 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_325740 & s6Out, ptr32 & s8Out)
{
	Eq_2 a0_21;
	struct Eq_325729 * s1_31;
	ptr32 s4_34;
	ptr32 s5_35;
	struct Eq_325740 * s6_36;
	ptr32 s8_37;
	word32 s0_190;
	Eq_2 a5_133;
	ptr32 a4_129;
	Eq_325733 a3_125;
	ptr32 a1_121;
	Eq_2 s2_150;
	struct Eq_325737 * s3_153;
	Eq_2 ra_29 = fdt_getprop(ra, a0, a2, dwLoc28, dwLoc08, dwArg14, dwArgA8, dwArgD8, out s0_190, out s1_31, out a0_21, out a1_121, out a3_125, out a4_129, out a5_133, out s2_150, out s3_153, out s4_34, out s5_35, out s6_36, out s8_37);
	Eq_2 s0_41 = a0_21;
	if (a0_21 == 0x00)
	{
		if (s1_31 != null)
		{
			*a5_133 = s1_31;
			goto l23059304;
		}
	}
	else
	{
		s2_150 += a0_21;
		while (s0_41 < s2_150)
		{
			word32 a5_191;
			Eq_2 a0_48 = strnlen(s0_41, s2_150 - s0_41, out a1_121, out a3_125, out a4_129, out a5_191);
			a5_133 = (byte) s0_41.u0 + ((word32) a0_48 + 1);
			if (s2_150 < a5_133)
			{
				a5_133.u0 = ~0x0E;
				if (s1_31 != null)
					goto l2305933C;
				goto l230592FC;
			}
			if (s3_153 == null)
			{
				if (s1_31 != null)
					*a0_48 = s1_31;
				goto l23059304;
			}
			s3_153 = (struct Eq_325737 *) ((char *) s3_153 - 1);
			s0_41 = a5_133;
		}
		if (s1_31 != null)
		{
			a5_133.u0 = ~0x00;
l2305933C:
			*a5_133.u0 = s1_31;
		}
	}
l230592FC:
	s0_41.u0 = 0x00;
l23059304:
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_31;
	a0Out = s0_41;
	a1Out = a1_121;
	a2Out = dwArg0100;
	a3Out = a3_125;
	a4Out = a4_129;
	a5Out = a5_133;
	s2Out = s2_150;
	s3Out = s3_153;
	s4Out = s4_34;
	s5Out = s5_35;
	s6Out = s6_36;
	s8Out = s8_37;
	return ra_29;
}

