pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 23059350: void blfdt(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void blfdt(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	Eq_2 a3_12;
	word32 s1_18;
	Eq_2 s2_21;
	Eq_2 s7_26;
	Eq_2 s9_28;
	Eq_2 ra_17 = tc_fdt_wifi(ra, s1, s2, s4, s6, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_18, out a3_12, out s2_21, out s7_26, out s9_28);
	tc_blfdtdump(ra_17, s1_18, a3_12, s2_21, s7_26, s9_28, dwArg10, dwArg14, dwArg18, dwArg5C);
}

// 2305935E: void blfdt_cli_init()
// Called from:
//      aos_loop_proc
void blfdt_cli_init()
{
}

// 23059362: Register Eq_2 fdt32_ld(Register Eq_2 a0, Register out Eq_325875 a4Out)
// Called from:
//      fdt_ro_probe_
//      fdt_offset_ptr
Eq_2 fdt32_ld(Eq_2 a0, union Eq_325875 & a4Out)
{
	Eq_325875 a4_10 = (word32) *((word32) a0 + 3);
	Eq_2 a0_14 = (word32) *((word32) a0 + 2) << 8 | (((word32) (*a0) << 24 | (word32) (*((word32) a0 + 1)) << 16) | a4_10);
	a4Out = a4_10;
	return a0_14;
}

// 23059380: Register Eq_2 fdt_ro_probe_(Register Eq_2 a0, Register out Eq_2 a5Out)
// Called from:
//      fdt_get_string
//      fdt_get_name
//      fdt_subnode_offset_namelen
Eq_2 fdt_ro_probe_(Eq_2 a0, union Eq_2 & a5Out)
{
	Eq_2 a5_17;
	word32 a4_51;
	Eq_2 a0_10 = fdt32_ld(a0, out a4_51);
	if (a0_10 == ~0x2FF20112)
	{
		a5_17.u0 = ~0x09;
		word32 a4_52;
		if (fdt32_ld((word32) a0 + 20, out a4_52) > 0x01)
		{
			a5_17.u0 = 0x00;
			word32 a4_53;
			if (fdt32_ld((word32) a0 + 24, out a4_53) > 0x11)
				a5_17.u0 = ~0x09;
		}
	}
	else
	{
		a5_17.u0 = ~0x08;
		if (a0_10 == 0x2FF20112)
		{
			a5_17.u0 = 0x00;
			word32 a4_54;
			if (fdt32_ld((word32) a0 + 36, out a4_54) == 0x00)
				a5_17.u0 = ~0x06;
		}
	}
	a5Out = a5_17;
	return a5_17;
}

// 230593E2: Register Eq_2 fdt_offset_ptr(Register Eq_2 a0, Register Eq_2 a1, Register up32 a2, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      fdt_next_tag
Eq_2 fdt_offset_ptr(Eq_2 a0, Eq_2 a1, up32 a2, ptr32 & a2Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 a4_24;
	word32 s2_26 = fdt32_ld((word32) a0 + 8, out a4_24) + a1;
	Eq_2 a5_27 = 0x00;
	if (s2_26 >= a1)
	{
		Eq_2 s4_28 = (word32) s2_26 + a2;
		a5_27.u0 = 0x00;
		if (s4_28 < s2_26)
			goto l23059446;
		a5_27.u0 = 0x00;
		if (fdt32_ld((word32) a0 + 4, out a4_24) >= s4_28)
		{
			if (fdt32_ld((word32) a0 + 20, out a4_24) <= 0x10)
			{
l23059442:
				a5_27 = a0 + s2_26;
				goto l23059446;
			}
			Eq_2 s1_40 = (word32) a1 + a2;
			a5_27.u0 = 0x00;
			if (s1_40 >= a1)
			{
				a5_27.u0 = 0x00;
				if (fdt32_ld((word32) a0 + 36, out a4_24) >= s1_40)
					goto l23059442;
			}
		}
	}
l23059446:
	a2Out = dwArg48;
	a4Out = a4_24;
	a5Out = a5_27;
	s2Out = s2_26;
	s3Out = a1;
	s4Out = dwArg04;
	return a5_27;
}

// 23059458: Register Eq_2 fdt_next_tag(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 a2, Register Eq_2 s5, Register Eq_2 s6, Stack word32 dwArg00, Stack ptr32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Register out Eq_324736 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out (ptr32 word32) a5Out, Register out (ptr32 word32) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_first_property_offset
//      fdt_check_node_offset_
//      fdt_check_prop_offset_
//      fdt_next_node
Eq_2 fdt_next_tag(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 a2, Eq_2 s5, Eq_2 s6, word32 dwArg00, ptr32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgA8, union Eq_324736 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a4Out, word32 & a5Out, word32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	*(ptr32 *) ~0x07 = a2;
	word32 a2_30;
	word32 * s2_36;
	ptr32 s3_37;
	word32 s4_38;
	word32 * a5_122;
	ptr32 a4_120;
	if (fdt_offset_ptr(a0, a1, 0x04, out a2_30, out a4_120, out a5_122, out s2_36, out s3_37, out s4_38) != 0x00)
	{
		word32 a0_41 = *a5_122;
		*s2_36 = ~0x0A;
		uint32 s1_53 = a5_122 << 0x18 | a5_122 >> 0x18 | (a5_122 >> 0x08 & 0x00FF) << 16 | (a5_122 >> 16 & 0x00FF) << 8;
		a4_120 = 0x08;
		a5_122 = s1_53 + -1;
		if (s1_53 <= ~0x08)
		{
			<anonymous> * a5_62 = *((char *) g_a230BD1F8 + (s1_53 + -1) * 0x04);
			word32 * s2_64;
			ptr32 s3_65;
			ptr32 s4_66;
			Eq_2 ra_67;
			Eq_324736 s0_68;
			ptr32 s1_69;
			Eq_2 s5_70;
			Eq_2 s6_71;
			word32 * a5_72;
			ptr32 a0_74;
			ptr32 a4_76;
			a5_62();
			s0Out = s0_68;
			s1Out = s1_69;
			a0Out = a0_74;
			a4Out = a4_76;
			a5Out = a5_72;
			s2Out = s2_64;
			s3Out = s3_65;
			s4Out = s4_66;
			s5Out = s5_70;
			s6Out = s6_71;
			return ra_67;
		}
	}
	0x00 = (int8) dwArgA8;
	s0Out = s1;
	s1Out = 0x09;
	a0Out = 0x09;
	a4Out = a4_120;
	a5Out = a5_122;
	s2Out = s2_36;
	s3Out = s3_37;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	return ra;
}

// 23059566: Register Eq_2 fdt_check_node_offset_(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out Eq_325039 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_get_name
//      fdt_first_property_offset
//      fdt_next_node
Eq_2 fdt_check_node_offset_(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a4Out, union Eq_325039 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	ptr32 a0_13;
	if (a1 >= 0x00)
	{
		a5 = a1 & 3;
		if ((a1 & 3) == 0x00)
		{
			word32 a5_102;
			word32 s4_103;
			ra = fdt_next_tag(ra, a0, a1, fp + ~0x13, s5, s6, dwLoc20, dwLoc1C, dwArg08, dwArg28, dwArg68, dwArg88, out s0, out s1, out a0_13, out a4, out a5_102, out s2, out s3, out s4_103, out s5, out s6);
			a5.u0 = 0x01;
			if (a0_13 == 0x01)
			{
l23059572:
				s0Out = s0;
				s1Out = s1;
				a0Out = a0_13;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2;
				s3Out = s3;
				s5Out = s5;
				s6Out = s6;
				return ra;
			}
		}
	}
	a0_13 = ~0x03;
	goto l23059572;
}

// 2305958E: Register Eq_2 fdt_check_prop_offset_(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out Eq_324813 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_get_property_by_offset_
//      fdt_next_property_offset
Eq_2 fdt_check_prop_offset_(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArg88, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a4Out, union Eq_324813 & a5Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	ptr32 a0_13;
	if (a1 >= 0x00)
	{
		a5 = a1 & 3;
		if ((a1 & 3) == 0x00)
		{
			word32 a5_102;
			word32 s4_103;
			ra = fdt_next_tag(ra, a0, a1, fp + ~0x13, s5, s6, dwLoc20, dwLoc1C, dwArg08, dwArg28, dwArg68, dwArg88, out s0, out s1, out a0_13, out a4, out a5_102, out s2, out s3, out s4_103, out s5, out s6);
			a5.u0 = 0x03;
			if (a0_13 == 0x03)
			{
l2305959A:
				s0Out = s0;
				s1Out = s1;
				a0Out = a0_13;
				a4Out = a4;
				a5Out = a5;
				s2Out = s2;
				s3Out = s3;
				s5Out = s5;
				s6Out = s6;
				return ra;
			}
		}
	}
	a0_13 = ~0x03;
	goto l2305959A;
}

