pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230595B6: Register Eq_2 fdt_next_node(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_325158 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out)
// Called from:
//      fdt_subnode_offset_namelen
Eq_2 fdt_next_node(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s5, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg0128, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_325158 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s5Out, union Eq_2 & s6Out)
{
	Eq_325158 a5_164;
	Eq_2 s3_174;
	Eq_2 s5_176;
	ptr32 s1_170;
	Eq_2 s2_100 = a0;
	if (a1 >= 0x00)
	{
		Eq_2 a0_25;
		word32 s0_187;
		word32 a4_188;
		ra = fdt_check_node_offset_(ra, a0, a1, s5, s6, dwLoc28, dwLoc08, dwArg38, s5, out s0_187, out s1_170, out a0_25, out a4_188, out a5_164, out s2_100, out s3_174, out s5_176, out s6);
		s0 = a0_25;
		if (a0_25 < 0x00)
			goto l23059604;
	}
	s5_176.u0 = 0x01;
	do
	{
		Eq_2 a0_58;
		Eq_2 s4_69;
		word32 a4_189;
		ra = fdt_next_tag(ra, s2_100, s0, fp + -36, s5_176, s6, dwLoc30, dwLoc2C, dwLoc08, dwArg18, s5, dwArg78, out s0, out s1_170, out a0_58, out a4_189, out a5_164, out s2_100, out s3_174, out s4_69, out s5_176, out s6);
		if (a0_58 == s3_174)
		{
			if (s1_170 == 0x00)
				continue;
			s1_170 = *a5_164.u0;
			*((char *) a5_164.u0 - 1) = s1_170;
			a5_164 = (char *) a5_164.u0 - 1;
			if (a5_164 < ~0x00)
				goto l23059604;
			continue;
		}
		if (a0_58 == s4_69)
		{
			if (s0 < 0x00)
			{
				a5_164.u0 = ~0x07;
				if (s0 != ~0x07 || s1_170 != 0x00)
					goto l23059604;
			}
			s0.u0 = ~0x00;
			goto l23059604;
		}
	} while (a0_58 != s5_176);
	if (s1_170 != 0x00)
	{
		s1_170 = (ptr32) *a5_164;
		*((word32) a5_164 + 1) = s1_170;
		a5_164 = (word32) a5_164 + 1;
	}
l23059604:
	0x00 = (int8) dwArg0128;
	s1Out = s1_170;
	a0Out = s0;
	a5Out = a5_164;
	s2Out = s2_100;
	s3Out = s3_174;
	s5Out = s5_176;
	s6Out = s6;
	return ra;
}

// 2305963A: Register Eq_2 fdt32_to_cpu(Register Eq_2 a0)
// Called from:
//      utilfdt_print_data
//      tc_blfdtdump
Eq_2 fdt32_to_cpu(Eq_2 a0)
{
	return (a0 >> 16 & 0x00FF) << 8 | ((a0 << 0x18 | a0 >> 0x18) | (a0 >> 0x08 & 0x00FF) << 16);
}

// 2305965C: Register Eq_326242 fdt64_to_cpu(Register Eq_326242 a0, Register (ptr32 Eq_326243) a1, Register out Eq_326244 a1Out, Register out Eq_326245 a3Out)
// Called from:
//      tc_blfdtdump
Eq_326242 fdt64_to_cpu(Eq_326242 a0, struct Eq_326243 * a1, union Eq_326244 & a1Out, union Eq_326245 & a3Out)
{
	Eq_326245 a3_12 = a0 << 0x18 | (a0 >> 0x08 & 0x00FF) << 16 | (a0 >> 0x10 & 0x00FF) << 8;
	a1Out = a3_12 | a0 >> 0x18;
	a3Out = a3_12;
	return (a1 >> 0x08 & 0x00FF) << 16 | (a1 >> 0x18 | a1 << 0x18) | (a1 >> 0x10 & 0x00FF) << 8;
}

// 230596A4: Register (ptr32 Eq_324930) fdt32_ld(Register (ptr32 Eq_324930) a0)
// Called from:
//      tc_blfdtdump
struct Eq_324930 * fdt32_ld(struct Eq_324930 * a0)
{
	return (word32) a0->b0002 << 8 | (((word32) a0->b0000 << 24 | (word32) a0->b0001 << 16) | (word32) a0->b0003);
}

// 230596C2: Register (ptr32 Eq_326311) util_is_printable_string(Register (ptr32 Eq_326311) a0, Register int32 a1, Register out ptr32 a3Out)
// Called from:
//      utilfdt_print_data
struct Eq_326311 * util_is_printable_string(struct Eq_326311 * a0, int32 a1, ptr32 & a3Out)
{
	struct Eq_326311 * a5_29;
	if (a1 != 0x00)
	{
		struct Eq_326311 * a1_5 = a0 + a1;
		a5_29 = null;
		if ((word32) a1_5->bFFFFFFFF == 0x00)
		{
			a3 = 588035505;
			while (a0 < a1_5)
			{
				struct Eq_326311 * a5_13 = a0;
				do
				{
					struct Eq_326337 * a4_16 = (word32) a5_13->b0000;
					if (a4_16 == null || ((word32) a4_16->b230CB5B1 & 151) == 0x00)
						goto l230596FE;
					++a5_13;
				} while (a1_5 != a5_13);
				a5_13 = a1_5;
l230596FE:
				if ((word32) a5_13->b0000 != 0x00 || a0 == a5_13)
					goto l2305970E;
				a0 = a5_13 + 1;
			}
			a5_29 = (struct Eq_326311 *) 0x01;
		}
	}
	else
	{
l2305970E:
		a5_29 = null;
	}
	a3Out = a3;
	return a5_29;
}

// 23059712: Register Eq_2 utilfdt_print_data(Register Eq_2 ra, Register (ptr32 Eq_326311) a0, Register int32 a1, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack word32 dwArgA8, Stack Eq_2 dwArgBC, Register out ptr32 s0Out, Register out Eq_2 a3Out)
// Called from:
//      tc_blfdtdump
Eq_2 utilfdt_print_data(Eq_2 ra, struct Eq_326311 * a0, int32 a1, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, word32 dwArgA8, Eq_2 dwArgBC, ptr32 & s0Out, union Eq_2 & a3Out)
{
	if (a1 == 0x00)
	{
		s0Out = s0;
		a3Out = a3;
		return ra;
	}
	else
	{
		Eq_2 a3_28;
		if (util_is_printable_string(a0, a1, out a3_28) == 0x00)
		{
			struct Eq_274 * a0_106;
			Eq_2 a3_114;
			Eq_2 ra_117;
			if ((a1 & 3) == 0x00)
			{
				word32 s1_563;
				word32 a1_564;
				word32 a2_565;
				word32 a4_566;
				word32 a5_567;
				word32 a7_568;
				word32 s2_569;
				word32 s3_570;
				word32 s4_571;
				word32 s5_572;
				word32 s6_573;
				word32 s7_574;
				word32 s8_575;
				word32 s9_576;
				word32 s10_577;
				word32 s11_578;
				word32 t4_579;
				Eq_2 a0_109;
				ra_117 = printf(ra, &g_t230BE80C, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_563, out a0_109, out a1_564, out a2_565, out a3_114, out a4_566, out a5_567, out a7_568, out s2_569, out s3_570, out s4_571, out s5_572, out s6_573, out s7_574, out s8_575, out s9_576, out s10_577, out s11_578, out t4_579);
				int32 s2_135 = 0x00;
				word32 s6_138 = 0x230BF000;
				int32 s5_139 = (a1 ^ 0x04) + -1;
				while (s2_135 < (a1 ^ 0x04))
				{
					fdt32_to_cpu(a0_109);
					word32 s2_177;
					word32 s1_613;
					word32 a1_614;
					word32 a2_615;
					word32 a4_616;
					word32 a5_617;
					word32 a7_618;
					word32 s3_619;
					word32 s4_620;
					word32 s7_621;
					word32 s8_622;
					word32 s9_623;
					word32 s10_624;
					word32 s11_625;
					word32 t4_626;
					ra_117 = printf(ra_117, s6_138 + -2028, a3_114, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_613, out a0_109, out a1_614, out a2_615, out a3_114, out a4_616, out a5_617, out a7_618, out s2_177, out s3_619, out s4_620, out s5_139, out s6_138, out s7_621, out s8_622, out s9_623, out s10_624, out s11_625, out t4_626);
					s2_135 = s2_177 + 0x01;
				}
				a0_106 = (struct Eq_274 *) &g_t230C892C;
			}
			else
			{
				word32 s1_545;
				word32 a0_546;
				word32 a1_547;
				word32 a2_548;
				word32 a4_549;
				word32 a5_550;
				word32 a7_551;
				word32 s2_552;
				word32 s3_553;
				word32 s4_554;
				word32 s5_555;
				word32 s6_556;
				word32 s7_557;
				word32 s8_558;
				word32 s9_559;
				word32 s10_560;
				word32 s11_561;
				word32 t4_562;
				ra_117 = printf(ra, &g_t230BE820, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_545, out a0_546, out a1_547, out a2_548, out a3_114, out a4_549, out a5_550, out a7_551, out s2_552, out s3_553, out s4_554, out s5_555, out s6_556, out s7_557, out s8_558, out s9_559, out s10_560, out s11_561, out t4_562);
				int32 s2_104 = 0x00;
				int32 s5_57 = a1 + -1;
				word32 s6_60 = 0x230BF000;
				while (s2_104 < a1)
				{
					word32 s2_94;
					word32 s1_598;
					word32 a0_599;
					word32 a1_600;
					word32 a2_601;
					word32 a4_602;
					word32 a5_603;
					word32 a7_604;
					word32 s3_605;
					word32 s4_606;
					word32 s7_607;
					word32 s8_608;
					word32 s9_609;
					word32 s10_610;
					word32 s11_611;
					word32 t4_612;
					ra_117 = printf(ra_117, s6_60 + -2008, a3_114, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_598, out a0_599, out a1_600, out a2_601, out a3_114, out a4_602, out a5_603, out a7_604, out s2_94, out s3_605, out s4_606, out s5_57, out s6_60, out s7_607, out s8_608, out s9_609, out s10_610, out s11_611, out t4_612);
					s2_104 = s2_94 + 0x01;
				}
				a0_106 = (struct Eq_274 *) &g_t230B3954;
			}
			0x00 = dwArgA8;
			Eq_2 a3_208;
			word32 s1_580;
			word32 a0_581;
			word32 a1_582;
			word32 a2_583;
			word32 a4_584;
			word32 a5_585;
			word32 a7_586;
			word32 s2_587;
			word32 s3_588;
			word32 s4_589;
			word32 s5_590;
			word32 s6_591;
			word32 s7_592;
			word32 s8_593;
			word32 s9_594;
			word32 s10_595;
			word32 s11_596;
			word32 t4_597;
			Eq_2 ra_211 = printf(ra_117, a0_106, a3_114, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_580, out a0_581, out a1_582, out a2_583, out a3_208, out a4_584, out a5_585, out a7_586, out s2_587, out s3_588, out s4_589, out s5_590, out s6_591, out s7_592, out s8_593, out s9_594, out s10_595, out s11_596, out t4_597);
			s0Out = s1;
			a3Out = a3_208;
			return ra_211;
		}
		else
		{
			word32 s1_236;
			word32 s10_504;
			word32 s11_505;
			word32 t4_506;
			word32 s5_499;
			word32 s8_502;
			word32 s9_503;
			word32 s6_500;
			word32 s7_501;
			word32 a5_494;
			word32 s3_497;
			word32 s4_498;
			word32 a7_495;
			word32 s2_496;
			word32 a2_492;
			word32 a4_493;
			word32 a0_490;
			word32 a1_491;
			Eq_2 a3_232;
			Eq_2 ra_235 = printf(ra, &g_t230BE7FC, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_236, out a0_490, out a1_491, out a2_492, out a3_232, out a4_493, out a5_494, out a7_495, out s2_496, out s3_497, out s4_498, out s5_499, out s6_500, out s7_501, out s8_502, out s9_503, out s10_504, out s11_505, out t4_506);
			word32 s3_249 = 0x230BF000;
			uint32 s0_250 = a1 + s1_236;
			while (true)
			{
				Eq_2 s1_269;
				word32 s2_272;
				word32 t4_540;
				word32 s11_539;
				word32 s10_538;
				word32 s9_537;
				word32 s8_536;
				word32 s7_535;
				word32 s6_534;
				word32 a5_529;
				word32 s4_532;
				word32 s5_533;
				word32 a7_530;
				word32 s3_531;
				word32 a0_524;
				word32 a3_527;
				word32 a4_528;
				word32 a1_525;
				word32 a2_526;
				Eq_2 ra_268 = printf(ra_235, s3_249 + -0x0800, a3_232, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_269, out a0_524, out a1_525, out a2_526, out a3_527, out a4_528, out a5_529, out a7_530, out s2_272, out s3_531, out s4_532, out s5_533, out s6_534, out s7_535, out s8_536, out s9_537, out s10_538, out s11_539, out t4_540);
				word32 a1_541;
				word32 a2_542;
				word32 a4_543;
				word32 a5_544;
				Eq_2 a3_284;
				if ((word32) s1_269 + ((word32) strlen(s1_269, out a1_541, out a2_542, out a3_284, out a4_543, out a5_544) + 1) >= s0_250)
					break;
				word32 s8_519;
				word32 s11_522;
				word32 t4_523;
				word32 s9_520;
				word32 s10_521;
				word32 s2_514;
				word32 s6_517;
				word32 s7_518;
				word32 s4_515;
				word32 s5_516;
				word32 a1_509;
				word32 a5_512;
				word32 a7_513;
				word32 a2_510;
				word32 a4_511;
				word32 s1_507;
				word32 a0_508;
				ra_235 = printf(ra_268, s2_272 + -2040, a3_284, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_507, out a0_508, out a1_509, out a2_510, out a3_232, out a4_511, out a5_512, out a7_513, out s2_514, out s3_249, out s4_515, out s5_516, out s6_517, out s7_518, out s8_519, out s9_520, out s10_521, out s11_522, out t4_523);
			}
			0x00 = dwArgA8;
			s0Out = s1;
			a3Out = a3_284;
			return ra_268;
		}
	}
}

