pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
									word32 a1_3281;
									word32 a3_3283;
									word32 a4_3284;
									word32 a5_3285;
									word32 a6_3286;
									word32 a2_3282;
									memcpy(fp + -304, a0_1264, 60, out a1_3281, out a2_3282, out a3_3283, out a4_3284, out a5_3285, out a6_3286, out a7_3287);
									if (s2_1275->dw0560 != 0x00)
									{
										word32 a5_3327;
										xTaskGetTickCountFromISR(out a5_3327);
									}
									else
									{
										word32 a5_3326;
										xTaskGetTickCount(out a5_3326);
									}
									Eq_2 s5_1334;
									Eq_2 s6_1335;
									word32 s0_1355;
									Eq_2 a0_1376;
									int32 a4_1380;
									word32 s1_1386;
									struct Eq_329508 * s2_1387;
									word32 s2_3405;
									word32 s4_3407;
									word32 s6_3409;
									word32 s5_3419;
									word32 s6_3420;
									word32 s8_3421;
									word32 s3_3417;
									word32 s4_3418;
									word32 a5_3416;
									word32 a1_3414;
									word32 a3_3415;
									word32 s0_3413;
									word32 s9_3412;
									word32 s8_3411;
									word32 s7_3410;
									word32 s5_3408;
									word32 s3_3406;
									word32 a5_3404;
									word32 s1_3401;
									word32 a3_3402;
									word32 a4_3403;
									word32 s4_3395;
									word32 s8_3397;
									word32 s9_3398;
									word32 s10_3399;
									word32 s11_3400;
									word32 s7_3396;
									word32 a0_3387;
									word32 a1_3388;
									word32 a2_3389;
									word32 a3_3390;
									word32 a5_3392;
									word32 s2_3393;
									word32 s3_3394;
									word32 a4_3391;
									word32 s1_3386;
									ra_1034 = fdt_getprop(log_buf_out(bl_printk(ra_1034, &g_t230BEBFC, s1_1274 + -0x0790, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3386, out a0_3387, out a1_3388, out a2_3389, out a3_3390, out a4_3391, out a5_3392, out s2_3393, out s3_3394, out s4_3395, out s5_1334, out s6_1335, out s7_3396, out s8_3397, out s9_3398, out s10_3399, out s11_3400), fp + -304, (union Eq_485217 *) 60, 0x00, s5_1334, s6_1335, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_1355, out s1_3401, out a3_3402, out a4_3403, out a5_3404, out s2_3405, out s3_3406, out s4_3407, out s5_3408, out s6_3409, out s7_3410, out s8_3411, out s9_3412), s0_1355 + 0x054C, 587983912, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_3413, out s1_1386, out a0_1376, out a1_3414, out a3_3415, out a4_1380, out a5_3416, out s2_1387, out s3_3417, out s4_3418, out s5_3419, out s6_3420, out s8_3421);
									if (a4_1380 != 56)
									{
										if (s2_1387->dw0560 != 0x00)
										{
											word32 a5_3336;
											xTaskGetTickCountFromISR(out a5_3336);
										}
										else
										{
											word32 a5_3335;
											xTaskGetTickCount(out a5_3335);
										}
										a3_1018 = s1_1386 + -0x0790;
										a0_1020 = (struct Eq_274 *) &g_t230BECA4;
									}
									else
									{
										word32 a2_3329;
										word32 a4_3331;
										word32 a6_3333;
										word32 a7_3334;
										word32 a5_3332;
										word32 a3_3330;
										word32 a1_3328;
										memcpy(fp + -304, a0_1376, 56, out a1_3328, out a2_3329, out a3_3330, out a4_3331, out a5_3332, out a6_3333, out a7_3334);
										if (s2_1387->dw0560 != 0x00)
										{
											word32 a5_3376;
											xTaskGetTickCountFromISR(out a5_3376);
										}
										else
										{
											word32 a5_3375;
											xTaskGetTickCount(out a5_3375);
										}
										Eq_2 s5_1446;
										Eq_2 s6_1447;
										word32 s0_1467;
										Eq_2 a0_1488;
										word32 a4_1492;
										word32 s1_1498;
										struct Eq_329668 * s2_1499;
										word32 s8_3459;
										word32 s6_3458;
										word32 s5_3457;
										word32 a3_3453;
										word32 s3_3455;
										word32 s4_3456;
										word32 a5_3454;
										word32 a1_3452;
										word32 s0_3451;
										word32 s9_3450;
										word32 s8_3449;
										word32 s7_3448;
										word32 s6_3447;
										word32 s5_3446;
										word32 s3_3444;
										word32 s4_3445;
										word32 s2_3443;
										word32 a5_3442;
										word32 s1_3439;
										word32 a3_3440;
										word32 a4_3441;
										word32 s4_3433;
										word32 s8_3435;
										word32 s9_3436;
										word32 s10_3437;
										word32 s11_3438;
										word32 s7_3434;
										word32 a0_3425;
										word32 a1_3426;
										word32 a2_3427;
										word32 a3_3428;
										word32 a5_3430;
										word32 s2_3431;
										word32 s3_3432;
										word32 a4_3429;
										word32 s1_3424;
										ra_1034 = fdt_getprop(log_buf_out(bl_printk(ra_1034, &g_t230BEC6C, s1_1386 + -0x0790, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3424, out a0_3425, out a1_3426, out a2_3427, out a3_3428, out a4_3429, out a5_3430, out s2_3431, out s3_3432, out s4_3433, out s5_1446, out s6_1447, out s7_3434, out s8_3435, out s9_3436, out s10_3437, out s11_3438), fp + -304, (union Eq_485217 *) 56, 0x00, s5_1446, s6_1447, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_1467, out s1_3439, out a3_3440, out a4_3441, out a5_3442, out s2_3443, out s3_3444, out s4_3445, out s5_3446, out s6_3447, out s7_3448, out s8_3449, out s9_3450), s0_1467 + 0x054C, 587984024, dwLoc0138, dwLoc0118, dwLocFC, dwLoc68, dwLoc38, out s0_3451, out s1_1498, out a0_1488, out a1_3452, out a3_3453, out a4_1492, out a5_3454, out s2_1499, out s3_3455, out s4_3456, out s5_3457, out s6_3458, out s8_3459);
										if (a4_1492 == 0x04)
										{
											word32 a5_3381;
											word32 a6_3382;
											word32 a7_3383;
											word32 a3_3379;
											word32 a4_3380;
											word32 a2_3378;
											word32 a1_3377;
											memcpy(fp + -304, a0_1488, 0x04, out a1_3377, out a2_3378, out a3_3379, out a4_3380, out a5_3381, out a6_3382, out a7_3383);
											if (s2_1499->dw0560 != 0x00)
											{
												word32 a5_3423;
												xTaskGetTickCountFromISR(out a5_3423);
											}
											else
											{
												word32 a5_3422;
												xTaskGetTickCount(out a5_3422);
											}
											Eq_2 s5_1558;
											Eq_2 s6_1559;
											word32 s7_3484;
											word32 s9_3486;
											word32 s8_3485;
											word32 s6_3483;
											word32 s5_3482;
											word32 s4_3481;
											word32 s3_3480;
											word32 s2_3479;
											word32 a5_3478;
											word32 a4_3477;
											word32 s1_3476;
											word32 s0_3475;
											word32 s11_3474;
											word32 s10_3473;
											word32 s4_3469;
											word32 s8_3471;
											word32 s9_3472;
											word32 s7_3470;
											word32 s3_3468;
											word32 s2_3467;
											word32 a5_3466;
											word32 a4_3465;
											word32 a3_3464;
											word32 a2_3463;
											word32 a1_3462;
											word32 s1_3460;
											word32 a0_3461;
											log_buf_out(bl_printk(ra_1034, &g_t230BECD4, s1_1498 + -0x0790, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3460, out a0_3461, out a1_3462, out a2_3463, out a3_3464, out a4_3465, out a5_3466, out s2_3467, out s3_3468, out s4_3469, out s5_1558, out s6_1559, out s7_3470, out s8_3471, out s9_3472, out s10_3473, out s11_3474), fp + -304, (union Eq_485217 *) 0x04, 0x00, s5_1558, s6_1559, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLocE8, dwLocD4, dwLocC4, dwLoc34, out s0_3475, out s1_3476, out a3_1573, out a4_3477, out a5_3478, out s2_3479, out s3_3480, out s4_3481, out s5_3482, out s6_3483, out s7_3484, out s8_3485, out s9_3486);
											a0_1595 = 0x00;
l2305A4C4:
											a3Out = a3_1573;
											return a0_1595;
										}
										if (s2_1499->dw0560 != 0x00)
										{
											word32 a5_3385;
											xTaskGetTickCountFromISR(out a5_3385);
										}
										else
										{
											word32 a5_3384;
											xTaskGetTickCount(out a5_3384);
										}
										a3_1018 = s1_1498 + -0x0790;
										a0_1020 = (struct Eq_274 *) &g_t230BECF8;
									}
								}
							}
							else
							{
								if (s2_1037->dw0560 != 0x00)
								{
									word32 a5_3374;
									xTaskGetTickCountFromISR(out a5_3374);
								}
								else
								{
									word32 a5_3373;
									xTaskGetTickCount(out a5_3373);
								}
								a3_1018 = s1_1036 + -0x0790;
								a0_1020 = (struct Eq_274 *) &g_t230BEB70;
							}
						}
						else
						{
							if (s2_997->dw0560 != 0x00)
							{
								word32 a5_3488;
								xTaskGetTickCountFromISR(out a5_3488);
							}
							else
							{
								word32 a5_3487;
								xTaskGetTickCount(out a5_3487);
							}
							a3_1018 = s1_996 + -0x0790;
							a0_1020 = (struct Eq_274 *) &g_t230BED20;
						}
					}
					else
					{
						if (s2_866->dw0560 != 0x00)
						{
							word32 a5_3241;
							xTaskGetTickCountFromISR(out a5_3241);
						}
						else
						{
							word32 a5_3240;
							xTaskGetTickCount(out a5_3240);
						}
						a3_1018 = s1_865 + -0x0790;
						a0_1020 = (struct Eq_274 *) &g_t230BEB0C;
					}
				}
				else
				{
					if (a5_785 != 0x00)
					{
						word32 a5_3490;
						xTaskGetTickCountFromISR(out a5_3490);
					}
					else
					{
						word32 a5_3489;
						xTaskGetTickCount(out a5_3489);
					}
					a3_1018.u0 = 0x230BE870;
					a0_1020 = (struct Eq_274 *) &g_t230BEAA0;
				}
			}
			else
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_3492;
					xTaskGetTickCountFromISR(out a5_3492);
				}
				else
				{
					word32 a5_3491;
					xTaskGetTickCount(out a5_3491);
				}
				a3_1018.u0 = 0x230BE870;
				a0_1020 = (struct Eq_274 *) &g_t230BEA38;
			}
l23059D34:
			word32 a0_3006;
			word32 a1_3007;
			word32 s2_3011;
			word32 a4_3009;
			word32 a2_3008;
			word32 s1_3005;
			word32 s8_3017;
			word32 s6_3015;
			word32 s5_3014;
			word32 s4_3013;
			word32 a5_3010;
			word32 s3_3012;
			word32 s11_3020;
			word32 s7_3016;
			word32 s9_3018;
			word32 s10_3019;
			bl_printk(ra_1034, a0_1020, a3_1018, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_3005, out a0_3006, out a1_3007, out a2_3008, out a3_1573, out a4_3009, out a5_3010, out s2_3011, out s3_3012, out s4_3013, out s5_3014, out s6_3015, out s7_3016, out s8_3017, out s9_3018, out s10_3019, out s11_3020);
			goto l2305A13E;
		}
		if (g_t4200F560 != 0x00)
		{
			word32 a5_3494;
			xTaskGetTickCountFromISR(out a5_3494);
		}
		else
		{
			word32 a5_3493;
			xTaskGetTickCount(out a5_3493);
		}
	}
	else if (g_t4200F560 != 0x00)
	{
		word32 a5_3125;
		xTaskGetTickCountFromISR(out a5_3125);
	}
	else
	{
		word32 a5_3124;
		xTaskGetTickCount(out a5_3124);
	}
	a3_1018.u0 = 0x230BE870;
	a0_1020 = (struct Eq_274 *) &g_t230BE9DC;
	goto l23059D34;
}

// 2305A532: Register Eq_2 tc_fdt_wifi(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s7Out, Register out ptr32 s9Out)
// Called from:
//      blfdt
Eq_2 tc_fdt_wifi(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s7Out, ptr32 & s9Out)
{
	struct Eq_274 * a0_30;
	Eq_2 a3_15;
	if (tc_fdt_wifi_module(ra, s1, s2, s4, s6, out a3_15) != 0x00)
		a0_30 = (struct Eq_274 *) &g_t230BE830;
	else
		a0_30 = (struct Eq_274 *) &g_t230BE84C;
	word32 a1_93;
	word32 a2_94;
	ptr32 a3_43;
	ptr32 s1_47;
	ptr32 s2_50;
	ptr32 s7_55;
	ptr32 s9_57;
	word32 a0_92;
	word32 a4_95;
	word32 a5_96;
	word32 a7_97;
	word32 s3_98;
	word32 s4_99;
	word32 s5_100;
	word32 s6_101;
	word32 s8_102;
	word32 s10_103;
	word32 s11_104;
	word32 t4_105;
	Eq_2 ra_46 = printf(ra, a0_30, a3_15, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_47, out a0_92, out a1_93, out a2_94, out a3_43, out a4_95, out a5_96, out a7_97, out s2_50, out s3_98, out s4_99, out s5_100, out s6_101, out s7_55, out s8_102, out s9_57, out s10_103, out s11_104, out t4_105);
	s1Out = s1_47;
	a3Out = a3_43;
	s2Out = s2_50;
	s7Out = s7_55;
	s9Out = s9_57;
	return ra_46;
}

// 2305A560: void cmd_blog_info_dump(Register Eq_2 ra, Stack Eq_2 dwArg0C)
void cmd_blog_info_dump(Eq_2 ra, Eq_2 dwArg0C)
{
	Eq_2 a3_32;
	Eq_2 a3_49;
	Eq_2 a3_77;
	word32 s3_113;
	word32 a2_642;
	word32 a4_643;
	word32 s3_652;
	word32 a4_649;
	word32 a1_641;
	word32 a0_646;
	word32 a1_647;
	word32 s2_651;
	word32 a2_648;
	word32 a5_650;
	word32 a5_644;
	word32 s1_645;
	word32 a0_640;
	word32 t1_639;
	word32 s4_653;
	word32 s5_654;
	word32 s6_655;
	word32 s7_656;
	word32 s8_657;
	word32 s9_658;
	word32 s10_659;
	word32 s11_660;
	word32 s1_661;
	word32 a0_662;
	word32 a1_663;
	word32 a2_664;
	word32 a4_665;
	word32 a5_666;
	word32 s2_667;
	word32 s3_668;
	word32 s4_669;
	word32 s5_670;
	word32 s6_671;
	word32 s7_672;
	word32 s8_673;
	word32 s9_674;
	word32 s10_675;
	word32 s11_676;
	word32 s1_677;
	word32 a1_678;
	word32 a2_679;
	word32 a3_680;
	word32 a4_681;
	word32 a5_682;
	word32 s2_683;
	word32 s4_684;
	word32 s5_685;
	word32 s6_686;
	word32 s7_687;
	word32 s8_688;
	word32 s9_689;
	word32 s10_690;
	word32 s11_691;
	Eq_2 a0_102;
	Eq_2 ra_108 = bl_printk(bl_printk(bl_printk(memset(ra, fp + -0x00B0, 0x00, 0x0080, out t1_639, out a0_640, out a1_641, out a2_642, out a3_32, out a4_643, out a5_644), &g_t230BEDA4, a3_32, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_645, out a0_646, out a1_647, out a2_648, out a3_49, out a4_649, out a5_650, out s2_651, out s3_652, out s4_653, out s5_654, out s6_655, out s7_656, out s8_657, out s9_658, out s10_659, out s11_660), &g_t230BEDBC, a3_49, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_661, out a0_662, out a1_663, out a2_664, out a3_77, out a4_665, out a5_666, out s2_667, out s3_668, out s4_669, out s5_670, out s6_671, out s7_672, out s8_673, out s9_674, out s10_675, out s11_676), &g_t230BEDD4, a3_77, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_677, out a0_102, out a1_678, out a2_679, out a3_680, out a4_681, out a5_682, out s2_683, out s3_113, out s4_684, out s5_685, out s6_686, out s7_687, out s8_688, out s9_689, out s10_690, out s11_691);
	up32 s0_122 = 0x230CC1DC;
	up32 s3_123 = s3_113 + 604;
	Eq_2 s8_124 = 0x0080;
	word32 s7_125 = 0x230BF000;
	while (s0_122 < s3_123)
	{
		Eq_2 a1_137;
		word32 a2_692;
		word32 a4_693;
		word32 a5_694;
		Eq_2 a3_134;
		if (s8_124 < strlen(a0_102, out a1_137, out a2_692, out a3_134, out a4_693, out a5_694))
		{
			word32 s1_695;
			word32 a0_696;
			word32 a1_697;
			word32 a2_698;
			word32 a3_699;
			word32 a4_700;
			word32 a5_701;
			word32 s2_702;
			word32 s3_703;
			word32 s4_704;
			word32 s5_705;
			word32 s6_706;
			word32 s7_707;
			word32 s8_708;
			word32 s9_709;
			word32 s10_710;
			word32 s11_711;
			bl_printk(ra_108, &g_t230BEDEC, a3_134, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_695, out a0_696, out a1_697, out a2_698, out a3_699, out a4_700, out a5_701, out s2_702, out s3_703, out s4_704, out s5_705, out s6_706, out s7_707, out s8_708, out s9_709, out s10_710, out s11_711);
			return;
		}
		word32 s0_142;
		if ((word32) bLocB0 != 0x00)
		{
			s0_142 = (word32) *((word32) a1_137 + 4);
			word32 a1_722;
			word32 a2_723;
			word32 a3_724;
			word32 a4_725;
			word32 a5_726;
			a0_102 = strcmp(fp + -0x00B0, a1_137, out a1_722, out a2_723, out a3_724, out a4_725, out a5_726);
			if (a0_102 == 0x00)
				goto l2305A634;
			word32 a1_727;
			word32 a2_728;
			word32 a3_729;
			word32 a4_730;
			word32 a5_731;
			word32 t1_732;
			word32 a0_733;
			word32 a1_734;
			word32 a2_735;
			word32 a4_736;
			word32 a5_737;
			ra_108 = memset(ra_108, fp + -0x00B0, 0x00, strlen(fp + -0x00B0, out a1_727, out a2_728, out a3_729, out a4_730, out a5_731), out t1_732, out a0_733, out a1_734, out a2_735, out a3_134, out a4_736, out a5_737);
		}
		Eq_2 a0_187;
		word32 s4_199;
		word32 s1_712;
		word32 a2_713;
		word32 a3_714;
		word32 a4_715;
		word32 a5_716;
		word32 s2_717;
		word32 s5_718;
		word32 s9_719;
		word32 s10_720;
		word32 s11_721;
		Eq_2 a1_188;
		up32 s6_201;
		ra_108 = bl_printk(ra_108, s7_125 + -0x0200, a3_134, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_712, out a0_187, out a1_188, out a2_713, out a3_714, out a4_715, out a5_716, out s2_717, out s3_123, out s4_199, out s5_718, out s6_201, out s7_125, out s8_124, out s9_719, out s10_720, out s11_721);
		if ((word32) bLocB0 == 0x00)
		{
l2305A65E:
			s0_142 = (word32) *((word32) a1_188 + 4);
			a0_102 = fp + -0x00B0;
			up32 s1_225 = s4_199 + 604;
			word32 a4_742;
			word32 a5_743;
			Eq_2 a1_226 = strcpy(fp + -0x00B0, a1_188, out a4_742, out a5_743);
			while (s1_225 < s6_201)
			{
				s0_142 = (word32) *((word32) a1_226 + 4);
				Eq_2 a3_240;
				Eq_2 a5_242;
				word32 a1_744;
				word32 a4_745;
				a0_102 = strstr(ra_108, a0_102, a1_226, out a1_744, out a3_240, out a4_745, out a5_242);
				word32 s1_247 = *((word32) a5_242 + 4);
				a1_226 = a0_102;
				if (a0_102 == a5_242)
				{
					word32 a2_746;
					word32 a3_747;
					word32 a4_748;
					word32 a5_749;
					word32 s4_750;
					word32 s5_751;
					word32 s10_752;
					word32 s11_753;
					struct Eq_330427 * s2_268;
					struct Eq_330427 * s9_275;
					ra_108 = bl_printk(ra_108, s7_125 + -0x0200, a3_240, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_247, out a0_102, out a1_226, out a2_746, out a3_747, out a4_748, out a5_749, out s2_268, out s3_123, out s4_750, out s5_751, out s6_201, out s7_125, out s8_124, out s9_275, out s10_752, out s11_753);
					for (; s2_268 < s9_275; ++s2_268)
					{
						s1_247 = (word32) *((word32) a1_226 + 4);
						Eq_2 a3_288;
						word32 a1_754;
						word32 a4_755;
						word32 a5_756;
						a0_102 = strstr(ra_108, s2_268->dw0004, a1_226, out a1_754, out a3_288, out a4_755, out a5_756);
						a1_226 = a0_102;
						if (a0_102 == s2_268->dw0004)
						{
							word32 a2_757;
							word32 a3_758;
							word32 a4_759;
							word32 a5_760;
							word32 s4_761;
							word32 s5_762;
							word32 s10_763;
							word32 s11_764;
							ra_108 = bl_printk(ra_108, s7_125 + -0x0200, a3_288, dwLocA8, dwLoc88, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s1_247, out a0_102, out a1_226, out a2_757, out a3_758, out a4_759, out a5_760, out s2_268, out s3_123, out s4_761, out s5_762, out s6_201, out s7_125, out s8_124, out s9_275, out s10_763, out s11_764);
						}
					}
				}
				s1_225 = s1_247 + 0x08;
			}
			goto l2305A634;
		}
		s0_142 = (word32) *((word32) a0_187 + 4);
		word32 a2_738;
		word32 a3_739;
		word32 a4_740;
		word32 a5_741;
		a0_102 = strcmp(a0_187, fp + -0x00B0, out a1_188, out a2_738, out a3_739, out a4_740, out a5_741);
		if (a0_102 != 0x00)
			goto l2305A65E;
l2305A634:
		s0_122 = s0_142 + 0x08;
	}
}

// 2305A6CC: Register up32 blog_strcpy.part.0(Register up32 a0, Register (ptr32 Eq_330506) a1, Register (ptr32 byte) a2, Register out Eq_330508 a3Out)
// Called from:
//      blog_hexdump_out
up32 blog_strcpy.part.0(up32 a0, struct Eq_330506 * a1, byte * a2, union Eq_330508 & a3Out)
{
	byte * a5_16 = a2;
	up32 a0_6 = a0 - a2;
	while (true)
	{
		word32 a4_10 = (word32) *a5_16;
		if (a4_10 == 0x00 || a5_16 + a0_6 > 0x00FF)
			break;
		++a1;
		a1[0x0FFF] = (struct Eq_330506) (byte) a4_10;
		++a5_16;
	}
	a3Out.u0 = 0x00FF;
	return a5_16 - a2;
}

