pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305A6F2: void cmd_blog_set_level(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack word32 dwArgA8, Stack Eq_2 dwArgBC)
void cmd_blog_set_level(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, word32 dwArgA8, Eq_2 dwArgBC)
{
	Eq_2 a3_249;
	Eq_2 ra_252;
	if (a2 != 0x03)
	{
		word32 a5_538;
		word32 a0_534;
		word32 s3_540;
		word32 s2_539;
		word32 a2_536;
		word32 a1_535;
		word32 s1_533;
		word32 s11_548;
		word32 s8_545;
		word32 s10_547;
		word32 s9_546;
		word32 s5_542;
		word32 s7_544;
		word32 s6_543;
		word32 s4_541;
		word32 a4_537;
		ra_252 = bl_printk(ra, &g_t230BEE14, a3, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_533, out a0_534, out a1_535, out a2_536, out a3_249, out a4_537, out a5_538, out s2_539, out s3_540, out s4_541, out s5_542, out s6_543, out s7_544, out s8_545, out s9_546, out s10_547, out s11_548);
		goto l2305A716;
	}
	word32 s3_101;
	struct Eq_274 * a0_222;
	Eq_2 a3_108;
	word32 a2_529;
	word32 a1_528;
	word32 a3_530;
	word32 a4_531;
	word32 a5_532;
	Eq_2 a0_27 = strcmp(a0, 0x230BEE24, out a1_528, out a2_529, out a3_530, out a4_531, out a5_532);
	if (a0_27 != 0x00)
	{
		word32 a4_569;
		word32 a5_570;
		word32 a1_566;
		word32 a3_568;
		word32 a2_567;
		Eq_2 a0_40 = strcmp(a0_27, 587984424, out a1_566, out a2_567, out a3_568, out a4_569, out a5_570);
		s3_101 = 0x01;
		if (a0_40 != 0x00)
		{
			word32 a4_578;
			word32 a5_579;
			word32 a1_575;
			word32 a3_577;
			word32 a2_576;
			Eq_2 a0_53 = strcmp(a0_40, 0x230C5050, out a1_575, out a2_576, out a3_577, out a4_578, out a5_579);
			s3_101 = 0x02;
			if (a0_53 != 0x00)
			{
				word32 a5_584;
				word32 a2_581;
				word32 a4_583;
				word32 a3_582;
				word32 a1_580;
				Eq_2 a0_66 = strcmp(a0_53, 0x230BEE30, out a1_580, out a2_581, out a3_582, out a4_583, out a5_584);
				s3_101 = 0x03;
				if (a0_66 != 0x00)
				{
					word32 a3_587;
					word32 a4_588;
					word32 a5_589;
					word32 a2_586;
					word32 a1_585;
					Eq_2 a0_79 = strcmp(a0_66, 588006872, out a1_585, out a2_586, out a3_587, out a4_588, out a5_589);
					s3_101 = 0x04;
					if (a0_79 != 0x00)
					{
						word32 a4_593;
						word32 a5_594;
						word32 a1_590;
						word32 a3_592;
						word32 a2_591;
						Eq_2 a0_92 = strcmp(a0_79, 587984440, out a1_590, out a2_591, out a3_592, out a4_593, out a5_594);
						s3_101 = 0x05;
						if (a0_92 != 0x00)
						{
							s3_101 = 0x06;
							word32 a2_596;
							word32 a5_598;
							word32 a4_597;
							word32 a1_595;
							if (strcmp(a0_92, 587984448, out a1_595, out a2_596, out a3_108, out a4_597, out a5_598) != 0x00)
							{
								a0_222 = (struct Eq_274 *) &g_t230BEE48;
								goto l2305A7BC;
							}
						}
					}
				}
			}
		}
	}
	else
		s3_101 = 0x00;
	word32 a3_572;
	word32 a5_574;
	word32 a4_573;
	word32 a2_571;
	Eq_2 a1_123;
	Eq_2 a0_119 = strlen(s0, out a1_123, out a2_571, out a3_572, out a4_573, out a5_574);
	word32 a5_125 = 0x00;
	Eq_2 a4_126 = 0x00;
	a3_108.u0 = 46;
	while (a4_126 < a0_119)
	{
		if (CONVERT(Mem19[s0 + a4_126:byte], byte, word32) == 46)
			++a5_125;
		a4_126 = (word32) a4_126 + 1;
	}
	int32 s2_142;
	int32 s0_141;
	if (a5_125 != 0x00)
	{
		if (a5_125 != 0x01)
		{
			if (a5_125 != 0x02)
			{
				a0_222 = (struct Eq_274 *) &g_t230BEE68;
				goto l2305A7BC;
			}
			s0_141 = 0x230CC2DC;
			s2_142 = 0x230CC2DC;
		}
		else
		{
			s0_141 = 0x230CC2DC;
			s2_142 = 0x230CC25C;
		}
	}
	else
	{
		s0_141 = 0x230CC25C;
		s2_142 = 0x230CC1DC;
	}
	int32 s0_157 = (s0_141 - s2_142 >> 3) + ~0x00;
	int32 s6_158 = 0x00;
	while (s0_157 >= s6_158)
	{
		int32 s5_164 = s6_158 + s0_157;
		struct Eq_330831 * s4_168 = (s5_164 >> 0x01 << 0x03) + s2_142;
		word32 a2_615;
		word32 a4_616;
		word32 a5_617;
		Eq_2 a0_170 = strcmp(s4_168->t0004, a1_123, out a1_123, out a2_615, out a3_108, out a4_616, out a5_617);
		if (a0_170 >= 0x00)
		{
			if (a0_170 == 0x00)
			{
				*s4_168->ptr0000 = (byte) s3_101;
				0x00 = dwArgA8;
				word32 s1_618;
				word32 a0_619;
				word32 a1_620;
				word32 a2_621;
				word32 a3_622;
				word32 a4_623;
				word32 a5_624;
				word32 s2_625;
				word32 s3_626;
				word32 s4_627;
				word32 s5_628;
				word32 s6_629;
				word32 s7_630;
				word32 s8_631;
				word32 s9_632;
				word32 s10_633;
				word32 s11_634;
				bl_printk(ra, &g_t230BEEB8, a3_108, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_618, out a0_619, out a1_620, out a2_621, out a3_622, out a4_623, out a5_624, out s2_625, out s3_626, out s4_627, out s5_628, out s6_629, out s7_630, out s8_631, out s9_632, out s10_633, out s11_634);
				return;
			}
			else
			{
				s0_157 = (s5_164 >> 0x01) + -1;
				continue;
			}
		}
		s6_158 = (s5_164 >> 0x01) + 1;
	}
	a0_222 = (struct Eq_274 *) &g_t230BEE9C;
l2305A7BC:
	word32 s5_608;
	word32 s2_605;
	word32 a1_601;
	word32 a4_603;
	word32 a0_600;
	word32 a5_604;
	word32 a2_602;
	word32 s1_599;
	word32 s6_609;
	word32 s4_607;
	word32 s3_606;
	word32 s7_610;
	word32 s8_611;
	word32 s9_612;
	word32 s10_613;
	word32 s11_614;
	ra_252 = bl_printk(ra, a0_222, a3_108, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_599, out a0_600, out a1_601, out a2_602, out a3_249, out a4_603, out a5_604, out s2_605, out s3_606, out s4_607, out s5_608, out s6_609, out s7_610, out s8_611, out s9_612, out s10_613, out s11_614);
l2305A716:
	0x00 = dwArgA8;
	word32 s9_563;
	word32 s11_565;
	word32 s10_564;
	word32 s6_560;
	word32 s8_562;
	word32 s7_561;
	word32 s3_557;
	word32 s5_559;
	word32 s4_558;
	word32 a4_554;
	word32 s2_556;
	word32 a5_555;
	word32 a1_551;
	word32 a3_553;
	word32 a2_552;
	word32 a0_550;
	word32 s1_549;
	bl_printk(ra_252, &g_t230BEE88, a3_249, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_549, out a0_550, out a1_551, out a2_552, out a3_553, out a4_554, out a5_555, out s2_556, out s3_557, out s4_558, out s5_559, out s6_560, out s7_561, out s8_562, out s9_563, out s10_564, out s11_565);
}

// 2305A8AC: Register Eq_2 blog_port_output(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Register out ptr32 a0Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      blog_hexdump_out
Eq_2 blog_port_output(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, ptr32 & a0Out, ptr32 & s6Out, ptr32 & s7Out)
{
	ptr32 a0_12;
	ptr32 s6_26;
	ptr32 s7_27;
	word32 s1_41;
	word32 a1_42;
	word32 a2_43;
	word32 a3_44;
	word32 a4_45;
	word32 a5_46;
	word32 s2_47;
	word32 s3_48;
	word32 s4_49;
	word32 s5_50;
	word32 s8_51;
	word32 s9_52;
	word32 s10_53;
	word32 s11_54;
	Eq_2 ra_18 = bl_printk(ra, &g_t230BED9C, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_41, out a0_12, out a1_42, out a2_43, out a3_44, out a4_45, out a5_46, out s2_47, out s3_48, out s4_49, out s5_50, out s6_26, out s7_27, out s8_51, out s9_52, out s10_53, out s11_54);
	a0Out = a0_12;
	s6Out = s6_26;
	s7Out = s7_27;
	return ra_18;
}

