pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305A8BA: Register Eq_2 blog_hexdump_out(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s9, Register Eq_2 s10, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out ptr32 a3Out, Register out ptr32 s5Out)
// Called from:
//      write_data
//      __ble_bytes_send
Eq_2 blog_hexdump_out(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 s9, Eq_2 s10, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg5C, Eq_2 dwArg6C, union Eq_2 & s0Out, union Eq_2 & a0Out, ptr32 & a3Out, ptr32 & s5Out)
{
	Eq_2 s6_330 = a3;
	Eq_2 s0_337 = 0x00;
	word32 s7_331 = 0x42017000;
	a0_315 = a0;
	while (true)
	{
		Eq_2 a0_315;
		if (s0_337 >= s6_330)
			break;
		word32 s7_75;
		word32 s8_76;
		word32 a1_681;
		word32 a3_683;
		word32 a7_686;
		word32 s4_689;
		word32 s1_680;
		word32 a4_684;
		word32 s2_687;
		word32 s5_690;
		word32 s10_691;
		word32 s3_688;
		word32 a5_685;
		word32 a2_682;
		Eq_330999 a0_58;
		word32 s11_135;
		int32 s0_132;
		int32 s6_100;
		byte s9_115[];
		Eq_2 ra_123 = snprintf(ra, s7_331 + 600, 0x0100, &g_t230BED44, s10, dwLoc28, dwArg04, dwArg20, a0, s1, dwArg6C, out s0_132, out s1_680, out a0_58, out a1_681, out a2_682, out a3_683, out a4_684, out a5_685, out a7_686, out s2_687, out s3_688, out s4_689, out s5_690, out s6_100, out s7_75, out s8_76, out s9_115, out s10_691, out s11_135);
		if (a0_58 > 0x0100)
			a0_58.u0 = 0x0100;
		up32 s10_134 = (word32) (word16) a0_58;
		int32 s3_137 = s0_132;
		int32 s5_139 = s0_132;
		ui32 s4_138 = 0x00;
		up32 s1_133 = (word32) (word16) s8_76;
		word32 s2_136 = s7_75 + 600;
		while ((word32) (word16) s4_138 < s1_133)
		{
			if (s5_139 < s6_100)
			{
				word32 a2_709;
				word32 a7_713;
				word32 s7_714;
				word32 s8_715;
				word32 a5_712;
				word32 a3_710;
				word32 a4_711;
				word32 a1_708;
				word32 a0_707;
				ra_123 = snprintf(ra_123, fp + -72, 0x08, &g_t230BED58, s10, dwLoc28, dwArg04, dwArg20, a0, s1, dwArg6C, out s0_132, out s1_133, out a0_707, out a1_708, out a2_709, out a3_710, out a4_711, out a5_712, out a7_713, out s2_136, out s3_137, out s4_138, out s5_139, out s6_100, out s7_714, out s8_715, out s9_115, out s10_134, out s11_135);
			}
			else
			{
				word32 a4_705;
				word32 a5_706;
				word32 a3_704;
				word32 a2_703;
				strncpy(fp + -72, 587984224, 0x08, out a2_703, out a3_704, out a4_705, out a5_706);
			}
			word32 a3_729;
			word32 s10_161 = s10_134 + blog_strcpy.part.0(s10_134, s2_136 + s10_134, fp + -72, out a3_729);
			++s4_138;
			s10_134 = (word32) (word16) s10_161;
			if ((s4_138 & 7) == 0x00)
			{
				word32 a3_716;
				s10_134 = (word32) (word16) ((word32) (word16) s10_161 + blog_strcpy.part.0((word32) ((word16) s10_161), s2_136 + (word32) ((word16) s10_161), s11_135 + -684, out a3_716));
			}
			++s5_139;
		}
		word32 a3_692;
		up32 s4_196 = (word32) (word16) (blog_strcpy.part.0(s10_134, s2_136 + s10_134, &g_b230BED64, out a3_692) + s10_134);
		Eq_331062 s5_197 = 94;
		word32 a4_198 = 0x230BF000;
		while ((word32) (word16) (s3_137 - s0_132) < s1_133)
		{
			if (s3_137 < s6_100)
			{
				up32 s4_237;
				word32 s7_724;
				word32 s8_725;
				word32 s10_726;
				word32 s11_727;
				word32 a7_723;
				word32 a5_722;
				word32 a4_721;
				word32 a3_720;
				word32 a2_719;
				word32 a1_718;
				word32 a0_717;
				ra_123 = snprintf(ra_123, fp + -72, 0x08, a4_198 + -664, s10, dwLoc28, dwArg04, dwArg20, a0, s1, dwArg6C, out s0_132, out s1_133, out a0_717, out a1_718, out a2_719, out a3_720, out a4_721, out a5_722, out a7_723, out s2_136, out s3_137, out s4_237, out s5_197, out s6_100, out s7_724, out s8_725, out s9_115, out s10_726, out s11_727);
				word32 a3_728;
				s4_196 = (word32) (word16) (s4_237 + blog_strcpy.part.0(s4_237, s2_136 + s4_237, fp + -72, out a3_728));
				a4_198 = 0x230BF000;
			}
			++s3_137;
		}
		word32 a1_693;
		word32 a5_697;
		word32 a4_696;
		word32 a2_694;
		word32 a3_695;
		if ((word32) strlen(0x230C6900, out a1_693, out a2_694, out a3_695, out a4_696, out a5_697) + s4_196 > 0x0100)
		{
			word32 a4_701;
			word32 a5_702;
			word32 a3_700;
			word32 a1_698;
			word32 a2_699;
			s4_196 = (word32) (word16) (0x0100 - strlen(0x230C6900, out a1_698, out a2_699, out a3_700, out a4_701, out a5_702));
		}
		Eq_2 a3_294;
		blog_strcpy.part.0(s4_196, s2_136 + s4_196, &g_b230C6900, out a3_294);
		ra = blog_port_output(ra_123, a3_294, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out a0_315, out s6_330, out s7_331);
		s0_337 = (word32) (word16) (s0_132 + s1_133);
	}
	s0Out = s0_337;
	a0Out = a0_315;
	a3Out = dwArg08;
	s5Out = s4;
	return dwArg68;
}

// 2305AA80: Register Eq_2 blog_init(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      bfl_main
Eq_2 blog_init(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	union Eq_331309 * a2_15;
	word32 s11_157;
	word32 s8_154;
	word32 s9_155;
	word32 s10_156;
	word32 s5_151;
	word32 s6_152;
	word32 s7_153;
	word32 s2_148;
	word32 s3_149;
	word32 s4_150;
	word32 a3_145;
	word32 a4_146;
	word32 a5_147;
	word32 s1_142;
	word32 a0_143;
	word32 a1_144;
	Eq_2 ra_19 = bl_printk(ra, &g_t230BED6C, 0x02, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_142, out a0_143, out a1_144, out a2_15, out a3_145, out a4_146, out a5_147, out s2_148, out s3_149, out s4_150, out s5_151, out s6_152, out s7_153, out s8_154, out s9_155, out s10_156, out s11_157);
	up32 a5_35 = 0x230CC1DC;
	while (a5_35 < 0x230CC25C)
	{
		a5_35 = (char *) *a2_15 + 8;
		*a2_15 = (union Eq_331309 *) 0x02;
	}
	up32 a5_48 = 0x230CC25C;
	while (a5_48 < 0x230CC2DC)
	{
		a5_48 = (char *) *a2_15 + 8;
		*a2_15 = (union Eq_331309 *) 0x02;
	}
	up32 a5_61 = 0x230CC2DC;
	while (a5_61 < 0x230CC2DC)
	{
		a5_61 = (char *) *a2_15 + 8;
		*a2_15 = (union Eq_331309 *) 0x02;
	}
	return ra_19;
}

// 2305AAFC: void ota_dump_cmd(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s6, Stack word32 dwArg0C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118)
void ota_dump_cmd(Eq_2 ra, Eq_2 a3, Eq_2 s6, word32 dwArg0C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118)
{
	hal_boot2_dump(ra, a3, s6, dwArg0C, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118);
}

