pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305AB00: void ota_tcp_cmd.part.0(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48)
// Called from:
//      ota_tcp_cmd
void ota_tcp_cmd.part.0(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48)
{
	Eq_2 a0_1284;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	word32 a0_31 = *((word32) a0 + 4);
	Eq_2 stackArg120 = <invalid>;
	Eq_2 stackArg184 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	Eq_2 stackArg328 = <invalid>;
	word32 a4_1700;
	word32 a3_1699;
	word32 a0_1697;
	word32 a2_1698;
	lwip_gethostbyname(ra, s0, a0, a3, mstatus, stackArg120, stackArg184, stackArg248, stackArg264, stackArg312, stackArg328, out a0_1697, out a2_1698, out a3_1699, out a4_1700);
	if (a0_31 == 0x00)
	{
		a0_1284.u0 = 587984648;
		goto l2305AB46;
	}
	word32 a0_41;
	Eq_2 a3_44;
	word32 s0_1708;
	word32 s5_1710;
	word32 s6_1711;
	word32 s2_1709;
	Eq_2 ra_57 = bl_mtd_open(ra, 0x230BEF20, a3, a4, a5, s3, mstatus, dwLoc0140, dwLoc013C, dwLoc0110, dwLoc010C, dwLocE8, dwLocC4, dwLoc9C, dwLoc88, dwLoc48, s8, s0, out s0_1708, out a0_41, out a3_44, out s2_1709, out s5_1710, out s6_1711);
	if (a0_41 != 0x00)
	{
		a0_1284.u0 = 587984676;
l2305AB46:
		word32 a4_1704;
		word32 a1_1702;
		word32 a5_1705;
		word32 a2_1703;
		word32 s4_1706;
		word32 s8_1707;
		word32 a0_1701;
		puts(a0_1284, out a0_1701, out a1_1702, out a2_1703, out a4_1704, out a5_1705, out s4_1706, out s8_1707);
		return;
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg52 = <invalid>;
	Eq_2 stackArg88 = <invalid>;
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg152 = <invalid>;
	Eq_2 stackArg168 = <invalid>;
	Eq_2 stackArg216 = <invalid>;
	Eq_2 stackArg232 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	Eq_2 stackArg328 = <invalid>;
	Eq_2 stackArg360 = <invalid>;
	word32 a3_1727;
	word32 s2_1728;
	word32 s5_1729;
	lwip_socket(ra, a1, a2, a3, mstatus, stackArg52, stackArg88, stackArg104, stackArg152, stackArg168, stackArg216, stackArg232, stackArg248, stackArg264, stackArg296, stackArg312, stackArg328, stackArg360, out a3_1727, out s2_1728, out s5_1729);
	if (false)
	{
		word32 s11_1747;
		word32 t4_1748;
		word32 a5_1736;
		word32 s10_1746;
		word32 a7_1737;
		word32 s9_1745;
		word32 s2_1738;
		word32 s3_1739;
		word32 s7_1743;
		word32 s8_1744;
		word32 s6_1742;
		word32 s4_1740;
		word32 s5_1741;
		word32 a4_1735;
		word32 a3_1734;
		word32 a1_1732;
		word32 a2_1733;
		word32 a0_1731;
		word32 s1_1730;
		printf(ra_57, &g_t230BEF48, a3_44, dwLoc0148, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1730, out a0_1731, out a1_1732, out a2_1733, out a3_1734, out a4_1735, out a5_1736, out a7_1737, out s2_1738, out s3_1739, out s4_1740, out s5_1741, out s6_1742, out s7_1743, out s8_1744, out s9_1745, out s10_1746, out s11_1747, out t4_1748);
		goto l2305ABBC;
	}
	Eq_2 a2_1195;
	Eq_2 a5_1192;
	word32 a5_1757;
	word32 a4_1756;
	word32 a2_1754;
	word32 a3_1755;
	word32 a1_1753;
	word32 t1_1751;
	word32 a0_1752;
	Eq_2 ra_81 = memset(ra_57, fp + -0x0144, 0x00, 0x10, out t1_1751, out a0_1752, out a1_1753, out a2_1754, out a3_1755, out a4_1756, out a5_1757);
	union Eq_2 ** a5_89;
	lwip_htons(0x00FFFD05, out a5_89);
	Eq_2 a5_94 = **a5_89;
	Eq_2 a3_100;
	Eq_2 a4_101;
	Eq_2 a5_102;
	Eq_2 a0_114;
	Eq_2 a3_117;
	word32 a2_1758;
	word32 s8_1768;
	word32 s1_1759;
	word32 s4_1767;
	word32 a1_1760;
	word32 a2_1761;
	word32 s2_1765;
	word32 s3_1766;
	word32 a6_1764;
	word32 a4_1762;
	word32 a5_1763;
	pvPortMalloc(ra_81, ip4addr_ntoa(out a2_1758, out a3_100, out a4_101, out a5_102), 0x0200, a3_100, a4_101, a5_102, mstatus, dwLoc0110, dwLoc010C, dwLocC4, s4, dwArg28, out s1_1759, out a0_114, out a1_1760, out a2_1761, out a3_117, out a4_1762, out a5_1763, out a6_1764, out s2_1765, out s3_1766, out s4_1767, out s8_1768);
	hal_boot2_get_active_partition();
	Eq_2 a3_139;
	Eq_2 a3_164;
	word32 s10_1802;
	word32 s11_1803;
	word32 t4_1804;
	word32 a4_1791;
	word32 s9_1801;
	word32 a5_1792;
	word32 s8_1800;
	word32 a7_1793;
	word32 s2_1794;
	word32 s6_1798;
	word32 s7_1799;
	word32 s5_1797;
	word32 s3_1795;
	word32 s4_1796;
	word32 s6_1780;
	word32 a2_1790;
	word32 s7_1781;
	word32 a1_1789;
	word32 s8_1782;
	word32 s9_1783;
	word32 s1_1787;
	word32 a0_1788;
	word32 t4_1786;
	word32 s10_1784;
	word32 s11_1785;
	word32 s1_1769;
	word32 s5_1779;
	word32 a0_1770;
	word32 s4_1778;
	word32 a1_1771;
	word32 a2_1772;
	word32 s2_1776;
	word32 s3_1777;
	word32 a7_1775;
	word32 a4_1773;
	word32 a5_1774;
	Eq_2 ra_167 = printf(printf(ra_81, &g_t230BEF5C, a3_117, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1769, out a0_1770, out a1_1771, out a2_1772, out a3_139, out a4_1773, out a5_1774, out a7_1775, out s2_1776, out s3_1777, out s4_1778, out s5_1779, out s6_1780, out s7_1781, out s8_1782, out s9_1783, out s10_1784, out s11_1785, out t4_1786), &g_t230BEF84, a3_139, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1787, out a0_1788, out a1_1789, out a2_1790, out a3_164, out a4_1791, out a5_1792, out a7_1793, out s2_1794, out s3_1795, out s4_1796, out s5_1797, out s6_1798, out s7_1799, out s8_1800, out s9_1801, out s10_1802, out s11_1803, out t4_1804);
	hal_boot2_get_active_entries(a0, a1);
	Eq_2 s0_1051 = a0_114;
	if (false)
	{
		word32 s4_1813;
		word32 s5_1814;
		word32 s6_1815;
		word32 s7_1816;
		word32 s11_1820;
		word32 t4_1821;
		word32 s10_1819;
		word32 s8_1817;
		word32 s9_1818;
		word32 s3_1812;
		word32 s2_1811;
		word32 s1_1805;
		word32 a4_1809;
		word32 a7_1810;
		word32 a3_1808;
		word32 a0_1806;
		word32 a1_1807;
		printf(ra_167, &g_t230BEFA4, a3_164, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1805, out a0_1806, out a1_1807, out a2_1195, out a3_1808, out a4_1809, out a5_1192, out a7_1810, out s2_1811, out s3_1812, out s4_1813, out s5_1814, out s6_1815, out s7_1816, out s8_1817, out s9_1818, out s10_1819, out s11_1820, out t4_1821);
	}
	else
	{
		Eq_2 a3_201;
		Eq_2 a3_227;
		Eq_2 a3_252;
		word32 s3_1877;
		word32 s2_1876;
		word32 a7_1875;
		word32 a5_1874;
		word32 a4_1873;
		word32 a2_1872;
		word32 a1_1871;
		word32 a0_1870;
		word32 s1_1869;
		word32 t4_1868;
		word32 s11_1867;
		word32 s10_1866;
		word32 s7_1863;
		word32 s8_1864;
		word32 s9_1865;
		word32 s5_1861;
		word32 s6_1862;
		word32 s4_1860;
		word32 s3_1859;
		word32 s2_1858;
		word32 a7_1857;
		word32 a5_1856;
		word32 a4_1855;
		word32 s10_1848;
		word32 s11_1849;
		word32 a1_1853;
		word32 a2_1854;
		word32 a0_1852;
		word32 t4_1850;
		word32 s1_1851;
		word32 s3_1841;
		word32 s4_1842;
		word32 s8_1846;
		word32 s9_1847;
		word32 s7_1845;
		word32 s5_1843;
		word32 s6_1844;
		word32 s2_1840;
		word32 a7_1839;
		word32 a5_1838;
		word32 a1_1835;
		word32 a2_1836;
		word32 a4_1837;
		word32 a0_1834;
		word32 s1_1833;
		word32 s4_1878;
		word32 s5_1879;
		word32 s6_1880;
		word32 s7_1881;
		word32 s8_1882;
		word32 s9_1883;
		word32 s10_1884;
		word32 s11_1885;
		word32 t4_1886;
		Eq_2 ra_255 = printf(printf(printf(ra_167, &g_t230BEFC8, fp + -64, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1833, out a0_1834, out a1_1835, out a2_1836, out a3_201, out a4_1837, out a5_1838, out a7_1839, out s2_1840, out s3_1841, out s4_1842, out s5_1843, out s6_1844, out s7_1845, out s8_1846, out s9_1847, out s10_1848, out s11_1849, out t4_1850), &g_t230BEFF0, a3_201, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1851, out a0_1852, out a1_1853, out a2_1854, out a3_227, out a4_1855, out a5_1856, out a7_1857, out s2_1858, out s3_1859, out s4_1860, out s5_1861, out s6_1862, out s7_1863, out s8_1864, out s9_1865, out s10_1866, out s11_1867, out t4_1868), &g_t230BF028, a3_227, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1869, out a0_1870, out a1_1871, out a2_1872, out a3_252, out a4_1873, out a5_1874, out a7_1875, out s2_1876, out s3_1877, out s4_1878, out s5_1879, out s6_1880, out s7_1881, out s8_1882, out s9_1883, out s10_1884, out s11_1885, out t4_1886);
		0x00 = (int8) dwLoc010C;
		bl_mtd_erase_all(ra, a1);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 a3_276;
		Eq_2 a3_301;
		word32 s1_1887;
		word32 a0_1888;
		word32 a1_1889;
		word32 a2_1890;
		word32 a4_1891;
		word32 a5_1892;
		word32 a7_1893;
		word32 s2_1894;
		word32 s3_1895;
		word32 s4_1896;
		word32 s5_1897;
		word32 s6_1898;
		word32 s7_1899;
		word32 s8_1900;
		word32 s9_1901;
		word32 s10_1902;
		word32 s11_1903;
		word32 t4_1904;
		word32 s1_1905;
		word32 a0_1906;
		word32 a1_1907;
		word32 a2_1908;
		word32 a4_1909;
		word32 a5_1910;
		word32 a7_1911;
		word32 s2_1912;
		word32 s3_1913;
		word32 s5_1914;
		word32 s6_1915;
		word32 s7_1916;
		word32 s8_1917;
		word32 s9_1918;
		word32 s10_1919;
		word32 s11_1920;
		word32 t4_1921;
		int32 s4_1072;
		Eq_2 ra_304 = printf(printf(ra_255, &g_t230BF054, a3_252, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1887, out a0_1888, out a1_1889, out a2_1890, out a3_276, out a4_1891, out a5_1892, out a7_1893, out s2_1894, out s3_1895, out s4_1896, out s5_1897, out s6_1898, out s7_1899, out s8_1900, out s9_1901, out s10_1902, out s11_1903, out t4_1904), &g_t230BF05C, a3_276, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1905, out a0_1906, out a1_1907, out a2_1908, out a3_301, out a4_1909, out a5_1910, out a7_1911, out s2_1912, out s3_1913, out s4_1072, out s5_1914, out s6_1915, out s7_1916, out s8_1917, out s9_1918, out s10_1919, out s11_1920, out t4_1921);
		Eq_2 stackArg52 = <invalid>;
		Eq_2 stackArg72 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		word32 a0_1926;
		word32 a3_1927;
		lwip_connect(a0, a1, mstatus, stackArg52, stackArg72, stackArg136, stackArg200, out a0_1926, out a3_1927);
		s0_1051 = dwLocEC;
		if (s4_1072 == 0x00)
		{
			utils_sha256_init(ra, a0);
			utils_sha256_starts(a0);
			word32 t1_1959;
			word32 a0_1960;
			word32 a1_1961;
			word32 a2_1962;
			word32 a4_1963;
			word32 a5_1964;
			Eq_2 a3_1063;
			Eq_2 ra_1066 = memset(ra_304, fp + -308, 0x00, 32, out t1_1959, out a0_1960, out a1_1961, out a2_1962, out a3_1063, out a4_1963, out a5_1964);
			while (true)
			{
				Eq_2 a2_1114;
				Eq_2 a5_1111;
				lwip_read(a0, a2);
				if (s4_1072 < 0x00)
					break;
				if (s4_1072 == 0x00)
				{
					word32 s1_2007;
					word32 a0_2008;
					word32 a1_2009;
					word32 a3_2010;
					word32 a4_2011;
					word32 a7_2012;
					word32 s2_2013;
					word32 s3_2014;
					word32 s4_2015;
					word32 s5_2016;
					word32 s6_2017;
					word32 s7_2018;
					word32 s8_2019;
					word32 s9_2020;
					word32 s10_2021;
					word32 s11_2022;
					word32 t4_2023;
					printf(ra_1066, &g_t230BF0A4, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2007, out a0_2008, out a1_2009, out a2_1114, out a3_2010, out a4_2011, out a5_1111, out a7_2012, out s2_2013, out s3_2014, out s4_2015, out s5_2016, out s6_2017, out s7_2018, out s8_2019, out s9_2020, out s10_2021, out s11_2022, out t4_2023);
					goto l2305AD24;
				}
				word32 a4_366;
				word32 s1_369;
				Eq_332311 s10_370;
				word32 s11_371;
				word32 s2_372;
				word32 s3_373;
				word32 s9_379;
				word32 a0_2024;
				word32 a1_2025;
				word32 a2_2026;
				word32 a5_2027;
				word32 a7_2028;
				word32 s5_2029;
				word32 s6_2030;
				word32 s7_2031;
				word32 s8_2032;
				word32 t4_2033;
				ra_1066 = printf(ra_1066, &g_t230BF0EC, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_369, out a0_2024, out a1_2025, out a2_2026, out a3_1063, out a4_366, out a5_2027, out a7_2028, out s2_372, out s3_373, out s4_1072, out s5_2029, out s6_2030, out s7_2031, out s8_2032, out s9_379, out s10_370, out s11_371, out t4_2033);
				Eq_332311 s9_382 = s9_379 + s11_371;
				if (s2_372 == 0x00)
				{
					if (s9_382 <= 511)
						continue;
					if (s9_382 == s10_370)
					{
						word32 a1_2053;
						word32 a2_2054;
						word32 a3_2055;
						word32 a4_2056;
						word32 a5_2057;
						word32 a6_2058;
						word32 a7_2059;
						memcpy(fp + -244, s0_1051, 0x10, out a1_2053, out a2_2054, out a3_2055, out a4_2056, out a5_2057, out a6_2058, out a7_2059);
						word32 a0_2060;
						word32 a1_2061;
						word32 a2_2062;
						word32 a4_2063;
						word32 a5_2064;
						word32 s4_2065;
						word32 s8_2066;
						puts(587985204, out a0_2060, out a1_2061, out a2_2062, out a4_2063, out a5_2064, out s4_2065, out s8_2066);
						word32 a0_2067;
						word32 a1_2068;
						word32 a2_2069;
						word32 a4_2070;
						word32 a5_2071;
						word32 s4_2072;
						word32 s8_2073;
						puts(fp + -244, out a0_2067, out a1_2068, out a2_2069, out a4_2070, out a5_2071, out s4_2072, out s8_2073);
						word32 a0_2074;
						word32 a1_2075;
						word32 a2_2076;
						word32 a4_2077;
						word32 a5_2078;
						word32 s4_2079;
						word32 s8_2080;
						puts(s3_373 + -0x0700, out a0_2074, out a1_2075, out a2_2076, out a4_2077, out a5_2078, out s4_2079, out s8_2080);
						word32 a1_2081;
						word32 a2_2082;
						word32 a3_2083;
						word32 a4_2084;
						word32 a5_2085;
						word32 a6_2086;
						word32 a7_2087;
						memcpy(fp + -244, (word32) s0_1051 + 16, 0x04, out a1_2081, out a2_2082, out a3_2083, out a4_2084, out a5_2085, out a6_2086, out a7_2087);
						word32 a0_2088;
						word32 a1_2089;
						word32 a2_2090;
						word32 a4_2091;
						word32 a5_2092;
						word32 s4_2093;
						word32 s8_2094;
						puts(587985236, out a0_2088, out a1_2089, out a2_2090, out a4_2091, out a5_2092, out s4_2093, out s8_2094);
						word32 a0_2095;
						word32 a1_2096;
						word32 a2_2097;
						word32 a4_2098;
						word32 a5_2099;
						word32 s4_2100;
						word32 s8_2101;
						puts(fp + -244, out a0_2095, out a1_2096, out a2_2097, out a4_2098, out a5_2099, out s4_2100, out s8_2101);
						word32 s8_796;
						word32 a0_2102;
						word32 a1_2103;
						word32 a2_2104;
						word32 a4_2105;
						word32 a5_2106;
						word32 s4_2107;
						puts(s3_373 + -0x0700, out a0_2102, out a1_2103, out a2_2104, out a4_2105, out a5_2106, out s4_2107, out s8_796);
						word32 a1_2108;
						word32 a3_2109;
						word32 a4_2110;
						word32 a5_2111;
						strstr(ra_1066, fp + -244, s8_796 + -0x0100, out a1_2108, out a3_2109, out a4_2110, out a5_2111);
						Eq_2 a3_819;
						word32 a1_2112;
						word32 a2_2113;
						word32 a4_2114;
						word32 a5_2115;
						word32 a6_2116;
						word32 a7_2117;
						memcpy(fp + -328, (word32) s0_1051 + 20, 0x04, out a1_2112, out a2_2113, out a3_819, out a4_2114, out a5_2115, out a6_2116, out a7_2117);
						word32 s3_843;
						word32 s1_2118;
						word32 a0_2119;
						word32 a1_2120;
						word32 a2_2121;
						word32 a3_2122;
						word32 a4_2123;
						word32 a5_2124;
						word32 a7_2125;
						word32 s2_2126;
						word32 s4_2127;
						word32 s5_2128;
						word32 s7_2129;
						word32 s8_2130;
						word32 s9_2131;
						word32 s10_2132;
						word32 s11_2133;
						word32 t4_2134;
						word32 s6_1012;
						Eq_2 ra_1004 = printf(ra_1066, &g_t230BF174, a3_819, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2118, out a0_2119, out a1_2120, out a2_2121, out a3_2122, out a4_2123, out a5_2124, out a7_2125, out s2_2126, out s3_843, out s4_2127, out s5_2128, out s6_1012, out s7_2129, out s8_2130, out s9_2131, out s10_2132, out s11_2133, out t4_2134);
						word32 a1_2135;
						word32 a2_2136;
						word32 a3_2137;
						word32 a4_2138;
						word32 a5_2139;
						word32 a6_2140;
						word32 a7_2141;
						memcpy(fp + -244, (word32) dwLocEC + 32, 0x10, out a1_2135, out a2_2136, out a3_2137, out a4_2138, out a5_2139, out a6_2140, out a7_2141);
						word32 a0_2142;
						word32 a1_2143;
						word32 a2_2144;
						word32 a4_2145;
						word32 a5_2146;
						word32 s4_2147;
						word32 s8_2148;
						puts(0x230BF1B0, out a0_2142, out a1_2143, out a2_2144, out a4_2145, out a5_2146, out s4_2147, out s8_2148);
						word32 a0_2149;
						word32 a1_2150;
						word32 a2_2151;
						word32 a4_2152;
						word32 a5_2153;
						word32 s4_2154;
						word32 s8_2155;
						puts(fp + -244, out a0_2149, out a1_2150, out a2_2151, out a4_2152, out a5_2153, out s4_2154, out s8_2155);
						word32 a0_2156;
						word32 a1_2157;
						word32 a2_2158;
						word32 a4_2159;
						word32 a5_2160;
						word32 s4_2161;
						word32 s8_2162;
						puts(s3_843 + -0x0700, out a0_2156, out a1_2157, out a2_2158, out a4_2159, out a5_2160, out s4_2161, out s8_2162);
						word32 a1_2163;
						word32 a2_2164;
						word32 a3_2165;
						word32 a4_2166;
						word32 a5_2167;
						word32 a6_2168;
						word32 a7_2169;
						memcpy(fp + -244, (word32) dwLocEC + 48, 0x10, out a1_2163, out a2_2164, out a3_2165, out a4_2166, out a5_2167, out a6_2168, out a7_2169);
						word32 a0_2170;
						word32 a1_2171;
						word32 a2_2172;
						word32 a4_2173;
						word32 a5_2174;
						word32 s4_2175;
						word32 s8_2176;
						puts(0x230BF1D0, out a0_2170, out a1_2171, out a2_2172, out a4_2173, out a5_2174, out s4_2175, out s8_2176);
						word32 a0_2177;
						word32 a1_2178;
						word32 a2_2179;
						word32 a4_2180;
						word32 a5_2181;
						word32 s4_2182;
						word32 s8_2183;
						puts(fp + -244, out a0_2177, out a1_2178, out a2_2179, out a4_2180, out a5_2181, out s4_2182, out s8_2183);
						word32 a0_2184;
						word32 a1_2185;
						word32 a2_2186;
						word32 a4_2187;
						word32 a5_2188;
						word32 s4_2189;
						word32 s8_2190;
						puts(s3_843 + -0x0700, out a0_2184, out a1_2185, out a2_2186, out a4_2187, out a5_2188, out s4_2189, out s8_2190);
						word32 a1_2191;
						word32 a2_2192;
						word32 a4_2193;
						word32 a5_2194;
						word32 a6_2195;
						word32 a7_2196;
						Eq_2 a3_1001;
						memcpy(fp + -244, (word32) dwLocEC + 64, 32, out a1_2191, out a2_2192, out a3_1001, out a4_2193, out a5_2194, out a6_2195, out a7_2196);
						word32 a0_2197;
						word32 a1_2198;
						word32 a2_2199;
						word32 a4_2200;
						word32 a5_2201;
						word32 s4_2202;
						word32 s8_2203;
						puts(0x230BF1F0, out a0_2197, out a1_2198, out a2_2199, out a4_2200, out a5_2201, out s4_2202, out s8_2203);
						do
						{
							word32 s10_1006;
							word32 s11_1007;
							word32 s2_1008;
							word32 s3_1009;
							Eq_2 s9_1015;
							word32 s1_2204;
							word32 a0_2205;
							word32 a1_2206;
							word32 a2_2207;
							word32 a4_2208;
							word32 a5_2209;
							word32 a7_2210;
							word32 s4_2211;
							word32 s5_2212;
							word32 s7_2213;
							word32 s8_2214;
							word32 t4_2215;
							ra_1004 = printf(ra_1004, s6_1012 + 1116, a3_1001, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2204, out a0_2205, out a1_2206, out a2_2207, out a3_1001, out a4_2208, out a5_2209, out a7_2210, out s2_1008, out s3_1009, out s4_2211, out s5_2212, out s6_1012, out s7_2213, out s8_2214, out s9_1015, out s10_1006, out s11_1007, out t4_2215);
						} while (s2_1008 != s10_1006);
						word32 a0_2216;
						word32 a1_2217;
						word32 a2_2218;
						word32 a4_2219;
						word32 a5_2220;
						word32 s4_2221;
						word32 s8_2222;
						puts(s3_1009 + -0x0700, out a0_2216, out a1_2217, out a2_2218, out a4_2219, out a5_2220, out s4_2221, out s8_2222);
						Eq_2 a3_1037;
						word32 a1_2223;
						word32 a2_2224;
						word32 a4_2225;
						word32 a5_2226;
						word32 a6_2227;
						word32 a7_2228;
						memcpy(fp + -0x0114, s9_1015, 32, out a1_2223, out a2_2224, out a3_1037, out a4_2225, out a5_2226, out a6_2227, out a7_2228);
						s0_1051 = dwLocEC;
						word32 s1_2229;
						word32 a0_2230;
						word32 a1_2231;
						word32 a2_2232;
						word32 a4_2233;
						word32 a5_2234;
						word32 a7_2235;
						word32 s2_2236;
						word32 s3_2237;
						word32 s5_2238;
						word32 s6_2239;
						word32 s7_2240;
						word32 s8_2241;
						word32 s9_2242;
						word32 s10_2243;
						word32 s11_2244;
						word32 t4_2245;
						ra_1066 = printf(ra_1004, &g_t230BF20C, a3_1037, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2229, out a0_2230, out a1_2231, out a2_2232, out a3_1063, out a4_2233, out a5_2234, out a7_2235, out s2_2236, out s3_2237, out s4_1072, out s5_2238, out s6_2239, out s7_2240, out s8_2241, out s9_2242, out s10_2243, out s11_2244, out t4_2245);
						continue;
					}
					else
					{
						word32 s1_2034;
						word32 a0_2035;
						word32 a1_2036;
						word32 a2_2037;
						word32 a3_2038;
						word32 a4_2039;
						word32 a5_2040;
						word32 a7_2041;
						word32 s2_2042;
						word32 s3_2043;
						word32 s4_2044;
						word32 s5_2045;
						word32 s6_2046;
						word32 s7_2047;
						word32 s8_2048;
						word32 s9_2049;
						word32 s10_2050;
						word32 s11_2051;
						word32 t4_2052;
