pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
						printf(ra_1066, &g_t230BF104, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2034, out a0_2035, out a1_2036, out a2_2037, out a3_2038, out a4_2039, out a5_2040, out a7_2041, out s2_2042, out s3_2043, out s4_2044, out s5_2045, out s6_2046, out s7_2047, out s8_2048, out s9_2049, out s10_2050, out s11_2051, out t4_2052);
						while (true)
							;
					}
				}
				s0_1051 = dwLoc8C;
				if (a4_366 != s1_369)
				{
					if (s9_382 <= 511)
						continue;
					if (s9_382 != s10_370)
					{
						word32 s1_2246;
						word32 a0_2247;
						word32 a1_2248;
						word32 a2_2249;
						word32 a3_2250;
						word32 a4_2251;
						word32 a5_2252;
						word32 a7_2253;
						word32 s2_2254;
						word32 s3_2255;
						word32 s4_2256;
						word32 s5_2257;
						word32 s6_2258;
						word32 s7_2259;
						word32 s8_2260;
						word32 s9_2261;
						word32 s10_2262;
						word32 s11_2263;
						word32 t4_2264;
						printf(ra_1066, &g_t230BF104, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2246, out a0_2247, out a1_2248, out a2_2249, out a3_2250, out a4_2251, out a5_2252, out a7_2253, out s2_2254, out s3_2255, out s4_2256, out s5_2257, out s6_2258, out s7_2259, out s8_2260, out s9_2261, out s10_2262, out s11_2263, out t4_2264);
						while (true)
							;
					}
				}
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 s1_406;
				Eq_2 s2_409;
				Eq_332972 s5_412;
				Eq_2 s9_416;
				word32 a0_2265;
				word32 a1_2266;
				word32 a2_2267;
				word32 a3_2268;
				word32 a4_2269;
				word32 a5_2270;
				word32 a7_2271;
				word32 s3_2272;
				word32 s4_2273;
				word32 s6_2274;
				word32 s7_2275;
				word32 s8_2276;
				word32 s10_2277;
				word32 s11_2278;
				word32 t4_2279;
				Eq_2 ra_405 = printf(ra_1066, &g_t230BF244, dwLoc8C, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_406, out a0_2265, out a1_2266, out a2_2267, out a3_2268, out a4_2269, out a5_2270, out a7_2271, out s2_409, out s3_2272, out s4_2273, out s5_412, out s6_2274, out s7_2275, out s8_2276, out s9_416, out s10_2277, out s11_2278, out t4_2279);
				Eq_2 stackArg72 = <invalid>;
				Eq_2 stackArg168 = <invalid>;
				word32 a3_2282;
				word32 a5_2283;
				word32 a7_2284;
				utils_sha256_update(t1, a1, a2, a3, a5, a7, stackArg72, stackArg168, out a3_2282, out a5_2283, out a7_2284);
				0x00 = (int8) dwLoc010C;
				word32 a5_430;
				word32 s1_434;
				word32 s0_2285;
				word32 a0_2286;
				word32 a1_2287;
				word32 a4_2288;
				word32 s2_2289;
				word32 s3_2290;
				word32 s5_2291;
				word32 s7_2292;
				word32 s6_444;
				ra_1066 = bl_mtd_write(ra_405, s1_406, s5_412, s9_416, dwLoc8C, s2_409, dwLoc0140, dwLoc013C, dwLoc0118, dwLocF4, out s0_2285, out s1_434, out a0_2286, out a1_2287, out a3_1063, out a4_2288, out a5_430, out s2_2289, out s3_2290, out s4_1072, out s5_2291, out s6_444, out s7_2292);
				s0_1051 = dwLoc6C;
				if (s1_434 != a5_430)
					continue;
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg40 = <invalid>;
				Eq_2 stackArg136 = <invalid>;
				utils_sha256_finish(t1, a2, a5, a7, stackArg40, stackArg136);
				word32 a0_2295;
				word32 a1_2296;
				word32 a2_2297;
				word32 a4_2298;
				word32 a5_2299;
				word32 s4_2300;
				word32 s8_2301;
				puts(587985508, out a0_2295, out a1_2296, out a2_2297, out a4_2298, out a5_2299, out s4_2300, out s8_2301);
				do
				{
					word32 s11_492;
					word32 s9_500;
					word32 s1_2302;
					word32 a0_2303;
					word32 a1_2304;
					word32 a2_2305;
					word32 a4_2306;
					word32 a5_2307;
					word32 a7_2308;
					word32 s2_2309;
					word32 s3_2310;
					word32 s4_2311;
					word32 s5_2312;
					word32 s7_2313;
					word32 s8_2314;
					word32 s10_2315;
					word32 t4_2316;
					ra_1066 = printf(ra_1066, s6_444 + 1116, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2302, out a0_2303, out a1_2304, out a2_2305, out a3_1063, out a4_2306, out a5_2307, out a7_2308, out s2_2309, out s3_2310, out s4_2311, out s5_2312, out s6_444, out s7_2313, out s8_2314, out s9_500, out s10_2315, out s11_492, out t4_2316);
				} while (s9_500 != s11_492);
				word32 a0_2317;
				word32 a1_2318;
				word32 a2_2319;
				word32 a4_2320;
				word32 a5_2321;
				word32 s4_2322;
				word32 s8_2323;
				puts(587985540, out a0_2317, out a1_2318, out a2_2319, out a4_2320, out a5_2321, out s4_2322, out s8_2323);
				do
				{
					word32 s11_539;
					word32 s3_541;
					word32 s9_547;
					word32 s1_2324;
					word32 a0_2325;
					word32 a1_2326;
					word32 a2_2327;
					word32 a4_2328;
					word32 a5_2329;
					word32 a7_2330;
					word32 s2_2331;
					word32 s4_2332;
					word32 s5_2333;
					word32 s7_2334;
					word32 s8_2335;
					word32 s10_2336;
					word32 t4_2337;
					ra_1066 = printf(ra_1066, s6_444 + 1116, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2324, out a0_2325, out a1_2326, out a2_2327, out a3_1063, out a4_2328, out a5_2329, out a7_2330, out s2_2331, out s3_541, out s4_2332, out s5_2333, out s6_444, out s7_2334, out s8_2335, out s9_547, out s10_2336, out s11_539, out t4_2337);
				} while (s9_547 != s11_539);
				word32 a0_2338;
				word32 a1_2339;
				word32 a2_2340;
				word32 a4_2341;
				word32 a5_2342;
				word32 s4_2343;
				word32 s8_2344;
				puts(s3_541 + -0x0700, out a0_2338, out a1_2339, out a2_2340, out a4_2341, out a5_2342, out s4_2343, out s8_2344);
				Eq_2 a3_566;
				word32 a1_2345;
				word32 a2_2346;
				word32 a4_2347;
				word32 a5_2348;
				if (memcmp(fp + -0x0114, fp + -308, 32, out a1_2345, out a2_2346, out a3_566, out a4_2347, out a5_2348) != 0x00)
				{
					word32 s1_2349;
					word32 a0_2350;
					word32 a1_2351;
					word32 a3_2352;
					word32 a4_2353;
					word32 a7_2354;
					word32 s2_2355;
					word32 s3_2356;
					word32 s4_2357;
					word32 s5_2358;
					word32 s6_2359;
					word32 s7_2360;
					word32 s8_2361;
					word32 s9_2362;
					word32 s10_2363;
					word32 s11_2364;
					word32 t4_2365;
					printf(ra_1066, &g_t230BF2A4, a3_566, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2349, out a0_2350, out a1_2351, out a2_1114, out a3_2352, out a4_2353, out a5_1111, out a7_2354, out s2_2355, out s3_2356, out s4_2357, out s5_2358, out s6_2359, out s7_2360, out s8_2361, out s9_2362, out s10_2363, out s11_2364, out t4_2365);
					goto l2305AD24;
				}
				Eq_2 a3_577;
				Eq_2 a3_603;
				word32 s1_2366;
				word32 a0_2367;
				word32 a1_2368;
				word32 a2_2369;
				word32 a4_2370;
				word32 a5_2371;
				word32 a7_2372;
				word32 s2_2373;
				word32 s3_2374;
				word32 s4_2375;
				word32 s5_2376;
				word32 s6_2377;
				word32 s7_2378;
				word32 s8_2379;
				word32 s9_2380;
				word32 s10_2381;
				word32 s11_2382;
				word32 t4_2383;
				word32 s1_2384;
				word32 a0_2385;
				word32 a1_2386;
				word32 a2_2387;
				word32 a4_2388;
				word32 a5_2389;
				word32 a7_2390;
				word32 s2_2391;
				word32 s3_2392;
				word32 s4_2393;
				word32 s5_2394;
				word32 s6_2395;
				word32 s7_2396;
				word32 s8_2397;
				word32 s9_2398;
				word32 s10_2399;
				word32 s11_2400;
				word32 t4_2401;
				Eq_2 ra_606 = printf(printf(ra_1066, &g_t230BF2C8, a3_566, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2366, out a0_2367, out a1_2368, out a2_2369, out a3_577, out a4_2370, out a5_2371, out a7_2372, out s2_2373, out s3_2374, out s4_2375, out s5_2376, out s6_2377, out s7_2378, out s8_2379, out s9_2380, out s10_2381, out s11_2382, out t4_2383), &g_t230BF2F4, a3_577, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2384, out a0_2385, out a1_2386, out a2_2387, out a3_603, out a4_2388, out a5_2389, out a7_2390, out s2_2391, out s3_2392, out s4_2393, out s5_2394, out s6_2395, out s7_2396, out s8_2397, out s9_2398, out s10_2399, out s11_2400, out t4_2401);
				hal_boot2_update_ptable(a0);
				word32 s1_2402;
				word32 a0_2403;
				word32 a1_2404;
				word32 a2_2405;
				word32 a4_2406;
				word32 a5_2407;
				word32 a7_2408;
				word32 s2_2409;
				word32 s3_2410;
				word32 s5_2411;
				word32 s6_2412;
				word32 s7_2413;
				word32 s8_2414;
				word32 s9_2415;
				word32 s10_2416;
				word32 s11_2417;
				word32 t4_2418;
				ra_1066 = printf(ra_606, &g_t230BF32C, a3_603, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_2402, out a0_2403, out a1_2404, out a2_2405, out a3_1063, out a4_2406, out a5_2407, out a7_2408, out s2_2409, out s3_2410, out s4_1072, out s5_2411, out s6_2412, out s7_2413, out s8_2414, out s9_2415, out s10_2416, out s11_2417, out t4_2418);
				hal_reboot(mstatus);
				s0_1051 = dwLocEC;
			}
			word32 s1_1965;
			word32 a0_1966;
			word32 a1_1967;
			word32 a3_1968;
			word32 a4_1969;
			word32 a7_1970;
			word32 s2_1971;
			word32 s3_1972;
			word32 s4_1973;
			word32 s5_1974;
			word32 s6_1975;
			word32 s7_1976;
			word32 s8_1977;
			word32 s9_1978;
			word32 s10_1979;
			word32 s11_1980;
			word32 t4_1981;
			printf(ra_1066, &g_t230BF08C, a3_1063, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1965, out a0_1966, out a1_1967, out a2_1114, out a3_1968, out a4_1969, out a5_1111, out a7_1970, out s2_1971, out s3_1972, out s4_1973, out s5_1974, out s6_1975, out s7_1976, out s8_1977, out s9_1978, out s10_1979, out s11_1980, out t4_1981);
l2305AD24:
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg72 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg216 = <invalid>;
			Eq_2 stackArg264 = <invalid>;
			Eq_2 stackArg296 = <invalid>;
			Eq_2 stackArg328 = <invalid>;
			word32 a2_1991;
			word32 a3_1992;
			word32 a4_1993;
			word32 a5_1994;
			word32 s3_1995;
			lwip_close(ra, a0, a2, mstatus, stackArg72, stackArg120, stackArg136, stackArg184, stackArg200, stackArg216, stackArg264, stackArg296, stackArg328, out a2_1991, out a3_1992, out a4_1993, out a5_1994, out s3_1995);
			word32 s0_1996;
			word32 s1_1997;
			word32 a0_1998;
			word32 a1_1999;
			word32 a2_2000;
			word32 a3_2001;
			word32 a4_2002;
			word32 a5_2003;
			word32 a6_2004;
			word32 s4_2005;
			word32 t3_2006;
			vPortFree(s0_1051, a2_1114, a5_1111, mstatus, dwArg08, dwArg48, out s0_1996, out s1_1997, out a0_1998, out a1_1999, out a2_2000, out a3_2001, out a4_2002, out a5_2003, out a6_2004, out s4_2005, out t3_2006);
			utils_sha256_free(a0);
l2305ABBC:
			0x00 = (int8) dwLoc010C;
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg328 = <invalid>;
			Eq_2 stackArg392 = <invalid>;
			bl_mtd_close(a0, a2, a5, mstatus, stackArg328, stackArg392);
			return;
		}
		word32 s1_1928;
		word32 a0_1929;
		word32 a1_1930;
		word32 a3_1931;
		word32 a4_1932;
		word32 a7_1933;
		word32 s2_1934;
		word32 s3_1935;
		word32 s4_1936;
		word32 s5_1937;
		word32 s6_1938;
		word32 s7_1939;
		word32 s8_1940;
		word32 s9_1941;
		word32 s10_1942;
		word32 s11_1943;
		word32 t4_1944;
		printf(ra_304, &g_t230BF078, a3_301, a5_94, dwLoc0128, dwLocE0, dwLocDC, dwLocB8, dwLoc94, out s1_1928, out a0_1929, out a1_1930, out a2_1195, out a3_1931, out a4_1932, out a5_1192, out a7_1933, out s2_1934, out s3_1935, out s4_1936, out s5_1937, out s6_1938, out s7_1939, out s8_1940, out s9_1941, out s10_1942, out s11_1943, out t4_1944);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg72 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg216 = <invalid>;
		Eq_2 stackArg264 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		Eq_2 stackArg328 = <invalid>;
		word32 a2_1954;
		word32 a3_1955;
		word32 a4_1956;
		word32 a5_1957;
		word32 s3_1958;
		lwip_close(ra, a0, a2, mstatus, stackArg72, stackArg120, stackArg136, stackArg184, stackArg200, stackArg216, stackArg264, stackArg296, stackArg328, out a2_1954, out a3_1955, out a4_1956, out a5_1957, out s3_1958);
	}
	word32 a0_1824;
	word32 a1_1825;
	word32 a2_1826;
	word32 a3_1827;
	word32 s4_1831;
	word32 t3_1832;
	word32 a6_1830;
	word32 a4_1828;
	word32 a5_1829;
	word32 s1_1823;
	word32 s0_1822;
	vPortFree(s0_1051, a2_1195, a5_1192, mstatus, dwArg08, dwArg48, out s0_1822, out s1_1823, out a0_1824, out a1_1825, out a2_1826, out a3_1827, out a4_1828, out a5_1829, out a6_1830, out s4_1831, out t3_1832);
	goto l2305ABBC;
}

// 2305AFCC: void ota_tcp_cmd(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_2) a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void ota_tcp_cmd(Eq_2 ra, Eq_2 s0, union Eq_2 * a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	if (a2 == 0x02)
		ota_tcp_cmd.part.0(ra, s0, a3, a3, a4, 0x02, s3, s4, s8, mstatus, dwArg08, dwArg28, dwArg48);
	else
	{
		Eq_2 a3_32 = *a1;
		word32 s1_107;
		word32 a0_108;
		word32 a1_109;
		word32 a2_110;
		word32 a3_111;
		word32 a4_112;
		word32 a5_113;
		word32 a7_114;
		word32 s2_115;
		word32 s3_116;
		word32 s4_117;
		word32 s5_118;
		word32 s6_119;
		word32 s7_120;
		word32 s8_121;
		word32 s9_122;
		word32 s10_123;
		word32 s11_124;
		word32 t4_125;
		printf(ra, &g_t230BF344, a3_32, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_107, out a0_108, out a1_109, out a2_110, out a3_111, out a4_112, out a5_113, out a7_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s7_120, out s8_121, out s9_122, out s10_123, out s11_124, out t4_125);
	}
}

