pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305AFE6: void bl_sys_ota_cli_init()
// Called from:
//      aos_loop_proc
void bl_sys_ota_cli_init()
{
}

// 2305AFEA: void wifiprov_ccc_cfg_changed()
void wifiprov_ccc_cfg_changed()
{
}

// 2305AFEC: void __bl_ble_sync_task(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_333494) a0, Register (ptr32 word32) a5, Register Eq_2 s4, Register Eq_2 s8, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48)
void __bl_ble_sync_task(Eq_2 ra, Eq_2 s0, struct Eq_333494 * a0, word32 * a5, Eq_2 s4, Eq_2 s8, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48)
{
	cJSON_InitHooks(588036748, a5);
	word32 a0_40;
	Eq_2 ra_141 = pro_trans_init(ra, &a0->b061E + 0x00FFF8D2, 588036756, mstatus, dwLoc0108, s8, out a0_40);
	a0->dw040C = a0_40;
	a0->b061E = 0x01;
	union Eq_2 * a0_64;
	word32 s3_485;
	word32 a5_483;
	word32 a3_481;
	word32 s4_486;
	word32 s2_484;
	word32 s1_479;
	word32 a2_480;
	word32 a4_482;
	Eq_2 s0_67 = xQueueGenericCreateStatic(0x01, null, null, (char *) a0 + 4, 0x03, mstatus, s4, out s1_479, out a0_64, out a2_480, out a3_481, out a4_482, out a5_483, out s2_484, out s3_485, out s4_486);
	*a0_64 = (union Eq_2 *) s0_67;
	Eq_2 a0_84;
	word32 s4_491;
	word32 s2_489;
	word32 s1_487;
	word32 s3_490;
	word32 a5_488;
	Eq_2 a4_116;
	Eq_2 a3_117;
	Eq_2 a2_144;
	Eq_2 s0_107 = xQueueGenericCreateStatic(0x02, (struct Eq_123277 *) 260, (word32) s0_67 + 0x0100, (word32) s0_67 + 0x00B0, 0x00, mstatus, s4, out s1_487, out a0_84, out a2_144, out a3_117, out a4_116, out a5_488, out s2_489, out s3_490, out s4_491);
	*((word32) s0_107 + 0x00AC) = a0_84;
	Eq_2 s2_100 = 0x02000000;
	while (true)
	{
		Eq_2 a5_109 = (word32) *((word32) s0_107 + 0x0620);
		if (a5_109 != 0x00)
			break;
		word32 a0_118;
		Eq_2 a3_121;
		word32 s4_497;
		word32 a5_495;
		word32 a2_493;
		word32 s8_498;
		word32 s3_496;
		word32 a4_494;
		word32 a1_492;
		Eq_2 s1_127;
		s0_107 = xQueueReceive(*((word32) s0_107 + 0x00AC), fp + -308, (word32) s2_100 + 1808, a3_117, a4_116, a5_109, mstatus, dwLoc0138, dwLoc011C, dwLoc9C, s8, dwArg18, out s1_127, out a0_118, out a1_492, out a2_493, out a3_121, out a4_494, out a5_495, out s2_100, out s3_496, out s4_497, out s8_498);
		if (a0_118 == 0x01)
		{
			Eq_2 a0_153 = *((word32) s0_107 + 1668);
			if (a0_153 != 0x00)
			{
				word32 a0_154;
				word32 s11_508;
				word32 a4_505;
				word32 s4_507;
				word32 s3_506;
				word32 a3_504;
				ra_141 = bt_gatt_get_mtu(ra_141, a0_153, a3_121, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out a0_154, out a3_504, out a4_505, out s2_100, out s3_506, out s4_507, out s10, out s11_508);
				s1_127 = (word32) (word16) (a0_154 + ~0x02);
			}
			word32 a0_192;
			struct Eq_333707 * s4_196;
			word32 s8_197;
			struct Eq_333709 * s3_206;
			struct Eq_333710 * s5_217;
			word32 s6_218;
			ra_141 = pro_trans_read(ra_141, s1_127, *((word32) s0_107 + 0x040C), fp + -308, dwLoc34, s1_127, s2_100, s10, mstatus, dwLoc0130, dwLoc012C, dwLoc0120, dwLoc011C, dwLoc0110, dwLoc010C, dwLoc0108, dwLoc0104, dwLocF8, dwLocD4, dwLocC4, dwLoc58, dwLoc38, s4, dwArg08, out s0_107, out a0_192, out a2_144, out a3_117, out a4_116, out s2_100, out s3_206, out s4_196, out s5_217, out s6_218, out s8_197, out s10, out mstatus);
			if (a0_192 != 0x00)
			{
				a4_116 = (word32) s3_206->b0650;
				if (a4_116 <= 0x02)
				{
					a4_116 = (word32) s4_196->b0651;
					if (a4_116 <= 0x02)
					{
						if (s5_217->dw0560 != 0x00)
						{
							word32 a5_510;
							xTaskGetTickCountFromISR(out a5_510);
						}
						else
						{
							word32 a5_509;
							xTaskGetTickCount(out a5_509);
						}
						word32 s8_520;
						word32 s6_518;
						word32 s5_517;
						word32 a5_514;
						word32 s1_511;
						word32 s11_522;
						word32 s9_521;
						word32 s7_519;
						word32 s4_516;
						word32 s3_515;
						word32 a1_513;
						word32 a0_512;
						ra_141 = bl_printk(ra_141, s8_197 + 996, s6_218 + 980, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_511, out a0_512, out a1_513, out a2_144, out a3_117, out a4_116, out a5_514, out s2_100, out s3_515, out s4_516, out s5_517, out s6_518, out s7_519, out s8_520, out s9_521, out s10, out s11_522);
					}
				}
			}
		}
		else
			a2_144 = pro_trans_reset(ra_141, *((word32) s0_107 + 0x040C), 0x01, mstatus, dwLoc0140, dwLoc0138, dwLocF0, dwLocEC, dwLocC8, dwLocA4, dwArg08, dwArg48, out a3_117, out a4_116);
	}
	*((word32) s0_107 + 1566) = 0x00;
	word32 a5_502;
	word32 a3_500;
	word32 s2_503;
	word32 a4_501;
	word32 a0_499;
	vTaskDelete(*((word32) s0_107 + 0x00FFFEE8), a2_144, a3_117, a4_116, 0x01000000, mstatus, s4, s0, dwArg28, dwArg38, out a0_499, out a3_500, out a4_501, out a5_502, out s2_503);
}

// 2305B148: void scan_complete_cb(Register Eq_2 a0, Register (ptr32 Eq_333876) a4)
void scan_complete_cb(Eq_2 a0, struct Eq_333876 * a4)
{
	a4->b061F = 0x00;
	Eq_333881 a5_16 = (word32) a4->b1FFF900;
	if (a5_16 <= 49)
	{
		struct Eq_333888 * a5_28;
		word32 a1_82;
		word32 a2_83;
		word32 a3_84;
		word32 a4_85;
		word32 a6_86;
		word32 a7_87;
		memcpy(a4 + ((word32) a5_16.u1 + 0x00FFFFD0) / 0x01FFF901, a0, 48, out a1_82, out a2_83, out a3_84, out a4_85, out a5_28, out a6_86, out a7_87);
		a5_28->b2000900 = (byte) ((word32) a5_28->b1FFF900 + 0x01);
	}
}

// 2305B1A4: void __recv_event(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register (ptr32 byte) a1, Register word32 a3, Register word32 s2, Register word32 s3, Register word32 s4, Register word32 s5, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack word32 dwArgD4, Stack word32 dwArgF0, Stack word32 dwArgF4, Stack word32 dwArg0118, Stack word32 dwArg0138, Stack word32 dwArg0158, Stack word32 dwArg0178)
void __recv_event(Eq_2 ra, Eq_2 s1, word32 a0, byte * a1, word32 a3, word32 s2, word32 s3, word32 s4, word32 s5, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, word32 dwArgD4, word32 dwArgF0, word32 dwArgF4, word32 dwArg0118, word32 dwArg0138, word32 dwArg0158, word32 dwArg0178)
{
	byte * a1_54;
	word32 s1_6 = 0x42026000;
	a1_54 = a1;
	if ((word32) g_b42026650 <= 0x02)
	{
		a1_54 = a1;
		if ((word32) g_b42026651 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_401;
				xTaskGetTickCountFromISR(out a5_401);
			}
			else
			{
				word32 a5_400;
				xTaskGetTickCount(out a5_400);
			}
			word32 s11_418;
			word32 s7_414;
			word32 s10_417;
			word32 s8_415;
			word32 s9_416;
			word32 a2_410;
			word32 s6_413;
			word32 a4_411;
			word32 a5_412;
			ra = bl_printk(ra, &g_t230BF450, 587985876, 0x00, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_6, out a0, out a1_54, out a2_410, out a3, out a4_411, out a5_412, out s2, out s3, out s4, out s5, out s6_413, out s7_414, out s8_415, out s9_416, out s10_417, out s11_418);
		}
	}
	word32 a4_75 = (word32) *a1;
	if (a4_75 != 0x01)
	{
		if (a4_75 != 0x00)
			return;
		Eq_2 s0_77 = *(union Eq_2 *) 0x05;
		if (true)
			return;
		<anonymous> * a5_84 = g_ptr230BF3A0;
		word32 a3_105;
		word32 a0_107;
		word32 a7_111;
		word32 s10_112;
		word32 s11_113;
		word32 s6_114;
		word32 s7_115;
		word32 s9_116;
		word32 t0_117;
		word32 t4_118;
		word32 t1_226;
		word32 t5_227;
		word32 t6_228;
		a5_84();
	}
	else
	{
		Eq_2 a2_132;
		Eq_2 a0_143;
		Eq_2 a1_131;
		if (a3 != 0x02)
		{
			if (a3 != 0x03)
			{
				if (a3 == a4_75)
					return;
				return;
			}
			word32 a0_150;
			word32 a5_409;
			word32 a3_407;
			word32 a4_408;
			word32 t1_406;
			memset(ra, a0 + 0x0642, 0x00, 64, out t1_406, out a0_150, out a1_131, out a2_132, out a3_407, out a4_408, out a5_409);
			a0_143 = a0_150 + 0x0642;
		}
		else
		{
			struct Eq_333976 * a0_130;
			word32 a5_405;
			word32 a3_403;
			word32 a4_404;
			word32 t1_402;
			memset(ra, a0 + 0x0621, 0x00, 32, out t1_402, out a0_130, out a1_131, out a2_132, out a3_403, out a4_404, out a5_405);
			a0_130->b0641 = 0x00;
			a0_143 = (char *) a0_130 + 0x0621;
		}
		word32 a4_422;
		word32 a7_425;
		word32 a5_423;
		word32 a6_424;
		word32 a3_421;
		word32 a1_419;
		word32 a2_420;
		memcpy(a0_143, a1_131, a2_132, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out a6_424, out a7_425);
	}
}

// 2305B624: void wifi_state_get_cb(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
void wifi_state_get_cb(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 s0_7 = g_t4200F4BC;
	Eq_2 a4_14;
	Eq_2 a5_15;
	word32 a1_67;
	word32 a2_68;
	word32 a3_69;
	word32 a6_70;
	word32 a7_71;
	memcpy((word32) s0_7 + 84, a0, 88, out a1_67, out a2_68, out a3_69, out a4_14, out a5_15, out a6_70, out a7_71);
	word32 s1_72;
	word32 a0_73;
	word32 a1_74;
	word32 a2_75;
	word32 a3_76;
	word32 a4_77;
	word32 a5_78;
	word32 a7_79;
	word32 s2_80;
	word32 s3_81;
	word32 s4_82;
	word32 s5_83;
	word32 s6_84;
	word32 s8_85;
	xQueueGenericSend((word32) s0_7 + 84, 0x00, 0x00, a4_14, a5_15, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_72, out a0_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out a7_79, out s2_80, out s3_81, out s4_82, out s5_83, out s6_84, out s8_85);
}

// 2305B652: void write_data(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void write_data(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg2C, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	up32 a3_13 = (word32) g_b42026650;
	*((word32) g_t4200F4BC + 1668) = a0;
	Eq_2 s0_12 = a3;
	Eq_2 s5_147 = a2;
	if (a3_13 <= 0x02 && (word32) g_b42026651 <= 0x02)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_343;
			xTaskGetTickCountFromISR(out a5_343);
		}
		else
		{
			word32 a5_342;
			xTaskGetTickCount(out a5_342);
		}
		word32 s3_71;
		struct Eq_334283 * s4_72;
		struct Eq_334268 * s6_74;
		struct Eq_334261 * s7_75;
		word32 s10_355;
		word32 s11_356;
		word32 s2_352;
		word32 s9_354;
		word32 s8_353;
		word32 a3_349;
		word32 a5_351;
		word32 a4_350;
		word32 s1_346;
		word32 a2_348;
		word32 a1_347;
		Eq_2 ra_66 = bl_printk(ra, &g_t230BF650, 587985876, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_346, out a0, out a1_347, out a2_348, out a3_349, out a4_350, out a5_351, out s2_352, out s3_71, out s4_72, out s5_147, out s6_74, out s7_75, out s8_353, out s9_354, out s10_355, out s11_356);
		if ((word32) s4_72->b0650 <= 0x02 && (word32) s7_75->b0651 <= 0x02)
		{
			if (s6_74->dw0560 != 0x00)
			{
				word32 a5_345;
				xTaskGetTickCountFromISR(out a5_345);
			}
			else
			{
				word32 a5_344;
				xTaskGetTickCount(out a5_344);
			}
			Eq_2 s1_113;
			Eq_2 s10_114;
			Eq_2 s2_116;
			Eq_2 s9_123;
			word32 a3_370;
			word32 s11_369;
			word32 s8_368;
			word32 s7_367;
			word32 s5_365;
			word32 s6_366;
			word32 s3_363;
			word32 s4_364;
			word32 a4_361;
			word32 a5_362;
			word32 a2_359;
			word32 a3_360;
			word32 a0_357;
			word32 a1_358;
			blog_hexdump_out(bl_printk(ra_66, &g_t230BF678, s3_71 + 980, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_113, out a0_357, out a1_358, out a2_359, out a3_360, out a4_361, out a5_362, out s2_116, out s3_363, out s4_364, out s5_365, out s6_366, out s7_367, out s8_368, out s9_123, out s10_114, out s11_369), s1_113, (word32) s2_116 + 968, a3, s2_116, s9_123, s10_114, dwLoc2C, s2, s0, dwLoc10, dwArg2C, dwArg3C, out s0_12, out a0, out a3_370, out s5_147);
		}
	}
	*((word32) a0 + 0x0408) = s0_12;
	Eq_2 a4_165;
	Eq_2 a5_166;
	word32 a7_327;
	word32 a2_324;
	word32 a6_326;
	word32 a3_325;
	word32 a1_323;
	memcpy((word32) a0 + 776, s5_147, s0_12, out a1_323, out a2_324, out a3_325, out a4_165, out a5_166, out a6_326, out a7_327);
	word32 s6_340;
	word32 s8_341;
	word32 s5_339;
	word32 s2_336;
	word32 s4_338;
	word32 s3_337;
	word32 a4_333;
	word32 a7_335;
	word32 a5_334;
	word32 a1_330;
	word32 a3_332;
	word32 a2_331;
	word32 a0_329;
	word32 s1_328;
	xQueueGenericSend(*((word32) a5_166 + 0x00AC), (word32) a5_166 + 776, 0x00, a4_165, a5_166, mstatus, s6, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_328, out a0_329, out a1_330, out a2_331, out a3_332, out a4_333, out a5_334, out a7_335, out s2_336, out s3_337, out s4_338, out s5_339, out s6_340, out s8_341);
	0x00 = (int8) dwArg0128;
}

