pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305B764: void __ble_bytes_send(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register (ptr32 Eq_334378) a5, Register Eq_2 s2, Register Eq_2 s4, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack word32 dwArgA8)
void __ble_bytes_send(Eq_2 ra, Eq_2 a1, Eq_2 a2, struct Eq_334378 * a5, Eq_2 s2, Eq_2 s4, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg3C, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, word32 dwArgA8)
{
	if (a5->dw0684 != 0x00 && a2 <= 0x00FF)
	{
		struct Eq_334398 * a5_32;
		word32 a3_333;
		word32 a2_332;
		word32 a1_331;
		word32 a6_335;
		word32 a7_336;
		word32 a4_334;
		memcpy((char *) a5 + 0x041C, a1, a2, out a1_331, out a2_332, out a3_333, out a4_334, out a5_32, out a6_335, out a7_336);
		Eq_2 a3_149 = (word32) g_b42026650;
		a5_32->w061C = (word16) (word32) (word16) a2;
		if (a3_149 <= 0x02 && (word32) g_b42026651 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_357;
				xTaskGetTickCountFromISR(out a5_357);
			}
			else
			{
				word32 a5_356;
				xTaskGetTickCount(out a5_356);
			}
			word32 s1_84;
			struct Eq_334560 * s2_87;
			struct Eq_334493 * s5_90;
			struct Eq_334486 * s6_91;
			word32 a0_375;
			word32 a1_376;
			word32 a2_377;
			word32 a4_378;
			word32 a5_379;
			word32 s3_380;
			word32 s4_381;
			word32 s7_382;
			word32 s8_383;
			word32 s9_384;
			word32 s10_385;
			word32 s11_386;
			ra = bl_printk(ra, &g_t230BF414, 587985876, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_84, out a0_375, out a1_376, out a2_377, out a3_149, out a4_378, out a5_379, out s2_87, out s3_380, out s4_381, out s5_90, out s6_91, out s7_382, out s8_383, out s9_384, out s10_385, out s11_386);
			if ((word32) s2_87->b0650 <= 0x02 && (word32) s6_91->b0651 <= 0x02)
			{
				if (s5_90->dw0560 != 0x00)
				{
					word32 a5_359;
					xTaskGetTickCountFromISR(out a5_359);
				}
				else
				{
					word32 a5_358;
					xTaskGetTickCount(out a5_358);
				}
				Eq_2 s1_129;
				Eq_2 s10_130;
				Eq_2 s2_132;
				Eq_2 s4_134;
				Eq_2 s9_139;
				word32 a0_360;
				word32 a1_361;
				word32 a2_362;
				word32 a3_363;
				word32 a4_364;
				word32 a5_365;
				word32 s3_366;
				word32 s5_367;
				word32 s6_368;
				word32 s7_369;
				word32 s8_370;
				word32 s11_371;
				word32 s0_372;
				word32 a0_373;
				word32 s5_374;
				ra = blog_hexdump_out(bl_printk(ra, &g_t230BF678, s1_84 + 980, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_129, out a0_360, out a1_361, out a2_362, out a3_363, out a4_364, out a5_365, out s2_132, out s3_366, out s4_134, out s5_367, out s6_368, out s7_369, out s8_370, out s9_139, out s10_130, out s11_371), s1_129, (word32) s1_129 + 968, s4_134, s2_132, s9_139, s10_130, s4, dwLoc10, dwLoc0C, dwArg00, dwArg3C, dwArg4C, out s0_372, out a0_373, out a3_149, out s5_374);
			}
		}
		word32 s11_354;
		word32 t4_355;
		word32 s10_353;
		word32 s9_352;
		word32 s8_351;
		word32 s7_350;
		word32 s6_349;
		word32 s5_348;
		word32 s4_347;
		word32 s3_346;
		word32 s2_345;
		word32 a7_344;
		word32 a4_342;
		word32 a5_343;
		word32 a2_340;
		word32 a3_341;
		word32 a0_338;
		word32 a1_339;
		word32 s1_337;
		printf(ra, &g_b230C6900, a3_149, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_337, out a0_338, out a1_339, out a2_340, out a3_341, out a4_342, out a5_343, out a7_344, out s2_345, out s3_346, out s4_347, out s5_348, out s6_349, out s7_350, out s8_351, out s9_352, out s10_353, out s11_354, out t4_355);
	}
	0x00 = dwArgA8;
}

// 2305B878: void blsync_disconnected(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void blsync_disconnected(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_43;
	word32 a0_44;
	word32 a1_45;
	word32 a2_46;
	word32 a3_47;
	word32 a4_48;
	word32 a5_49;
	word32 a7_50;
	word32 s2_51;
	word32 s3_52;
	word32 s4_53;
	word32 s5_54;
	word32 s6_55;
	word32 s7_56;
	word32 s8_57;
	word32 s9_58;
	word32 s10_59;
	word32 s11_60;
	word32 t4_61;
	printf(ra, &g_t230BF5CC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_43, out a0_44, out a1_45, out a2_46, out a3_47, out a4_48, out a5_49, out a7_50, out s2_51, out s3_52, out s4_53, out s5_54, out s6_55, out s7_56, out s8_57, out s9_58, out s10_59, out s11_60, out t4_61);
	g_t4200F4B8.u0 = 0x00;
}

// 2305B896: void blsync_exchange_func(Register Eq_2 ra, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void blsync_exchange_func(Eq_2 ra, word32 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	word32 a3_55;
	word32 a4_56;
	word32 a2_54;
	word32 a1_53;
	word32 a0_52;
	word32 s1_51;
	word32 a5_57;
	word32 a7_58;
	word32 s2_59;
	word32 s3_60;
	word32 s4_61;
	word32 s5_62;
	word32 s6_63;
	word32 s7_64;
	word32 s8_65;
	word32 s9_66;
	word32 s10_67;
	word32 s11_68;
	word32 t4_69;
	printf(ra, &g_t230BF5EC, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_51, out a0_52, out a1_53, out a2_54, out a3_55, out a4_56, out a5_57, out a7_58, out s2_59, out s3_60, out s4_61, out s5_62, out s6_63, out s7_64, out s8_65, out s9_66, out s10_67, out s11_68, out t4_69);
}

word32 g_dw2305B8AE = 2241012491;
// 2305B8B6: void read_data(Register Eq_2 ra, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void read_data(Eq_2 ra, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	if ((word32) *((word32) g_t4200F4BC + 0x061C) != 0x00)
	{
		Eq_2 a4_25 = (word32) g_b42026650;
		Eq_2 a5_26 = 0x02;
		if (a4_25 <= 0x02)
		{
			a4_25 = (word32) g_b42026651;
			if (a4_25 <= 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_244;
					xTaskGetTickCountFromISR(out a5_244);
				}
				else
				{
					word32 a5_243;
					xTaskGetTickCount(out a5_243);
				}
				word32 s1_245;
				word32 a0_246;
				word32 a1_247;
				word32 a2_248;
				word32 a3_249;
				word32 s2_250;
				word32 s3_251;
				word32 s4_252;
				word32 s5_253;
				word32 s6_254;
				word32 s7_255;
				word32 s8_256;
				word32 s9_257;
				word32 s10_258;
				word32 s11_259;
				bl_printk(ra, &g_t230BF5FC, 587985876, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_245, out a0_246, out a1_247, out a2_248, out a3_249, out a4_25, out a5_26, out s2_250, out s3_251, out s4_252, out s5_253, out s6_254, out s7_255, out s8_256, out s9_257, out s10_258, out s11_259);
			}
		}
		Eq_2 s3_101;
		Eq_232797 s4_102;
		up32 s5_103;
		struct Eq_334735 * a5_95 = pro_trans_ack(*((word32) a5_26 + 0x040C), a4_25, a5_26, mstatus, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s3_101, out s4_102, out s5_103);
		bt_gatt_attr_read(s3_101, s4_102, s5_103, (char *) a5_95 + 0x041C, (word32) a5_95->w061C)->w061C = 0x00;
	}
}

// 2305B974: void blsync_connected(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void blsync_connected(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB0, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	Eq_2 ra_111;
	Eq_2 s1_112;
	Eq_2 a0_103;
	Eq_2 a5_18;
	Eq_2 a3_22;
	Eq_2 a4_23;
	Eq_2 s1_26;
	Eq_2 s2_29;
	Eq_2 s3_30;
	word32 t4_360;
	word32 s11_359;
	word32 s10_358;
	word32 s9_357;
	word32 s8_356;
	word32 s7_355;
	word32 s6_354;
	word32 s5_353;
	word32 a0_348;
	word32 a1_349;
	word32 a2_350;
	word32 a7_351;
	word32 s4_352;
	Eq_2 ra_25 = printf(ra, &g_t230ABB4C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_26, out a0_348, out a1_349, out a2_350, out a3_22, out a4_23, out a5_18, out a7_351, out s2_29, out s3_30, out s4_352, out s5_353, out s6_354, out s7_355, out s8_356, out s9_357, out s10_358, out s11_359, out t4_360);
	g_t4200F4B8 = s1_26;
	word32 a0_46;
	Eq_2 a3_49;
	ptr32 mstatus_54;
	word32 s0_361;
	Eq_2 ra_55 = bt_le_set_data_len(ra_25, s1_26, a3_22, a4_23, a5_18, s2_29, s3_30, mstatus, s0, dwLoc08, dwArg08, dwArg28, dwArg40, dwArg44, dwArg50, dwArg64, dwArg68, ra, dwArg78, dwArg84, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, dwArg0168, out s0_361, out a0_46, out a3_49, out mstatus_54);
	if (a0_46 == 0x00)
	{
		word32 a1_379;
		word32 a2_380;
		word32 a3_381;
		word32 a4_382;
		word32 a5_383;
		word32 a7_384;
		word32 s2_385;
		word32 s3_386;
		word32 s4_387;
		word32 s5_388;
		word32 s6_389;
		word32 s7_390;
		word32 s8_391;
		word32 s9_392;
		word32 s10_393;
		word32 s11_394;
		word32 t4_395;
		ra_111 = printf(ra_55, &g_t230BF54C, a3_49, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_112, out a0_103, out a1_379, out a2_380, out a3_381, out a4_382, out a5_383, out a7_384, out s2_385, out s3_386, out s4_387, out s5_388, out s6_389, out s7_390, out s8_391, out s9_392, out s10_393, out s11_394, out t4_395);
	}
	else
	{
		word32 a3_364;
		word32 a2_363;
		word32 a1_362;
		word32 a4_365;
		word32 a5_366;
		word32 a7_367;
		word32 s2_368;
		word32 s3_369;
		word32 s4_370;
		word32 s5_371;
		word32 s6_372;
		word32 s7_373;
		word32 s8_374;
		word32 s9_375;
		word32 s10_376;
		word32 s11_377;
		word32 t4_378;
		ra_111 = printf(ra_55, &g_t230BF568, a3_49, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_112, out a0_103, out a1_362, out a2_363, out a3_364, out a4_365, out a5_366, out a7_367, out s2_368, out s3_369, out s4_370, out s5_371, out s6_372, out s7_373, out s8_374, out s9_375, out s10_376, out s11_377, out t4_378);
	}
	Eq_2 s0_127 = *a0_103;
	g_dw2305B8AE = 0x42026654;
	word32 a0_138;
	Eq_2 a3_139;
	Eq_2 ra_147 = bt_gatt_exchange_mtu(ra_111, s0_127, s1_112, a0_103, mstatus_54, dwLoc10, s0, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg2C, dwArg30, dwArg34, dwArg38, dwArg48, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB0, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, out a0_138, out a3_139);
	if (a0_138 != 0x00)
	{
		word32 s1_415;
		word32 a0_416;
		word32 a1_417;
		word32 a2_418;
		word32 a3_419;
		word32 a4_420;
		word32 a5_421;
		word32 a7_422;
		word32 s2_423;
		word32 s3_424;
		word32 s4_425;
		word32 s5_426;
		word32 s6_427;
		word32 s7_428;
		word32 s8_429;
		word32 s9_430;
		word32 s10_431;
		word32 s11_432;
		word32 t4_433;
		printf(ra_147, &g_t230BF5A8, a3_139, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_415, out a0_416, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421, out a7_422, out s2_423, out s3_424, out s4_425, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432, out t4_433);
	}
	else
	{
		word32 s1_396;
		word32 a0_397;
		word32 a1_398;
		word32 a2_399;
		word32 a3_400;
		word32 a4_401;
		word32 a5_402;
		word32 a7_403;
		word32 s2_404;
		word32 s3_405;
		word32 s4_406;
		word32 s5_407;
		word32 s6_408;
		word32 s7_409;
		word32 s8_410;
		word32 s9_411;
		word32 s10_412;
		word32 s11_413;
		word32 t4_414;
		printf(ra_147, &g_t230BF58C, a3_139, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_396, out a0_397, out a1_398, out a2_399, out a3_400, out a4_401, out a5_402, out a7_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409, out s8_410, out s9_411, out s10_412, out s11_413, out t4_414);
	}
}

// 2305BA14: Register Eq_2 bl_ble_sync_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a1, Register word32 a2, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out ptr32 mstatusOut)
// Called from:
//      blsync_ble_start
Eq_2 bl_ble_sync_start(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a1, word32 a2, Eq_2 s2, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, ptr32 & mstatusOut)
{
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a3_26;
		word32 a2_335;
		word32 a0_333;
		word32 t1_332;
		word32 a5_336;
		word32 a1_334;
		Eq_2 a4_27;
		Eq_2 ra_29 = memset(ra, a0, 0x00, 0x01FFF908, out t1_332, out a0_333, out a1_334, out a2_335, out a3_26, out a4_27, out a5_336);
		g_t4200F4BC = a0;
		Eq_2 a5_36 = *a4_27;
		*((word32) a0 + 0x0418) = a1;
		*((word32) a0 + 1040) = a2;
		*((word32) a0 + 0x0414) = a3_26;
		*((word32) a0 + 1566) = 0x00;
		*((word32) a0 + 0x0620) = 0x00;
		if (a4_27 == 0x00)
		{
			*(union Eq_2 *) 0x01 = a5_36;
			bt_conn_cb_register(&g_dw4200E0EC, 0x01);
			a4_27.u0 = 0x01;
		}
		Eq_2 sp_87 = <invalid>;
		Eq_2 s0_75;
		word32 a0_106;
		ptr32 s0_110;
		int32 s1_111;
		word32 s1_356;
		word32 a3_357;
		word32 s5_358;
		word32 tp_359;
		word32 t0_360;
		word32 a2_361;
		word32 a3_362;
		word32 a4_363;
		word32 a5_364;
		word32 s2_365;
		word32 s3_366;
		word32 s6_367;
		word32 s7_368;
		ra = xTaskCreateStatic(bt_gatt_service_register(ra_29, a0, a3_26, a4_27, s4, s5, s6, s11, mstatus, dwLoc1C, dwLoc0C, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg48, dwArg50, dwArg58, s1, ra, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArg0108, out s0_75, out s1_356, out a3_357, out s5_358, out mstatus), &g_ptr2305AFEC, 587986248, 0x0200, s0_75, 0x0A, (word32) s0_75 + 0x0688, (word32) s0_75 + 0x00FFFE88, mstatus, *((word32) sp_87 + 4), *((word32) sp_87 + 36), *((word32) sp_87 + 232), *((word32) sp_87 + 436), out tp_359, out t0_360, out s0_110, out s1_111, out a0_106, out a2_361, out a3_362, out a4_363, out a5_364, out s2_365, out s3_366, out s6_367, out s7_368);
		(s0_110 + s1_111)->dw0EE8 = a0_106;
	}
	else if ((word32) g_b42026650 <= 0x02 && (word32) g_b42026651 <= 0x02)
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_338;
			xTaskGetTickCountFromISR(out a5_338);
		}
		else
		{
			word32 a5_337;
			xTaskGetTickCount(out a5_337);
		}
		word32 a5_345;
		word32 s2_346;
		word32 s3_347;
		word32 s4_348;
		word32 s5_349;
		word32 s6_350;
		word32 s7_351;
		word32 s8_352;
		word32 s9_353;
		word32 s10_354;
		word32 s1_339;
		word32 a0_340;
		word32 a2_342;
		word32 a3_343;
		word32 a4_344;
		word32 a1_341;
		word32 s11_355;
		ra = bl_printk(ra, &g_t230BF51C, 587985876, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_339, out a0_340, out a1_341, out a2_342, out a3_343, out a4_344, out a5_345, out s2_346, out s3_347, out s4_348, out s5_349, out s6_350, out s7_351, out s8_352, out s9_353, out s10_354, out s11_355);
	}
	mstatusOut = mstatus;
	return ra;
}

// 2305BB0E: Register Eq_2 bl_ble_sync_stop(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out ptr32 a2Out, Register out Eq_2 a5Out)
// Called from:
//      app_delayed_action_bleadvstop
Eq_2 bl_ble_sync_stop(Eq_2 s1, Eq_2 a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, ptr32 & a2Out, union Eq_2 & a5Out)
{
	if (a0 == 0x00)
	{
		a2Out = a2;
		a5Out = a5;
		return ~0x00;
	}
	Eq_2 a5_121;
	word32 s3_282;
	word32 s5_283;
	word32 s2_281;
	word32 a5_280;
	Eq_2 a3_100;
	Eq_2 a2_20;
	bt_gatt_service_unregister(a0, s1, 587986500, s2, mstatus, dwArg38, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out a2_20, out a3_100, out a5_280, out s2_281, out s3_282, out s5_283);
	*((word32) a0 + 0x0620) = 0x01;
	word32 a5_284;
	Eq_2 a0_42 = xTaskGetCurrentTaskHandle(out a5_284);
	Eq_2 s0_104 = a0;
	Eq_2 a4_101 = 0x01000000;
	Eq_2 a5_102 = *((word32) g_t4200F4BC + 0x00FFFEE8);
	Eq_2 s2_106 = 0x01;
	if (a5_102 != a0_42)
	{
		while (true)
		{
			a5_121 = (word32) *((word32) a5_102 + 0x061F);
			if (a5_121 != s2_106)
			{
				a5_121 = (word32) *((word32) s0_104 + 1566);
				if (a5_121 != s2_106)
					goto l2305BB62;
			}
			word32 s4_298;
			word32 s1_294;
			word32 s3_297;
			word32 a0_295;
			word32 a1_296;
			s0_104 = vTaskDelay(0x0A, a2_20, a3_100, a4_101, a5_121, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_294, out a0_295, out a1_296, out a2_20, out a3_100, out a4_101, out a5_102, out s2_106, out s3_297, out s4_298);
		}
	}
	else
	{
		while (true)
		{
			Eq_2 a5_89 = (word32) *((word32) a5_102 + 0x061F);
			if (a5_89 != s2_106)
				break;
			word32 a0_286;
			word32 s4_289;
			word32 a1_287;
			word32 s3_288;
			word32 s1_285;
			s0_104 = vTaskDelay(0x0A, a2_20, a3_100, a4_101, a5_89, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_285, out a0_286, out a1_287, out a2_20, out a3_100, out a4_101, out a5_102, out s2_106, out s3_288, out s4_289);
		}
		word32 a0_290;
		word32 s2_293;
		word32 a3_291;
		word32 a4_292;
		vTaskDelete(*((word32) s0_104 + 0x00FFFEE8), a2_20, a3_100, a4_101, a5_89, mstatus, dwArg0118, dwArg0128, dwArg0158, dwArg0168, out a0_290, out a3_291, out a4_292, out a5_121, out s2_293);
l2305BB62:
		0x00 = (int8) dwArg38;
		a2Out = dwArg10;
		a5Out = a5_121;
		return 0x00;
	}
}

// 2305BB96: Register Eq_2 __malloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out (ptr32 Eq_335426) a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_335428) a4Out, Register out (ptr32 (ptr32 code)) a5Out, Register out (ptr32 Eq_335430) s2Out, Register out Eq_335431 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      __protocol_send
//      pro_trans_read
Eq_2 __malloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s1Out, struct Eq_335426 & a2Out, ptr32 & a3Out, struct Eq_335428 & a4Out, <anonymous> & a5Out, struct Eq_335430 & s2Out, union Eq_335431 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a0_14;
	word32 a1_153;
	word32 a2_154;
	word32 a6_155;
	word32 s8_156;
	ptr32 s1_117;
	struct Eq_335428 * a4_110;
	<anonymous> ** a5_111;
	ptr32 a3_109;
	struct Eq_335430 * s2_122;
	Eq_335431 s3_123;
	ptr32 s4_124;
	pvPortMalloc(ra, s1, a0, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_117, out a0_14, out a1_153, out a2_154, out a3_109, out a4_110, out a5_111, out a6_155, out s2_122, out s3_123, out s4_124, out s8_156);
	if (a0_14 != 0x00)
	{
		a4_110 = (word32) g_b42026650;
		a5_111 = (<anonymous> **) 0x02;
		if (a4_110 <= (struct Eq_335428 *) 0x02)
		{
			a4_110 = (word32) g_b42026670;
			if (a4_110 <= (struct Eq_335428 *) 0x02)
			{
				if (g_t4200F560 != 0x00)
				{
					word32 a5_158;
					xTaskGetTickCountFromISR(out a5_158);
				}
				else
				{
					word32 a5_157;
					xTaskGetTickCount(out a5_157);
				}
				word32 a0_159;
				word32 a1_160;
				word32 a2_161;
				word32 s7_162;
				word32 s8_163;
				word32 s9_164;
				ra = bl_printk(ra, &g_t230BF6C0, 587986612, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_117, out a0_159, out a1_160, out a2_161, out a3_109, out a4_110, out a5_111, out s2_122, out s3_123, out s4_124, out s5, out s6, out s7_162, out s8_163, out s9_164, out s10, out s11);
			}
		}
	}
	s1Out = s1_117;
	a2Out = dwArg10;
	a3Out = a3_109;
	a4Out = a4_110;
	a5Out = a5_111;
	s2Out = s2_122;
	s3Out = s3_123;
	s4Out = s4_124;
	s5Out = s5;
	s6Out = s6;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

