pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305BBFE: Register word32 __free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      __protocol_send
//      pro_trans_read
//      pro_trans_reset
word32 __free(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	if (a0 != 0x00)
	{
		a5.u0 = 0x02;
		if ((word32) g_b42026650 <= 0x02 && (word32) g_b42026670 <= 0x02)
		{
			if (g_t4200F560 != 0x00)
			{
				word32 a5_137;
				xTaskGetTickCountFromISR(out a5_137);
			}
			else
			{
				word32 a5_136;
				xTaskGetTickCount(out a5_136);
			}
			word32 s1_143;
			word32 a0_144;
			word32 a1_145;
			word32 a2_146;
			word32 a3_147;
			word32 a4_148;
			word32 s2_149;
			word32 s3_150;
			word32 s4_151;
			word32 s5_152;
			word32 s6_153;
			word32 s7_154;
			word32 s8_155;
			word32 s9_156;
			word32 s10_157;
			word32 s11_158;
			bl_printk(ra, &g_t230BF694, 587986612, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_143, out a0_144, out a1_145, out a2_146, out a3_147, out a4_148, out a5, out s2_149, out s3_150, out s4_151, out s5_152, out s6_153, out s7_154, out s8_155, out s9_156, out s10_157, out s11_158);
		}
	}
	ptr32 a3_70;
	ptr32 a4_71;
	ptr32 a5_72;
	ptr32 s1_73;
	ptr32 a0_75;
	word32 s0_78;
	word32 a1_138;
	word32 a2_139;
	word32 a6_140;
	word32 s4_141;
	word32 t3_142;
	vPortFree(a0, dwArg10, a5, mstatus, dwArg0158, dwArg0198, out s0_78, out s1_73, out a0_75, out a1_138, out a2_139, out a3_70, out a4_71, out a5_72, out a6_140, out s4_141, out t3_142);
	s1Out = s1_73;
	a0Out = a0_75;
	a3Out = a3_70;
	a4Out = a4_71;
	a5Out = a5_72;
	return s0_78;
}

// 2305BC64: Register word32 __clear_dev(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out (ptr32 Eq_335639) a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_335642) a4Out, Register out Eq_335643 a5Out)
// Called from:
//      pro_trans_read
//      pro_trans_reset
word32 __clear_dev(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0148, Eq_2 dwArg0188, struct Eq_335639 & a0Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_335642 & a4Out, union Eq_335643 & a5Out)
{
	((word32) a0 + 56)->u0 = 0x00;
	struct Eq_335639 * a0_14;
	ptr32 a3_17;
	struct Eq_335642 * a4_18;
	Eq_335643 a5_19;
	word32 s1_22;
	((word32) __free(ra, *((word32) a0 + 36), a5, mstatus, dwArg00, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArg0148, dwArg0188, out s1_22, out a0_14, out a3_17, out a4_18, out a5_19) + 36)->u0 = 0x00;
	a0Out = a0_14;
	a2Out = dwArg10;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	return s1_22;
}

// 2305BC82: Register Eq_2 __protocol_send(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_335683) a0Out, Register out Eq_335684 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_335683) s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_335689 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      pro_trans_read
Eq_2 __protocol_send(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArgC8, Eq_2 dwArg0108, struct Eq_335683 & a0Out, union Eq_335684 & a5Out, ptr32 & s2Out, struct Eq_335683 & s3Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_335689 & s10Out, ptr32 & mstatusOut)
{
	struct Eq_335691 * sp_160 = fp + -96;
	byte bLoc44_376 = 0x00;
	if (a2 != 0x00)
		bLoc44_376 = 0x08;
	Eq_2 a0_49 = (word32) *((word32) a0 + 60);
	word32 s1_567;
	word32 a3_568;
	word32 a4_569;
	word32 s5_570;
	Eq_335684 a5_335;
	struct Eq_335709 * s11_270;
	Eq_335689 s10_173;
	ui32 s4_146;
	Eq_2 a2_157;
	struct Eq_335683 * s3_151;
	ptr32 s6_108;
	ptr32 s2_111;
	Eq_2 ra_148 = __malloc(ra, s1, a0_49, a3, a4, (word32) bLoc44_376 & 0x0F | 16, mstatus, s10, dwLoc30, dwLoc2C, dwArg00, dwArg04, dwArg1C, dwArg28, ra, dwArgC8, dwArg0108, out s1_567, out a2_157, out a3_568, out a4_569, out a5_335, out s2_111, out s3_151, out s4_146, out s5_570, out s6_108, out s10_173, out s11_270);
	Eq_2 s8_100 = a0_49;
	if (a0_49 != 0x00)
	{
		s10_173.u0 = 0x00;
		ui32 s1_314 = s4_146 & 0x00FF;
		s6_108 = (word32) a0_49 + 6;
		s2_111 = 0x01;
		ptr32 s7_116 = (word32) a0_49 + 4;
		do
		{
			word32 s9_113;
			ptr32 s5_109;
			int32 a7_110;
			sp_160->b001B = 0x04;
			word32 a7_97 = (word32) s11_270->w003C;
			if (s10_173 != 0x00)
			{
				s5_109 = s7_116;
				a7_110 = (int32) (word16) (a7_97 + ~0x03);
				s9_113 = 0x04;
			}
			else
			{
				0x00 = sp_160->dw00E4;
				*((word32) s8_100 + 4) = (byte) s1_314;
				((word32) s8_100 + 5)->u0 = 0x04;
				sp_160->b001B = 0x06;
				s11_270->ptr0000->b0010 = (byte) s2_111;
				s5_109 = s6_108;
				a7_110 = (int32) (word16) (a7_97 + ~0x05);
				s9_113 = 0x06;
			}
			struct Eq_335987 * a5_122 = (word32) sp_160->b001B;
			sp_160->b001B = (byte) ((char *) a5_122 + 1);
			Eq_335689 s4_161;
			struct Eq_335903 * s11_162;
			word32 s0_164;
			word32 s1_165;
			byte * s5_168;
			word32 s7_170;
			word32 s9_172;
			struct Eq_335683 * a0_177;
			word32 t1_417;
			word32 t5_418;
			word32 t6_419;
			Eq_2 a5_178;
			a5_122->ptr0005();
			s11_162->ptr0000->b0010 = 0x00;
			s3_151 = a0_177;
			if (a0_177 < null)
				break;
			word32 a3_194;
			s10_173 = (word32) (word16) ((word32) s10_173.u0 + (a0_177 & 0x00FF));
			if (s10_173 >= s4_161)
			{
				if (s4_161 != s10_173)
				{
					s3_151 = (struct Eq_335683 *) ~0x01;
					break;
				}
				sp_160->w001E = (word16) ((word32) sp_160->w001E | 0xF8000000);
				a3_194 = 0x01;
			}
			else
				a3_194 = 0x00;
			if ((a0_177 & 0x00FF) < s4_161)
				sp_160->b001C = (byte) ((word32) sp_160->b001C | 2);
			sp_160->dw0084 = a3_194;
			word32 a5_218;
			word32 a3_222;
			word32 a7_579;
			word32 a1_575;
			word32 a2_576;
			word32 a4_577;
			word32 a6_578;
			memcpy(s8_100, &sp_160->b001C, 0x02, out a1_575, out a2_576, out a3_222, out a4_577, out a5_218, out a6_578, out a7_579);
			uint32 a4_230 = (word32) sp_160->w001E;
			*((word32) s8_100 + 2) = (byte) a4_230;
			*((word32) s8_100 + 3) = (byte) (a4_230 >> 8);
			word32 s9_240 = (word32) sp_160->b001B + ~0x00 - s9_172;
			*s5_168 = (byte) s9_240;
			<anonymous> * a4_248 = *s11_162->ptr00A4;
			Eq_2 s0_272;
			Eq_2 a3_282;
			Eq_2 a5_286;
			Eq_2 a2_287;
			word32 t1_295;
			word32 t5_296;
			word32 t6_297;
			a4_248();
			Eq_2 a0_299 = s11_270->t0050;
			sp_160->b001D = (byte) ((word32) sp_160->b001D + 0x01);
			word32 a4_303 = (word32) sp_160->w001E;
			sp_160->w001E = (word16) (a4_303 + 0x01);
			ptr32 a0_306;
			word32 a3_309;
			word32 a1_580;
			word32 a2_581;
			word32 a4_582;
			xQueueSemaphoreTake(a0_299, s0_272, a2_287, a3_282, a4_303 + 0x01, a5_286, mstatus, sp_160->t0008, sp_160->t0024, sp_160->t00A4, sp_160->t0118, sp_160->t0158, out s1_314, out a0_306, out a1_580, out a2_581, out a3_309, out a4_582, out a5_178, out s2_111, out s3_151, out s4_146, out s8_100);
			if (a0_306 != s2_111)
			{
				s3_151 = (struct Eq_335683 *) ~0x03;
				break;
			}
			a2_157 = sp_160->t00A4;
		} while (a3_309 == 0x00);
		word32 a3_573;
		word32 a4_574;
		word32 a0_572;
		word32 s1_571;
		__free(ra_148, s8_100, a5_178, mstatus, sp_160->t0010, sp_160->t0018, sp_160->t0060, sp_160->t0064, sp_160->t0088, sp_160->t00AC, sp_160->t0158, sp_160->t0198, out s1_571, out a0_572, out a3_573, out a4_574, out a5_335);
	}
	a0Out = s3_151;
	a5Out = a5_335;
	s2Out = s2_111;
	s3Out = s3_151;
	s5Out = s4;
	s6Out = s6_108;
	s10Out = s10_173;
	mstatusOut = mstatus;
	return dwArg68;
}

