pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305BE3C: Register Eq_2 pro_trans_read(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register int32 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out Eq_2 s0Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_333744 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out Eq_2 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      __bl_ble_sync_task
Eq_2 pro_trans_read(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, int32 a2, Eq_2 a3, Eq_2 s2, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, union Eq_2 & s0Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_333744 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, union Eq_2 & s10Out, ptr32 & mstatusOut)
{
	struct Eq_336034 * sp_188 = fp + -64;
	Eq_2 s2_14 = ~0x01;
	if (a0 == 0x00)
	{
l2305BF08:
		s0Out = s0;
		a0Out = s2_14;
		a2Out = dwArg0138;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2_14;
		s3Out = s3;
		s4Out = dwArgF4;
		s5Out = s5;
		s6Out = s6;
		s8Out = dwArgD4;
		s10Out = s10;
		mstatusOut = mstatus;
		return ra;
	}
	s2_14.u0 = ~0x01;
	if (a1 == 0x00)
		goto l2305BF08;
	*((word32) a0 + 60) = (word16) a3;
	struct Eq_336057 * a4_26;
	word32 a2_935;
	word32 a5_936;
	word32 a6_937;
	word32 a7_938;
	word32 a1_934;
	Eq_2 a3_104;
	memcpy(fp + -52, a1, 0x02, out a1_934, out a2_935, out a3_104, out a4_26, out a5_936, out a6_937, out a7_938);
	s0 = a0;
	Eq_2 a0_114 = fp + -52;
	if (((word32) bLoc34 & 0x01) != 0x00)
	{
		s3 = (word32) bLoc33;
		Eq_333744 a5_42 = (word32) *((word32) a0 + 32);
		if (a5_42 != s3)
		{
			a0_114 = xTaskGetTickCount(out a5_42);
			*((word32) a0_114 + 72) = a0;
			((word32) a0 + 76)->u0 = 0x00;
			*((word32) a0 + 32) = (byte) s3;
		}
		s0 = a4_26->t004C;
		if ((a5_42 | a4_26) != 0x00)
		{
			struct Eq_336190 * a5_55;
			Eq_2 a0_54 = xTaskGetTickCount(out a5_55);
			Eq_2 a4_58 = a0_54 - a4_26;
			Eq_2 a5_435 = 0x00 - a5_55;
			s0 = a5_55->t004C;
			a0_114 = a5_435 - (word32) (a0_54 < a4_58);
			if (a0_114 > 0x00)
			{
l2305BEB4:
				word32 a2_940;
				word32 a4_941;
				word32 a5_942;
				word32 a0_939;
				__clear_dev(ra, s0, a5_435, mstatus, dwLoc40, dwLoc38, dwArg10, dwArg14, dwArg38, ra, dwArg0108, dwArg0148, out a0_939, out a2_940, out a3, out a4_941, out a5_942);
				a4 = (word32) g_b42026650;
				s2_14.u0 = ~0x03;
				if (a4 <= 0x02)
				{
					a4 = (word32) g_b42026670;
					if (a4 <= 0x02)
					{
						if (g_t4200F560 != 0x00)
						{
							word32 a5_944;
							xTaskGetTickCountFromISR(out a5_944);
						}
						else
						{
							word32 a5_943;
							xTaskGetTickCount(out a5_943);
						}
						word32 a0_949;
						word32 a1_950;
						word32 a2_951;
						word32 s4_954;
						word32 s7_955;
						word32 s8_956;
						word32 s9_957;
						word32 s11_958;
						word32 s2_953;
						word32 a5_952;
						word32 s1_948;
						ra = bl_printk(ra, &g_t230BF6E0, 587986612, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_948, out a0_949, out a1_950, out a2_951, out a3, out a4, out a5_952, out s2_953, out s3, out s4_954, out s5, out s6, out s7_955, out s8_956, out s9_957, out s10, out s11_958);
						s2_14.u0 = ~0x03;
					}
				}
				goto l2305BF08;
			}
			if (a0_114 == 0x00)
			{
				a5_435.u0 = 0x02000710;
				if (a4_58 > 0x02000710)
					goto l2305BEB4;
			}
		}
	}
	Eq_2 s1_108;
	Eq_2 a5_106;
	Eq_2 a4_105 = (word32) *((word32) a1 + 2);
	struct Eq_336091 * a2_103 = a2 + -4;
	s3 = (word32) bLoc34 >> 0x04 & 3;
	struct Eq_336099 * s2_131 = (word32) *((word32) a1 + 4);
	if (((word32) *((word32) a1 + 3) << 8 | a4_105) << 0x0011 == 0x00)
	{
		*((word32) s0 + 58) = (word16) ((word32) *((word32) a1 + 5) << 8 | s2_131);
		s2_131 = (word32) *((word32) a1 + 6);
		s1_108 = (word32) a1 + 7;
		a5_106 = (char *) s2_131 + 3;
		if (a2 + -4 != (char *) s2_131 + 3)
			goto l2305BF62;
		Eq_2 s0_94 = s2_131->t0027;
		if (s2_131 != (struct Eq_336099 *) 0x03)
		{
			word32 a0_959;
			s1_108 = __clear_dev(ra, s0_94, (char *) s2_131 + 3, mstatus, dwLoc40, dwLoc38, dwArg10, dwArg14, dwArg38, ra, dwArg0108, dwArg0148, out a0_959, out a2_103, out a3_104, out a4_105, out a5_106);
		}
		a0_114 = (word32) *((word32) s0_94 + 58);
		if (a0_114 != 0x00)
		{
			word32 s11_962;
			word32 s4_961;
			word32 a3_960;
			ra = __malloc(ra, s1_108, a0_114, a3_104, a4_105, a5_106, mstatus, s2, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg3C, dwArg48, dwArg6C, dwArgE8, dwArg0128, out s1_108, out a2_103, out a3_960, out a4_105, out a5_106, out s2_131, out s3, out s4_961, out s5, out s6, out s10, out s11_962);
			*((word32) a0_114 + 36) = s0_94;
			if (a0_114 == 0x00)
				goto l2305BFB4;
		}
		*((word32) a5_106 + 16) = 0x01;
	}
	else
	{
		a5_106 = (char *) s2_131 + 1;
		s1_108 = (word32) a1 + 5;
		if (a2 + -4 != (char *) s2_131 + 1)
			goto l2305BF62;
		s2_131->b0011 = 0x00;
	}
	word32 s0_162 = a2_103->dw0024;
	Eq_2 a3_196;
	word32 a7_204;
	word32 t0_205;
	word32 t1_206;
	word32 t4_207;
	word32 t5_208;
	word32 t6_209;
	word32 tp_211;
	word32 s11_213;
	word32 s7_216;
	word32 s9_217;
	Eq_2 s0_191;
	Eq_2 a5_198;
	(*a5_106)();
	s2_14 = a0_114;
	if (a0_114 != 0x00)
	{
l2305BFA4:
		word32 a2_963;
		word32 a3_964;
		word32 a5_965;
		s1_108 = __clear_dev(ra, s0_191, a5_198, mstatus, sp_188->t0000, sp_188->t0008, sp_188->t0050, sp_188->t0054, sp_188->t0078, sp_188->t009C, sp_188->t0148, sp_188->t0188, out a0_114, out a2_963, out a3_964, out a4_105, out a5_965);
		goto l2305BFB6;
	}
	ui32 a4_222 = (word32) sp_188->t000C;
	Eq_2 a5_224 = (word32) (word16) ((word32) *((word32) s0_191 + 56) + (word32) sp_188->b000A);
	*((word32) s0_191 + 56) = (word16) a5_224;
	if ((a4_222 & 0x02) != 0x00)
	{
		a4_105 = (int32) sp_188->w000E;
		if (a4_105 >= 0x00)
		{
l2305BFB6:
			Eq_2 a5_346 = (word32) sp_188->t000C >> 3 & 0x01;
			if (a5_346 == 0x00)
				ra = __protocol_send(ra, s1_108, *((word32) a4_105 + 64), 0x01, s2_14 & 0x00FF, a4_105, s10, mstatus, sp_188->t0000, sp_188->t0004, sp_188->t001C, sp_188->t0028, sp_188->t00C8, sp_188->t0108, out a0_114, out a5_346, out s2_14, out s3, out s5, out s6, out s10, out mstatus);
			*((word32) *((word32) a0_114 + 64) + 62) = 0x00;
			word32 a5_947;
			word32 a0_946;
			word32 s1_945;
			s0 = __free(ra, a0_114, a5_346, mstatus, sp_188->t0010, sp_188->t0018, sp_188->t0060, sp_188->t0064, sp_188->t0088, sp_188->t00AC, sp_188->t0158, sp_188->t0198, out s1_945, out a0_946, out a3, out a4, out a5_947);
			((word32) s0 + 64)->u0 = 0x00;
			goto l2305BF08;
		}
	}
	if ((word32) *((word32) s0_191 + 58) != a5_224)
	{
		word32 a5_968;
		word32 a3_967;
		word32 a2_966;
		s1_108 = __clear_dev(ra, s0_191, a5_224, mstatus, sp_188->t0000, sp_188->t0008, sp_188->t0050, sp_188->t0054, sp_188->t0078, sp_188->t009C, sp_188->t0148, sp_188->t0188, out a0_114, out a2_966, out a3_967, out a4_105, out a5_968);
l2305BF62:
		s2_14.u0 = ~0x01;
		goto l2305BFB6;
	}
	Eq_2 a4_233 = (word32) sp_188->b000B;
	sp_188->t008C = a5_224;
	Eq_2 a5_235 = *((word32) s0_191 + 0x00A4);
	sp_188->t0088 = a4_233;
	s0_191 = *((word32) a4_233 + 36);
	sp_188->t0010 = (byte) s3;
	sp_188->t000C = a4_233;
	a5_198 = *((word32) a5_235 + 4);
	if (a5_198 == 0x00)
		goto l2305BFA4;
	word32 a2_248;
	word32 a3_249;
	word32 s2_254;
	word32 a5_969;
	word32 s4_970;
	word32 s11_971;
	ra = __malloc(ra, s1_108, 0x0100, a3_196, a4_233, a5_198, mstatus, sp_188->t0018, sp_188->t0030, sp_188->t0034, sp_188->t0060, sp_188->t0064, sp_188->t007C, sp_188->t0088, sp_188->t00AC, sp_188->t0128, sp_188->t0168, out s1_108, out a2_248, out a3_249, out a4_105, out a5_969, out s2_254, out s3, out s4_970, out s5, out s6, out s10, out s11_971);
	*(union Eq_2 *) 0x0140 = s0_191;
	a0_114.u0 = 0x0100;
	if (true)
	{
		<anonymous> * a5_275 = *((word32) *((word32) s0_191 + 0x00A4) + 4);
		Eq_2 a0_282;
		word32 a4_291;
		word32 a7_292;
		word32 t0_293;
		word32 t1_294;
		word32 t4_295;
		word32 t5_296;
		word32 t6_297;
		word32 tp_299;
		word32 s11_301;
		word32 s7_304;
		word32 s9_305;
		a5_275();
		s2_14 = a0_282;
		goto l2305BFA4;
	}
l2305BFB4:
	s2_14.u0 = ~0x02;
	goto l2305BFB6;
}

// 2305C060: Register Eq_2 pro_trans_ack(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      read_data
Eq_2 pro_trans_ack(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 a0_14;
	ptr32 s3_25;
	ptr32 s4_26;
	ptr32 s5_27;
	word32 s8_87;
	word32 s6_86;
	word32 s2_85;
	word32 a7_84;
	word32 a5_83;
	word32 a4_82;
	word32 a3_81;
	word32 a2_80;
	word32 a1_79;
	word32 s1_78;
	xQueueGenericSend(*((word32) a0 + 80), 0x00, 0x00, a4, a5, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1_78, out a0_14, out a1_79, out a2_80, out a3_81, out a4_82, out a5_83, out a7_84, out s2_85, out s3_25, out s4_26, out s5_27, out s6_86, out s8_87);
	s3Out = s3_25;
	s4Out = s4_26;
	s5Out = s5_27;
	return 0x01;
}

// 2305C082: void pro_trans_layer_ack_read(Register word32 a0, Register Eq_2 a1, Register Eq_2 a2)
void pro_trans_layer_ack_read(word32 a0, Eq_2 a1, Eq_2 a2)
{
	if (a0 == 0x00 || a1 == 0x00)
		return;
	if (a2 <= 0x0100)
	{
		Eq_2 a0_19 = *(union Eq_2 *) 320;
		if (true)
		{
			word32 a7_117;
			word32 a6_116;
			word32 a5_115;
			word32 a4_114;
			word32 a3_113;
			word32 a2_112;
			word32 a1_111;
			memcpy(0x0100, a1, a2, out a1_111, out a2_112, out a3_113, out a4_114, out a5_115, out a6_116, out a7_117);
			*((word32) a0_19 + 62) = (word16) a2;
		}
	}
}

// 2305C0C0: Register Eq_2 pro_trans_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out Eq_2 a0Out)
// Called from:
//      __bl_ble_sync_task
Eq_2 pro_trans_init(Eq_2 ra, Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg0118, union Eq_2 & a0Out)
{
	word32 t1_74;
	word32 a0_75;
	word32 a1_76;
	word32 a2_77;
	word32 a3_78;
	word32 a4_79;
	word32 a5_80;
	Eq_2 ra_26 = memset(ra, a0, 0x00, 0x00B0, out t1_74, out a0_75, out a1_76, out a2_77, out a3_78, out a4_79, out a5_80);
	Eq_2 s1_34 = pro_encrypt_init((word32) a0 + 4, (word32) a0 + 4);
	*((word32) a0 + 4) = a0;
	*((word32) a0 + 0x00A4) = a1;
	*((word32) a0 + 0x00A8) = s1_34;
	struct Eq_336751 * a0_45;
	word32 s1_81;
	word32 a2_82;
	word32 a3_83;
	word32 a4_84;
	word32 a5_85;
	word32 s2_86;
	word32 s3_87;
	word32 s4_88;
	Eq_2 s0_48 = xQueueGenericCreateStatic(0x01, null, null, (word32) a0 + 84, 0x03, mstatus, dwArg0118, out s1_81, out a0_45, out a2_82, out a3_83, out a4_84, out a5_85, out s2_86, out s3_87, out s4_88);
	a0_45->t0050 = s0_48;
	0x00 = (int8) dwArg38;
	a0Out = s0_48;
	return ra_26;
}

// 2305C10C: Register word32 pro_trans_reset(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      __bl_ble_sync_task
word32 pro_trans_reset(Eq_2 ra, Eq_2 a0, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 a2_10;
	ptr32 a3_11;
	ptr32 a4_12;
	word32 a0_29;
	word32 a5_30;
	__clear_dev(ra, a0, a5, mstatus, dwArg00, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, dwArg0148, dwArg0188, out a0_29, out a2_10, out a3_11, out a4_12, out a5_30);
	a3Out = a3_11;
	a4Out = a4_12;
	return a2_10;
}

