pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305C110: void __pack_encrypt_read(Register (ptr32 Eq_336795) a0, Register word32 a1, Register word32 a3, Register word32 a4, Register word32 a5, Register word32 a6)
void __pack_encrypt_read(struct Eq_336795 * a0, word32 a1, word32 a3, word32 a4, word32 a5, word32 a6)
{
	word32 a4_11;
	word32 a6_13;
	if ((word32) a0->b0010 != 0x00)
	{
		a4_11 = a5 + 9;
		a6_13 = a6 + ~0x08;
	}
	else
	{
		a4_11 = a5 + 1;
		a6_13 = a6 + ~0x00;
	}
	<anonymous> ** a5_18 = (word32) (a1 != 0x00);
	a0->b000C = (byte) a5_18;
	(*a5_18)();
}

// 2305C142: void __pack_encrypt_write(Register (ptr32 Eq_336828) a0, Register word32 a2, Register (ptr32 Eq_336830) a3, Register (ptr32 byte) a4, Register word32 a5, Register word32 a6, Register word32 a7)
void __pack_encrypt_write(struct Eq_336828 * a0, word32 a2, struct Eq_336830 * a3, byte * a4, word32 a5, word32 a6, word32 a7)
{
	word32 a7_20;
	a3->b0000 = 0x00;
	word32 a7_11 = (word32) (word16) a7;
	if ((word32) a0->b0010 != 0x00)
	{
		a3->b0001 = 0x00;
		a3->b0002 = 0x00;
		a3->b0003 = 0x00;
		a3->b0004 = 0x00;
		a3->b0005 = 0x00;
		a3->b0006 = 0x00;
		a3->b0007 = 0x00;
		a3->b0008 = 0x00;
		*a4 = (byte) ((word32) *a4 + 0x09);
		a7_20 = a7_11 + ~0x08;
	}
	else
	{
		*a4 = (byte) ((word32) *a4 + 0x01);
		a7_20 = a7_11 + ~0x00;
	}
	a0->b000C = 0x01;
	(*(union Eq_2 *) 0x05)();
}

// 2305C1B8: Register (ptr32 Eq_336738) pro_encrypt_init(Register (ptr32 Eq_336737) a0, Register (ptr32 Eq_336738) a1)
// Called from:
//      pro_trans_init
struct Eq_336738 * pro_encrypt_init(struct Eq_336737 * a0, struct Eq_336738 * a1)
{
	pro_payload_init(&a0->ptr0004, &a0->ptr0004);
	a0->ptr0004 = a0;
	a1->ptr0018 = a0;
	g_ptr230CBAB0 = a0;
	return a1;
}

// 2305C1E6: void __payload_write(Register (ptr32 Eq_336927) a0, Register (ptr32 Eq_336928) a1, Register (ptr32 byte) a2, Register word32 a3, Register Eq_2 a4, Register int32 a5, Register int32 a6)
void __payload_write(struct Eq_336927 * a0, struct Eq_336928 * a1, byte * a2, word32 a3, Eq_2 a4, int32 a5, int32 a6)
{
	if (a6 < 0x00)
		return;
	word32 a5_53;
	word32 a6_21 = (word32) (word16) a6;
	if ((word32) a0->b0008 == 0x00)
	{
		int32 a6_55 = a6_21 + ~0x00 << 16;
		int32 a6_56 = a6_55 >> 0x10;
		if (a5 < a6_55 >> 0x10)
			a6_56 = a5;
		if ((a6_56 & 0x00FF) != 0x04)
			return;
		a1->b0000 = (byte) a3;
		word32 a7_180;
		word32 a6_179;
		word32 a5_178;
		word32 a4_177;
		word32 a3_176;
		word32 a2_175;
		word32 a1_174;
		memcpy(&a1->b0001, a4, 0x04, out a1_174, out a2_175, out a3_176, out a4_177, out a5_178, out a6_179, out a7_180);
		a5_53 = (word32) *a2 + 0x05;
	}
	else
	{
		int32 a6_23 = a6_21 + ~0x01 << 16;
		int32 a6_24 = a6_23 >> 0x10;
		if (a5 < a6_23 >> 0x10)
			a6_24 = a5;
		Eq_2 s0_28 = a6_24 & 0x00FF;
		a1->b0000 = (byte) s0_28;
		a1->b0001 = (byte) a3;
		word32 a1_181;
		word32 a2_182;
		word32 a3_183;
		word32 a4_184;
		word32 a5_185;
		word32 a6_186;
		word32 a7_187;
		memcpy(&a1->b0001 + 1, a4, s0_28, out a1_181, out a2_182, out a3_183, out a4_184, out a5_185, out a6_186, out a7_187);
		a5_53 = (word32) s0_28 + ((word32) (*a2) + 0x02);
	}
	*a2 = (byte) a5_53;
}

// 2305C274: void __payload_read(Register (ptr32 Eq_337039) a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register (ptr32 byte) a3, Register (ptr32 Eq_337043) a4, Register word32 a5)
void __payload_read(struct Eq_337039 * a0, Eq_2 a1, byte * a2, byte * a3, struct Eq_337043 * a4, word32 a5)
{
	Eq_2 a2_21;
	Eq_2 a1_18;
	if ((word32) a0->b0008 == 0x00)
	{
		if (a5 != 0x05)
			return;
		*a3 = 0x04;
		*a2 = (byte) (word32) a4->b0000;
		a1_18 = &a4->b0001;
		a2_21 = (word32) *a3;
	}
	else
	{
		if (a5 + ~0x01 != (word32) a4->b0000)
			return;
		*a3 = (byte) (a5 + ~0x01);
		*a2 = (byte) (word32) a4->b0001;
		a1_18 = &a4->b0001 + 1;
		a2_21 = (word32) *a3;
	}
	word32 a1_78;
	word32 a2_79;
	word32 a3_80;
	word32 a4_81;
	word32 a5_82;
	word32 a6_83;
	word32 a7_84;
	memcpy(a1, a1_18, a2_21, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82, out a6_83, out a7_84);
}

// 2305C2CE: void pro_payload_init(Register word32 a0, Register (ptr32 Eq_336915) a1)
// Called from:
//      pro_encrypt_init
void pro_payload_init(word32 a0, struct Eq_336915 * a1)
{
	g_dw230CBAA4 = a0;
	a1->dw0004 = a0;
}

// 2305C2DC: void cmd_sys_time_now(Stack word32 dwArg14)
void cmd_sys_time_now(word32 dwArg14)
{
	ui32 a5_14;
	Eq_2 a1_16;
	ui32 a4_17;
	word32 a0_60;
	word32 a2_61;
	word32 s4_62;
	word32 s8_63;
	puts(587986728, out a0_60, out a1_16, out a2_61, out a4_17, out a5_14, out s4_62, out s8_63);
	Eq_2 a0_23 = bl_sys_time_get(fp + -48, a4_17, a5_14);
	0x00 = dwArg14;
	word32 a1_64;
	word32 a3_65;
	word32 a4_66;
	word32 a5_67;
	utils_time_date_from_epoch(__udivdi3(a0_23, a1_16, 1000, 0x00, out a1_64, out a3_65, out a4_66, out a5_67), fp + -36);
}

// 2305C312: void bl_sys_time_cli_init()
// Called from:
//      aos_loop_proc
void bl_sys_time_cli_init()
{
}

// 2305C316: void bl_sys_time_update(Register uint32 a0, Register Eq_337169 a1)
// Called from:
//      sntp_recv
void bl_sys_time_update(uint32 a0, Eq_337169 a1)
{
	word32 a5_32;
	*xTaskGetTickCount(out a5_32) = 0x4200F4E0;
	g_dw4200F4E4 = 0x00;
	g_dw4200F4C8 = a0;
	g_t4200F4CC = a1;
}

// 2305C34A: Register ptr32 bl_sys_time_get(Register ptr32 a0, Register ui32 a4, Register ui32 a5)
// Called from:
//      cmd_sys_time_now
ptr32 bl_sys_time_get(ptr32 a0, ui32 a4, ui32 a5)
{
	ptr32 a0_16;
	if ((a5 | a4) != 0x00)
	{
		word32 a5_54;
		Eq_2 a0_19 = xTaskGetTickCount(out a5_54);
		ptr32 * a5_24 = a0_19 - g_dw4200F4E0;
		ptr32 * a4_27 = a5_24 + a4;
		*a4_27 = a0;
		Mem32[CONVERT(a4_27 <u a5_24, bool, word32) + ((a5_24 >> 0x1F) + a0_19) + 4:word32] = a0;
		a0_16 = 0x00;
	}
	else
		a0_16 = ~0x00;
	return a0_16;
}

// 2305C39A: Register ptr32 bl_sys_time_sync_state(Register ptr32 a0, Register Eq_2 a4, Register ptr32 mstatus, Stack word32 dwArg38, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out)
// Called from:
//      xTaskIncrementTick
ptr32 bl_sys_time_sync_state(ptr32 a0, Eq_2 a4, ptr32 mstatus, word32 dwArg38, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out)
{
	if (g_dw4200F4D8 == 0x00)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		return ~0x00;
	}
	else
	{
		word32 a5_98;
		Eq_2 a4_21 = vTaskEnterCritical(a4, mstatus, out a5_98);
		word32 a5_99;
		Eq_2 a0_22 = xTaskGetTickCount(out a5_99);
		Eq_2 a3_28;
		word32 a0_25 = bl_rtc_get_timestamp_ms(a4_21, out a3_28);
		word32 a4_100;
		word32 a5_101;
		vTaskExitCritical(a3_28, mstatus, out a4_100, out a5_101);
		Eq_337254 a5_40 = g_t4200F4D4;
		ptr32 a0_42 = 0x00;
		Eq_2 a3_43 = a0_22 - a5_40;
		Eq_2 a4_44 = a0_25 - g_dw4200F4D0;
		if (a3_43 < a4_44)
		{
			Mem47[a5_40 - a0_22 + a4_44:word32] = a0;
			a0_42 = 0x01;
		}
		0x00 = dwArg38;
		a2Out = dwArg10;
		a3Out = a3_43;
		a4Out = a4_44;
		s2Out = a0_22;
		return a0_42;
	}
}

// 2305C3FC: Register (ptr32 Eq_337272) parse_hex4(Register (ptr32 Eq_337272) a0)
// Called from:
//      parse_value
struct Eq_337272 * parse_hex4(struct Eq_337272 * a0)
{
	struct Eq_337272 * a4_14;
	word32 a3_5 = (word32) a0->b0000;
	ui32 a5_15 = a3_5 + -48;
	if ((a3_5 + -48 & 0x00FF) > 0x09)
	{
		if ((a3_5 + -65 & 0x00FF) <= 0x05)
			a5_15 = a3_5 + -55;
		else
		{
			a4_14 = null;
			if ((a3_5 + -97 & 0x00FF) > 0x05)
				return a4_14;
			a5_15 = a3_5 + -87;
		}
	}
	ui32 a5_35;
	word32 a3_19 = (word32) a0->b0001;
	ui32 a5_22 = a5_15 << 4;
	if ((a3_19 + -48 & 0x00FF) <= 0x09)
		a5_35 = a5_22 + (a3_19 + -48);
	else
	{
		word32 a3_31;
		if ((a3_19 + -65 & 0x00FF) <= 0x05)
			a3_31 = a3_19 + -55;
		else
		{
			a4_14 = null;
			if ((a3_19 + -97 & 0x00FF) > 0x05)
				return a4_14;
			a3_31 = a3_19 + -87;
		}
		a5_35 = a5_22 + a3_31;
	}
	ui32 a5_57;
	word32 a3_41 = (word32) a0->b0002;
	ui32 a5_44 = a5_35 << 4;
	if ((a3_41 + -48 & 0x00FF) <= 0x09)
		a5_57 = a5_44 + (a3_41 + -48);
	else
	{
		word32 a3_53;
		if ((a3_41 + -65 & 0x00FF) <= 0x05)
			a3_53 = a3_41 + -55;
		else
		{
			a4_14 = null;
			if ((a3_41 + -97 & 0x00FF) > 0x05)
				return a4_14;
			a3_53 = a3_41 + -87;
		}
		a5_57 = a5_44 + a3_53;
	}
	word32 a0_63 = (word32) a0->b0003;
	ui32 a5_66 = a5_57 << 4;
	word32 a4_67 = a0_63 + -48;
	if ((a0_63 + -48 & 0x00FF) > 0x09)
	{
		if ((a0_63 + -65 & 0x00FF) <= 0x05)
			a4_67 = a0_63 + -55;
		else
		{
			a4_14 = null;
			if ((a0_63 + -97 & 0x00FF) > 0x05)
				return a4_14;
			a4_67 = a0_63 + -87;
		}
	}
	a4_14 = a4_67 + a5_66;
	return a4_14;
}

