pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305C4F6: Register Eq_2 parse_string(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register (ptr32 Eq_337416) s3, Register Eq_2 s4, Register Eq_337418 s5, Register Eq_337419 s6, Register Eq_337420 s7, Register Eq_2 s8, Register ptr32 s9, Register Eq_2 s11, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_337416) s3Out, Register out ptr32 s4Out, Register out Eq_337418 s5Out, Register out Eq_337419 s6Out, Register out Eq_337420 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out Eq_2 s11Out)
// Called from:
//      parse_value
Eq_2 parse_string(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, struct Eq_337416 * s3, Eq_2 s4, Eq_337418 s5, Eq_337419 s6, Eq_337420 s7, Eq_2 s8, ptr32 s9, Eq_2 s11, Eq_2 dwArg010C, ptr32 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out, struct Eq_337416 & s3Out, ptr32 & s4Out, union Eq_337418 & s5Out, union Eq_337419 & s6Out, union Eq_337420 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, union Eq_2 & s11Out)
{
	ptr32 a5_101;
	Eq_2 s9_110;
	if ((word32) *a1 == 0x0022)
	{
		struct Eq_337446 * a5_303 = (word32) a1 + 1;
		word32 a4_38 = 0x00;
		while (true)
		{
			int32 a3_43 = (word32) a5_303->b0000;
			++a4_38;
			if (a3_43 == 0x0022 || a3_43 == 0x00)
				break;
			if (a3_43 != 92)
				a5_303 = &a5_303->b0000 + 1;
			else
				++a5_303;
		}
		<anonymous> * a5_49 = g_ptr4200ECA8;
		struct Eq_337471 * sp_85;
		Eq_2 a0_105;
		word32 a7_109;
		Eq_2 s10_125;
		a5_49();
		dwLoc4C = a0;
		s9_110 = a0_105;
		if (a0_105 != 0x00)
		{
			s11 = a0_105;
			s5.u0 = 92;
			s6.u0 = 110;
			s7.u0 = 117;
			s2.u0 = ~0x0D0007FF;
			s3 = (struct Eq_337416 *) &g_t230CBAAC;
			while (true)
			{
				int32 a4_127 = (word32) *s10_125;
				if (a4_127 == 0x0022 || a4_127 == 0x00)
					break;
				Eq_2 a2_129 = (word32) s10_125 + 1;
				if (a4_127 != 92)
				{
					*s11 = (byte) a4_127;
					s11 = (word32) s11 + 1;
					goto l2305C5F0;
				}
				word32 a5_133;
				Eq_337527 a4_131 = (word32) *((word32) s10_125 + 1);
				if (a4_131 != 110)
				{
					if (a4_131 <= 110)
					{
						word32 a4_227;
						Eq_2 a1_226 = (word32) s11 + 1;
						if (a4_131 != 98)
						{
							if (a4_131 != 0x0066)
								goto l2305C614;
							a4_227 = 0x0C;
						}
						else
							a4_227 = 0x08;
						*s11 = (byte) a4_227;
						s11 = a1_226;
						goto l2305C63A;
					}
					if (a4_131 != 116)
					{
						if (a4_131 != 117)
						{
							if (a4_131 == 114)
								a4_131.u0 = 0x0D;
l2305C614:
							*s11 = (byte) a4_131;
							goto l2305C648;
						}
						Eq_337565 a0_142 = parse_hex4((word32) s10_125 + 2);
						Eq_337565 a7_150 = a0_142;
						a2_129 = (word32) s10_125 + 5;
						if (a0_142 <= 0xF2000001 || a0_142 == 0x00)
							goto l2305C63A;
						struct Eq_337578 * a5_162;
						struct Eq_337579 * a4_158;
						struct Eq_337580 * a1_157;
						struct Eq_337581 * a0_160;
						if (a0_142 <= ~0x0D000BFE)
						{
							if ((word32) *((word32) s10_125 + 6) != 92 || (word32) (*((word32) s10_125 + 7)) != 117)
								goto l2305C63A;
							sp_85->t0084 = a0_142;
							Eq_337565 a0_169 = parse_hex4((word32) s10_125 + 8);
							a2_129 = (word32) s10_125 + 11;
							if (a0_169 > 0xF2000001)
								goto l2305C63A;
							a2_129 = sp_85->t0028;
							a7_150 = (a0_142 << 0x0A & 0x000FFC00 | a0_169 & 0x03FF) + 0x10000000;
							goto l2305C6AA;
						}
						if (a0_142 <= 0x007F)
						{
							a5_162 = (word32) s11 + 1;
							a4_158 = (struct Eq_337579 *) 0x01;
						}
						else
						{
							if (a0_142 > 0x07FF)
							{
								if (a0_142 < 0x10000000)
								{
									a0_160 = (word32) s11 + 3;
									a4_158 = (struct Eq_337579 *) 0x03;
								}
								else
								{
l2305C6AA:
									*((word32) s11 + 3) = (byte) (a7_150 & 63 | -0x0080);
									a0_160 = (word32) s11 + 3;
									a7_150 >>= 0x06;
									a4_158 = (struct Eq_337579 *) 0x04;
								}
								a0_160[0x0FFF] = (struct Eq_337581) (byte) (a7_150 & 63 | -0x0080);
								a1_157 = (struct Eq_337580 *) ((char *) a0_160 - 1);
								a7_150 >>= 0x06;
							}
							else
							{
								a1_157 = (word32) s11 + 2;
								a4_158 = (struct Eq_337579 *) 0x02;
							}
							a1_157[0x0FFF] = (struct Eq_337580) (byte) (a7_150 & 63 | -0x0080);
							a5_162 = (struct Eq_337578 *) ((char *) a1_157 - 1);
							a7_150 >>= 0x06;
						}
						a5_162[0x0FFF] = (struct Eq_337578) (byte) (a7_150 | (word32) a4_158->b230CBAAC);
						s11 = a5_162 + (a4_158 + ~0x00);
						goto l2305C63A;
					}
					a5_133 = 0x09;
				}
				else
					a5_133 = 0x0A;
				*s11 = (byte) a5_133;
l2305C648:
				s11 = (word32) s11 + 1;
l2305C63A:
				a2_129 = (word32) a2_129 + 1;
l2305C5F0:
				s10_125 = a2_129;
			}
			*s11 = 0x00;
			Eq_2 a4_257 = (word32) *s10_125;
			if (a4_257 == 0x0022)
				s10_125 = (word32) s10_125 + 1;
			*(union Eq_2 *) 0x32 = a0_105;
			*(union Eq_2 *) 0x10 = a4_257;
			a5_101 = 0x04;
			s9_110 = s10_125;
		}
	}
	else
	{
		g_t4200F4E8 = a1;
		a5_101 = 0x4200F000;
		s9_110.u0 = 0x00;
	}
	0x00 = (int8) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = s9_110;
	a5Out = a5_101;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg0168;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArg0148;
	s9Out = s9_110;
	s11Out = s11;
	return dwLoc08;
}

// 2305C72C: Register Eq_2 skip(Register Eq_2 a0, Register out (ptr32 Eq_337695) a5Out)
// Called from:
//      parse_value
//      cJSON_Parse
Eq_2 skip(Eq_2 a0, struct Eq_337695 & a5Out)
{
	while (a0 != 0x00)
	{
		a5 = (word32) *a0 + ~0x00 & 0x00FF;
		if (a5 > (struct Eq_337695 *) 0x1F)
			break;
		a0 = (word32) a0 + 1;
	}
	a5Out = a5;
	return a0;
}

// 2305C744: Register Eq_2 cJSON_New_Item(Register Eq_2 ra, Register Eq_2 s0, Register out Eq_337713 a5Out)
// Called from:
//      parse_value
//      cJSON_Parse
//      cJSON_CreateNumber
//      cJSON_CreateString
//      cJSON_CreateObject
Eq_2 cJSON_New_Item(Eq_2 ra, Eq_2 s0, union Eq_337713 & a5Out)
{
	<anonymous> * a5_5 = g_ptr4200ECA8;
	Eq_2 a0_16;
	Eq_337713 a5_13;
	Eq_2 ra_15;
	a5_5();
	if (a0_16 != 0x00)
	{
		word32 t1_56;
		word32 a0_57;
		word32 a1_58;
		word32 a2_59;
		word32 a3_60;
		word32 a4_61;
		ra_15 = memset(ra_15, a0_16, 0x00, 40, out t1_56, out a0_57, out a1_58, out a2_59, out a3_60, out a4_61, out a5_13);
	}
	a5Out = a5_13;
	return ra_15;
}

