pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305C770: Register Eq_2 ensure(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register out (ptr32 Eq_337745) s0Out, Register out (ptr32 Eq_337746) s1Out, Register out (ptr32 Eq_337747) a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_337747) s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      print_number
//      print_string_ptr
//      print_array.isra.4
//      print_object.isra.3
Eq_2 ensure(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a4, Eq_2 a5, Eq_2 s3, struct Eq_337745 & s0Out, struct Eq_337746 & s1Out, struct Eq_337747 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_337747 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_337747 * s2_102 = null;
	if (a0 != 0x00)
	{
		s2_102 = (struct Eq_337747 *) *a0;
		if (s2_102 == null)
			goto l2305C7E6;
		word32 a0_20 = *((word32) a4 + 4);
		a1 += a5;
		if (a4 >= a1)
		{
l2305C792:
			s2_102 += a5;
			goto l2305C7E6;
		}
		int32 s0_25 = (word32) a1 - 1 | (word32) a1 - 1 >> 0x01;
		int32 s0_27 = s0_25 | s0_25 >> 0x02;
		int32 s0_29 = s0_27 | s0_27 >> 0x04;
		int32 s0_31 = s0_29 | s0_29 >> 0x08;
		ui32 s0_33 = s0_31 | s0_31 >> 0x10;
		<anonymous> * a5_35 = g_ptr4200ECA8;
		word32 ra_41;
		word32 s0_42;
		Eq_2 a0_45;
		word32 a4_47;
		Eq_2 a1_48;
		Eq_2 a2_53;
		word32 a7_145;
		word32 a3_146;
		word32 t0_147;
		word32 t1_148;
		word32 t4_149;
		word32 t5_150;
		word32 t6_151;
		a5_35();
		word32 s1_56 = *a1_48;
		if (a0_45 != 0x00)
		{
			word32 a4_59;
			word32 a1_62;
			word32 a2_211;
			word32 a3_212;
			word32 a5_213;
			word32 a6_214;
			word32 a7_215;
			memcpy(a0_45, a1_48, a2_53, out a1_62, out a2_211, out a3_212, out a4_59, out a5_213, out a6_214, out a7_215);
			<anonymous> * a5_72 = g_ptr4200ECA4;
			word32 a7_89;
			word32 a3_90;
			word32 t0_91;
			word32 t1_92;
			word32 t4_93;
			word32 t5_94;
			word32 t6_95;
			a5_72();
			s1 = (struct Eq_337746 *) *((word32) a5 + 8);
			s0->ptr0004 = s1;
			s1->ptr0000 = s2_102;
			goto l2305C792;
		}
		<anonymous> * a5_99 = g_ptr4200ECA4;
		word32 a7_116;
		word32 a3_117;
		word32 t0_118;
		word32 t1_119;
		word32 t4_120;
		word32 t5_121;
		word32 t6_122;
		a5_99();
		s1->dw0004 = 0x00;
		s1->ptr0000 = null;
	}
l2305C7E6:
	s0Out = s0;
	s1Out = s1;
	a0Out = s2_102;
	a1Out = a1;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2_102;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return ra;
}

// 2305C80E: Register Eq_2 cJSON_strdup(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Stack Eq_2 dwArg44, Register out Eq_2 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      cJSON_AddItemToObject
//      cJSON_CreateString
Eq_2 cJSON_strdup(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 dwArg44, union Eq_2 & a0Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a1_87;
	word32 a2_88;
	word32 a3_89;
	word32 a4_90;
	word32 a5_91;
	Eq_2 a0_10 = strlen(a0, out a1_87, out a2_88, out a3_89, out a4_90, out a5_91);
	<anonymous> * a5_17 = g_ptr4200ECA8;
	Eq_2 a0_24;
	Eq_2 a1_31;
	ptr32 a4_30;
	ptr32 a5_25;
	a5_17();
	Eq_2 s0_32 = a0_24;
	if (a0_24 != 0x00)
	{
		word32 a1_92;
		word32 a2_93;
		word32 a3_94;
		word32 a6_95;
		word32 a7_96;
		memcpy(a0_24, a1_31, dwArg44, out a1_92, out a2_93, out a3_94, out a4_30, out a5_25, out a6_95, out a7_96);
		s0_32 = a0;
	}
	a0Out = s0_32;
	a4Out = a4_30;
	a5Out = a5_25;
	return s0_32;
}

// 2305C842: Register Eq_2 update(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      print_array.isra.4
//      print_object.isra.3
Eq_2 update(Eq_2 a0, Eq_2 a4, union Eq_2 & a4Out, ptr32 & a5Out)
{
	Eq_2 s0_12 = 0x00;
	if (a0 != 0x00)
	{
		s0_12.u0 = 0x00;
		if (a4 != 0x00)
		{
			word32 a1_43;
			word32 a2_44;
			word32 a3_45;
			s0_12 = strlen(a4, out a1_43, out a2_44, out a3_45, out a4, out a5);
		}
	}
	a4Out = a4;
	a5Out = a5;
	return s0_12;
}

// 2305C868: void print_number(Register Eq_2 ra, Register word32 s1, Register (ptr32 Eq_337941) a0, Register Eq_2 a1, Register ptr32 fflags, Register ptr32 frm)
void print_number(Eq_2 ra, word32 s1, struct Eq_337941 * a0, Eq_2 a1, ptr32 fflags, ptr32 frm)
{
	Eq_2 s3_17 = a0->t001C;
	Eq_2 s2_18 = a0->t0018;
	struct Eq_337953 * sp_117 = fp + ~0x1F;
	word32 a1_29;
	Eq_2 a4_31;
	Eq_2 a5_32;
	if (__eqdf2(s2_18, s3_17, 0x00, 0x00, fflags, frm, out a1_29, out a4_31, out a5_32) == 0x00)
	{
		Eq_2 a0_416;
		if (a1 != 0x00)
		{
			word32 s4_662;
			word32 s8_663;
			word32 s3_661;
			word32 s2_660;
			word32 a4_658;
			word32 a5_659;
			word32 s0_655;
			word32 s1_656;
			word32 a1_657;
			ensure(ra, a1, 0x02, a4_31, a5_32, s3_17, out s0_655, out s1_656, out a0_416, out a1_657, out a4_658, out a5_659, out s2_660, out s3_661, out s4_662, out s8_663);
		}
		else
		{
			<anonymous> * a5_407 = g_ptr4200ECA8;
			word32 s10_433;
			word32 s11_434;
			word32 s5_435;
			word32 s6_436;
			word32 s7_437;
			word32 s9_438;
			a5_407();
		}
		if (a0_416 != 0x00)
		{
			word32 a4_664;
			word32 a5_665;
			strcpy(a0_416, 587899788, out a4_664, out a5_665);
		}
		return;
	}
	Eq_2 a1_42;
	Eq_2 a1_48;
	word32 a7_654;
	word32 a1_113;
	Eq_2 a5_140;
	Eq_2 a4_141;
	if (__ledf2(__subdf3(ra, __floatsidf(a0->t0014, out a1_42), a1_42, s2_18, s3_17, fflags, frm, out a1_48), fabs(a1_48), g_t230BF7C0, g_t230BF7C4, fflags, frm, out a1_113, out a4_141, out a5_140, out a7_654) <= 0x00)
	{
		word32 a7_666;
		if (__ledf2(s2_18, s3_17, g_t230BF7C8, g_t230BF7CC, fflags, frm, out a1_113, out a4_141, out a5_140, out a7_666) <= 0x00 && __gedf2(s2_18, s3_17, g_t230BF7D0, g_t230BF7D4, fflags, frm, out a1_113, out a4_141, out a5_140) >= 0x00)
		{
			Eq_2 ra_324;
			Eq_2 a0_328;
			if (a1 != 0x00)
			{
				word32 a4_670;
				word32 s4_674;
				word32 s8_675;
				word32 a5_671;
				word32 s2_672;
				word32 s3_673;
				word32 a1_669;
				word32 s1_668;
				word32 s0_667;
				ra_324 = ensure(ra, a1, 0x15, a4_141, a5_140, s3_17, out s0_667, out s1_668, out a0_328, out a1_669, out a4_670, out a5_671, out s2_672, out s3_673, out s4_674, out s8_675);
			}
			else
			{
				<anonymous> * a5_319 = g_ptr4200ECA8;
				word32 s10_345;
				word32 s11_346;
				word32 s5_347;
				word32 s6_348;
				word32 s7_349;
				word32 s9_350;
				a5_319();
			}
			if (a0_328 != 0x00)
			{
				word32 s6_687;
				word32 s7_688;
				word32 s9_690;
				word32 s10_691;
				word32 s11_692;
				word32 s5_686;
				word32 s8_689;
				word32 a0_678;
				word32 s4_685;
				word32 s3_684;
				word32 a5_682;
				word32 s2_683;
				word32 a1_679;
				word32 a2_680;
				word32 a4_681;
				word32 s1_677;
				word32 s0_676;
				sprintf(ra_324, a0_328, &g_t230C7894, sp_117->t0018, sp_117->t0038, sp_117->t0064, sp_117->t0080, sp_117->t0084, sp_117->t00A8, sp_117->t00CC, out s0_676, out s1_677, out a0_678, out a1_679, out a2_680, out a4_681, out a5_682, out s2_683, out s3_684, out s4_685, out s5_686, out s6_687, out s7_688, out s8_689, out s9_690, out s10_691, out s11_692);
			}
			return;
		}
	}
	struct Eq_338072 * s1_121;
	Eq_2 ra_120;
	Eq_2 s3_123;
	Eq_2 s2_122;
	Eq_2 a0_124;
	if (a1 != 0x00)
	{
		word32 s0_693;
		word32 s4_697;
		word32 a5_696;
		word32 a4_695;
		word32 s8_698;
		word32 a1_694;
		ra_120 = ensure(ra, a1, 64, a4_141, a5_140, s3_17, out s0_693, out s1_121, out a0_124, out a1_694, out a4_695, out a5_696, out s2_122, out s3_123, out s4_697, out s8_698);
	}
	else
	{
		<anonymous> * a5_106 = g_ptr4200ECA8;
		word32 s9_496;
		word32 s5_493;
		word32 s6_494;
		word32 s7_495;
		word32 s10_491;
		word32 s11_492;
		a5_106();
	}
	if (a0_124 == 0x00)
		return;
	struct Eq_274 * a1_270;
	Eq_2 a1_182;
	Eq_2 a1_186;
	word32 a4_700;
	word32 a1_699;
	word32 a5_701;
	word32 a7_702;
	if (__ledf2(__subdf3(ra_120, floor(ra_120, s2_122, s3_123, fflags, frm, out a1_182), a1_182, s2_122, s3_123, fflags, frm, out a1_186), fabs(a1_186), s1_121->t07C0, s1_121->t07C4, fflags, frm, out a1_699, out a4_700, out a5_701, out a7_702) <= 0x00)
	{
		word32 a1_707;
		word32 a4_708;
		word32 a5_709;
		word32 a7_710;
		if (__ledf2(s2_122, fabs(s3_123), g_t230BF7D8, g_t230BF7DC, fflags, frm, out a1_707, out a4_708, out a5_709, out a7_710) < 0x00)
		{
			a1_270 = (struct Eq_274 *) &g_t230BF7F0;
			goto l2305C9AC;
		}
	}
	word32 a1_703;
	word32 a4_704;
	word32 a5_705;
	word32 a7_706;
	if (__ledf2(s2_122, fabs(s3_123), g_t230BF7E0, g_t230BF7E4, fflags, frm, out a1_703, out a4_704, out a5_705, out a7_706) >= 0x00)
	{
		word32 a1_711;
		word32 a4_712;
		word32 a5_713;
		if (__gedf2(s2_122, fabs(s3_123), g_t230BF7E8, g_t230BF7EC, fflags, frm, out a1_711, out a4_712, out a5_713) <= 0x00)
		{
			a1_270 = (struct Eq_274 *) &g_t230BF7FC;
l2305C9AC:
			word32 s0_714;
			word32 s1_715;
			word32 a0_716;
			word32 a1_717;
			word32 a2_718;
			word32 a4_719;
			word32 a5_720;
			word32 s2_721;
			word32 s3_722;
			word32 s4_723;
			word32 s5_724;
			word32 s6_725;
			word32 s7_726;
			word32 s8_727;
			word32 s9_728;
			word32 s10_729;
			word32 s11_730;
			sprintf(ra_120, a0_124, a1_270, sp_117->t0018, sp_117->t0038, sp_117->t0064, sp_117->t0080, sp_117->t0084, sp_117->t00A8, sp_117->t00CC, out s0_714, out s1_715, out a0_716, out a1_717, out a2_718, out a4_719, out a5_720, out s2_721, out s3_722, out s4_723, out s5_724, out s6_725, out s7_726, out s8_727, out s9_728, out s10_729, out s11_730);
			return;
		}
	}
	a1_270 = (struct Eq_274 *) &g_t230BF7F8;
	goto l2305C9AC;
}

