pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305CA18: Register Eq_2 print_string_ptr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Stack word32 dwArg1C, Stack word32 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out Eq_338433 a5Out, Register out ptr32 a6Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out, Register out ptr32 s11Out)
// Called from:
//      print_object.isra.3
Eq_2 print_string_ptr(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s10, word32 dwArg1C, word32 dwArg0128, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a4Out, union Eq_338433 & a5Out, ptr32 & a6Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s9Out, union Eq_2 & s10Out, ptr32 & s11Out)
{
	struct Eq_338444 * sp_3 = fp + -48;
	Eq_2 s0_14 = a0;
	Eq_2 a4_100 = 0x00;
	while (true)
	{
		Eq_2 a5_226 = (word32) *s0_14;
		if (a5_226 == 0x00)
			break;
		ui32 a2_41 = 0x01;
		if (((word32) a5_226 - 1 & 0x00FF) > 0x1E && a5_226 != 0x0022)
			a2_41 = (word32) (a5_226 < -93);
		a4_100 |= a2_41;
		s0_14 = (word32) s0_14 + 1;
	}
	Eq_2 ra_113;
	Eq_2 s3_116;
	Eq_2 s2_104;
	Eq_2 a1_108;
	ptr32 a4_110;
	Eq_2 s1_123;
	Eq_338433 a5_111;
	Eq_2 s0_125;
	if (a4_100 == 0x00)
	{
		Eq_2 a0_331;
		Eq_2 s3_321 = s0_14 - a0;
		if (a1 != 0x00)
		{
			word32 s0_814;
			word32 s1_815;
			word32 s4_816;
			word32 s8_817;
			ra_113 = ensure(ra, a1, (word32) s3_321 + 3, a4_100, a5_226, s3_321, out s0_814, out s1_815, out a0_331, out a1_108, out a4_110, out a5_111, out s2_104, out s3_116, out s4_816, out s8_817);
		}
		else
		{
			<anonymous> * a5_324 = g_ptr4200ECA8;
			a5_324();
		}
		s1_123 = a0_331;
		if (a0_331 != 0x00)
		{
			*a0_331 = 0x22;
			Eq_2 s0_379 = (word32) a0_331 + 1;
			s0_125 = s0_379 + s3_116;
			a1_108 = strcpy(s0_379, s2_104, out a4_110, out a5_111);
			*s0_125 = 0x22;
			goto l2305CA76;
		}
	}
	else if (a0 == 0x00)
	{
		Eq_2 a0_267;
		if (a1 != 0x00)
		{
			word32 s4_820;
			word32 s8_821;
			word32 s1_819;
			word32 s0_818;
			ra_113 = ensure(ra, a1, 0x03, a4_100, a5_226, s3, out s0_818, out s1_819, out a0_267, out a1_108, out a4_110, out a5_111, out s2_104, out s3_116, out s4_820, out s8_821);
		}
		else
		{
			<anonymous> * a5_240 = g_ptr4200ECA8;
			a5_240();
		}
		s1_123 = a0_267;
		if (a0_267 != 0x00)
			a1_108 = strcpy(a0_267, 0x230BF800, out a4_110, out a5_111);
	}
	else
	{
		Eq_2 s3_236 = a0;
		word32 s0_232 = 0x00;
		s5.u0 = 0x230C0000;
		s6.u0 = 0x1F;
		while (true)
		{
			Eq_2 s4_60 = (word32) *s3_236;
			if (s4_60 == 0x00)
				break;
			word32 a3_824;
			word32 a2_823;
			word32 a1_822;
			if (strchr(587986948, s4_60, out a1_822, out a2_823, out a3_824, out a4_100, out a5_226) == 0x00)
			{
				if (s4_60 > 0x1F)
					++s0_232;
				else
					s0_232 += 0x06;
			}
			else
				s0_232 += 0x02;
			s3_236 = (word32) s3_236 + 1;
		}
		Eq_2 a0_101;
		Eq_2 a1_62 = s0_232 + 3;
		if (a1 != 0x00)
		{
			word32 s4_827;
			word32 s8_828;
			word32 s0_825;
			word32 s1_826;
			ra_113 = ensure(ra, a1, a1_62, a4_100, a5_226, s3_236, out s0_825, out s1_826, out a0_101, out a1_108, out a4_110, out a5_111, out s2_104, out s3_116, out s4_827, out s8_828);
		}
		else
		{
			<anonymous> * a5_65 = g_ptr4200ECA8;
			a5_65();
		}
		s1_123 = a0_101;
		if (a0_101 != 0x00)
		{
			*a0_101 = 0x22;
			s0_125 = (word32) a0_101 + 1;
			s6.u0 = 0x1F;
			s3_116.u0 = 92;
			s5.u0 = 0x0C;
			s7.u0 = 0x0066;
			word32 s8_131 = 0x230C0000;
			Eq_2 s4_132 = 0x0022;
			s9.u0 = 0x0D;
			s10.u0 = 114;
			while (true)
			{
				Eq_2 a5_137 = (word32) *s2_104;
				if (a5_137 == 0x00)
					break;
				Eq_2 a0_139 = (word32) s0_125 + 1;
				s2_104 = (word32) s2_104 + 1;
				if (s6 < a5_137 && (a5_137 != s4_132 && a5_137 != s3_116))
				{
					*s0_125 = (byte) a5_137;
					goto l2305CB8E;
				}
				*s0_125 = (byte) s3_116;
				Eq_2 a2_148 = (word32) *((word32) s2_104 - 1);
				if (a2_148 != s5)
				{
					if (s5 >= a2_148)
					{
						int32 a5_168;
						if (a2_148 != 0x09)
						{
							if (a2_148 != 0x0A)
							{
								if (a2_148 != 0x08)
									goto l2305CC0A;
								a0_139 = (word32) s0_125 + 2;
								a5_168 = 98;
							}
							else
							{
								a0_139 = (word32) s0_125 + 2;
								a5_168 = 110;
							}
						}
						else
						{
							a0_139 = (word32) s0_125 + 2;
							a5_168 = 116;
						}
						*((word32) s0_125 + 1) = (byte) a5_168;
					}
					else if (a2_148 != s4_132)
					{
						if (a2_148 != s3_116)
						{
							if (a2_148 == s9)
							{
								*((word32) s0_125 + 1) = (byte) s10;
								a0_139 = (word32) s0_125 + 2;
							}
							else
							{
l2305CC0A:
								word32 s0_194;
								word32 a0_829;
								word32 a2_830;
								word32 a5_831;
								ra_113 = sprintf(ra_113, a0_139, s8_131 + -0x07F4, sp_3->t0018, sp_3->t0038, sp_3->t0064, sp_3->t0080, sp_3->t0084, sp_3->t00A8, sp_3->t00CC, out s0_194, out s1_123, out a0_829, out a1_108, out a2_830, out a4_110, out a5_831, out s2_104, out s3_116, out s4_132, out s5, out s6, out s7, out s8_131, out s9, out s10, out s11);
								a0_139 = s0_194 + 6;
							}
						}
						else
						{
							*((word32) s0_125 + 1) = (byte) s3_116;
							a0_139 = (word32) s0_125 + 2;
						}
					}
					else
					{
						*((word32) s0_125 + 1) = (byte) s4_132;
						a0_139 = (word32) s0_125 + 2;
					}
				}
				else
				{
					*((word32) s0_125 + 1) = (byte) s7;
					a0_139 = (word32) s0_125 + 2;
				}
l2305CB8E:
				s0_125 = a0_139;
			}
			*s0_125 = 0x22;
			a5_111.u0 = 0x0022;
l2305CA76:
			*((word32) s0_125 + 1) = 0x00;
			goto l2305CAC8;
		}
	}
l2305CAC8:
	0x00 = dwArg0128;
	0x00 = dwArg1C;
	s1Out = s1_123;
	a0Out = s1_123;
	a1Out = a1_108;
	a4Out = a4_110;
	a5Out = a5_111;
	a6Out = dwArg98;
	s2Out = s2_104;
	s3Out = s3_116;
	s4Out = dwArg78;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra_113;
}

// 2305CC18: Register (ptr32 Eq_338777) cJSON_strcasecmp(Register (ptr32 Eq_338777) a0, Register (ptr32 byte) a1, Register out (ptr32 Eq_338779) a3Out, Register out (ptr32 Eq_338779) a4Out)
// Called from:
//      cJSON_GetObjectItem
struct Eq_338777 * cJSON_strcasecmp(struct Eq_338777 * a0, byte * a1, struct Eq_338779 & a3Out, struct Eq_338779 & a4Out)
{
	struct Eq_338777 * a5_35 = (word32) (a1 != null);
	if (a0 != null)
	{
		a5_35 = (struct Eq_338777 *) 0x01;
		if (a1 != null)
		{
			while (true)
			{
				a3 = (word32) a0->b0000;
				struct Eq_338779 * a5_16 = a3;
				if (((word32) a3->b230CB5B1 & 0x03) == 0x01)
					a5_16 = (struct Eq_338779 *) ((char *) a3 + 32);
				a4 = (word32) *a1;
				if (((word32) a4->b230CB5B1 & 3) == 0x01)
					a4 = (struct Eq_338779 *) ((char *) a4 + 32);
				if (a5_16 != a4)
					break;
				if (a3 == null)
				{
					a5_35 = null;
					goto l2305CC62;
				}
				++a0;
				++a1;
			}
			a5_35 = a5_16 - a4;
		}
	}
l2305CC62:
	a3Out = a3;
	a4Out = a4;
	return a5_35;
}

// 2305CC72: Register Eq_2 parse_value(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register (ptr32 Eq_337416) s3, Register Eq_2 s4, Register Eq_337418 s5, Register Eq_337419 s6, Register Eq_337420 s7, Register Eq_2 s8, Register ptr32 s9, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgCC, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 byte) a0Out, Register out (ptr32 Eq_337416) a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_337416) s3Out, Register out Eq_2 s4Out, Register out Eq_337418 s5Out, Register out Eq_337419 s6Out, Register out Eq_337420 s7Out, Register out Eq_2 s8Out, Register out ptr32 s9Out, Register out Eq_2 s11Out)
// Called from:
//      parse_value
//      cJSON_Parse
Eq_2 parse_value(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, struct Eq_337416 * s3, Eq_2 s4, Eq_337418 s5, Eq_337419 s6, Eq_337420 s7, Eq_2 s8, ptr32 s9, Eq_2 s11, ptr32 fflags, ptr32 frm, Eq_2 dwArgBC, Eq_2 dwArgCC, Eq_2 dwArg010C, Eq_2 dwArg0148, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & s1Out, byte & a0Out, struct Eq_337416 & a5Out, union Eq_2 & s2Out, struct Eq_337416 & s3Out, union Eq_2 & s4Out, union Eq_337418 & s5Out, union Eq_337419 & s6Out, union Eq_337420 & s7Out, union Eq_2 & s8Out, ptr32 & s9Out, union Eq_2 & s11Out)
{
	if (a1 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = null;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s8Out = s8;
		s9Out = s9;
		s11Out = s11;
		return ra;
	}
	struct Eq_337416 * a5_101;
	byte * a0_414;
	Eq_2 s0_180 = a1;
	word32 a3_1409;
	word32 a5_1411;
	word32 a4_1410;
	if (strncmp(a1, 0x230BF7B0, 0x04, out a3_1409, out a4_1410, out a5_1411) == 0x00)
	{
		*(union Eq_2 *) 0x0E = a0;
		a5_101 = (struct Eq_337416 *) 0x02;
		goto l2305CCAE;
	}
	word32 a3_1412;
	word32 a4_1413;
	if (strncmp(a1, 0x230B3194, 0x05, out a3_1412, out a4_1413, out a5_101) == 0x00)
	{
		*((word32) a0 + 0x0C) = 0x00;
		a0_414 = (word32) a1 + 5;
		goto l2305CCCE;
	}
	word32 a3_1414;
	word32 a4_1415;
	word32 a5_1416;
	if (strncmp(a1, 0x230B318C, 0x04, out a3_1414, out a4_1415, out a5_1416) == 0x00)
	{
		*(union Eq_2 *) 0x0D = a0;
		*(union Eq_2 *) 0x15 = a0;
		a5_101 = (struct Eq_337416 *) 0x01;
l2305CCAE:
		a0_414 = (word32) a1 + 4;
		goto l2305CCCE;
	}
	int32 a5_76 = (word32) *a1;
	if (a5_76 == 0x0022)
	{
		0x00 = (int8) dwArg010C;
		byte * a0_821;
		struct Eq_337416 * a5_825;
		Eq_2 s0_828;
		Eq_2 s1_829;
		Eq_2 s4_830;
		Eq_2 s8_831;
		ptr32 s9_832;
		Eq_2 s11_839;
		Eq_2 s2_840;
		struct Eq_337416 * s3_841;
		Eq_337418 s5_842;
		Eq_337419 s6_843;
		Eq_337420 s7_844;
		Eq_2 ra_827 = parse_string(dwLoc08, dwArgCC, dwLoc4C, dwLoc4C, a1, s2, s3, dwArg0168, s5, s6, s7, dwArg0148, s9, s11, dwArg010C, out s0_828, out s1_829, out a0_821, out a5_825, out s2_840, out s3_841, out s4_830, out s5_842, out s6_843, out s7_844, out s8_831, out s9_832, out s11_839);
		s0Out = s0_828;
		s1Out = s1_829;
		a0Out = a0_821;
		a5Out = a5_825;
		s2Out = s2_840;
		s3Out = s3_841;
		s4Out = s4_830;
		s5Out = s5_842;
		s6Out = s6_843;
		s7Out = s7_844;
		s8Out = s8_831;
		s9Out = s9_832;
		s11Out = s11_839;
		return ra_827;
	}
	Eq_2 s5_419;
	Eq_2 s4_418;
	if (a5_76 == 45)
	{
		s4_418 = g_t230BF798;
		s5_419 = g_t230BF79C;
		s0_180 = (word32) a1 + 1;
		goto l2305CD68;
	}
	if ((a5_76 + -48 & 0x00FF) <= 0x09)
	{
		s4_418 = g_t230BF7A0;
		s5_419 = g_t230BF7A4;
l2305CD68:
		if ((word32) *s0_180 == 48)
			s0_180 = (word32) s0_180 + 1;
		Eq_2 ra_445;
		Eq_2 s10_429 = 0x00;
		s11.u0 = 0x00;
		ra_445 = ra;
		if (((word32) *s0_180 + -49 & 0x00FF) <= 0x08)
		{
			Eq_2 s2_434 = g_t230BF7A8;
			Eq_2 s3_435 = g_t230BF7AC;
			ra_445 = ra;
			do
			{
				Eq_2 a0_448;
				Eq_2 a1_449;
				Eq_2 a3_451;
				byte * s0_466;
				uint32 s6_472;
				word32 s9_1420;
				word32 s7_1418;
				word32 s8_1419;
				word32 s1_1417;
				ra_445 = __muldf3(ra_445, s10_429, s11, s2_434, s3_435, fflags, frm, out s0_466, out s1_1417, out a0_448, out a1_449, out a3_451, out s2_434, out s3_435, out s4_418, out s5_419, out s6_472, out s7_1418, out s8_1419, out s9_1420, out fflags, out frm);
				dwLoc4C = a0_448;
				s0_180 = a1_449;
				Eq_2 a1_483;
				Eq_2 a1_489;
				s10_429 = __adddf3(ra_445, __floatsidf((word32) *s0_466 + -48, out a1_483), a1_483, ra, a3_451, fflags, frm, out a1_489);
				s11 = a1_489;
			} while (s6_472 >= ((word32) (*a1_449) + -48 & 0x00FF));
		}
		if ((word32) *s0_180 == 46 && ((word32) (*((word32) s0_180 + 1)) + -48 & 0x00FF) <= 0x09)
		{
			Eq_2 s8_513 = g_t230BF7A8;
			Eq_2 s9_514 = g_t230BF7AC;
			do
			{
				Eq_2 a0_530;
				Eq_2 a1_531;
				Eq_2 a3_533;
				byte * s0_548;
				Eq_2 s2_550;
				Eq_2 s3_551;
				Eq_2 s6_554;
				Eq_2 s7_555;
				word32 s1_1421;
				ra_445 = __muldf3(ra_445, s10_429, s11, s8_513, s9_514, fflags, frm, out s0_548, out s1_1421, out a0_530, out a1_531, out a3_533, out s2_550, out s3_551, out s4_418, out s5_419, out s6_554, out s7_555, out s8_513, out s9_514, out fflags, out frm);
				Eq_2 a1_565;
				Eq_2 a1_571;
				s10_429 = __adddf3(ra_445, __floatsidf((word32) *s0_548 + -48, out a1_565), a1_565, ra, a3_533, fflags, frm, out a1_571);
				word32 a1_1422;
				__subdf3(ra_445, s6_554, s7_555, s2_550, s3_551, fflags, frm, out a1_1422);
				dwLoc4C = a0_530;
				s0_180 = a1_531;
				s11 = a1_571;
			} while (((word32) *a1_531 + -48 & 0x00FF) <= 0x09);
		}
		if (((word32) *s0_180 & 223) != 69)
		{
l2305CEAA:
			Eq_2 a0_688;
			Eq_2 a1_689;
			ptr32 fflags_703;
			ptr32 frm_704;
			word32 s2_708;
			word32 s3_709;
			Eq_2 s6_712;
			Eq_2 s7_713;
			word32 s4_1426;
			word32 s5_1427;
			word32 s9_1429;
			word32 s8_1428;
			word32 s1_1424;
			word32 a3_1425;
			word32 s0_1423;
			Eq_2 ra_705 = __muldf3(ra_445, s10_429, s11, s4_418, s5_419, fflags, frm, out s0_1423, out s1_1424, out a0_688, out a1_689, out a3_1425, out s2_708, out s3_709, out s4_1426, out s5_1427, out s6_712, out s7_713, out s8_1428, out s9_1429, out fflags_703, out frm_704);
			Eq_2 a1_720;
			Eq_2 a1_726;
			ptr32 fflags_746;
			ptr32 frm_747;
			Eq_2 a1_760;
			Eq_2 a0_765;
			Eq_2 a1_766;
			ptr32 fflags_780;
			ptr32 frm_781;
			byte * s0_783;
			Eq_2 s1_784;
			word32 s8_1432;
			word32 a3_1430;
			word32 s4_1431;
			Eq_2 ra_782 = __muldf3(ra_705, a0_688, a1_689, pow(ra_705, g_t230BF7A8, g_t230BF7AC, __adddf3(ra_705, __floatsidf(s2_708 + s3_709, out a1_720), a1_720, s6_712, s7_713, fflags_703, frm_704, out a1_726), a1_726, fflags_703, frm_704, out a1_760, out fflags_746, out frm_747), a1_760, fflags_746, frm_747, out s0_783, out s1_784, out a0_765, out a1_766, out a3_1430, out s2, out s3, out s4_1431, out s5, out s6, out s7, out s8_1432, out s9, out fflags_780, out frm_781);
			*((word32) a0_765 + 24) = s1_784;
			*((word32) a1_766 + 28) = s1_784;
			word32 a5_1436;
			word32 a1_1433;
			word32 a4_1435;
			word32 a3_1434;
			*((word32) __fixdfsi(ra_782, a0_765, a1_766, fflags_780, frm_781, out a1_1433, out a3_1434, out a4_1435, out a5_1436) + 20) = s1_784;
			*(union Eq_2 *) 0x0F = s1_784;
			a5_101 = (struct Eq_337416 *) 0x03;
			a0_414 = s0_783;
			goto l2305CCCE;
		}
		byte * s0_611;
		int32 a5_608 = (word32) *((word32) s0_180 + 1);
		if (a5_608 == 43)
			s0_611 = (word32) s0_180 + 2;
		else
		{
			if (a5_608 == 45)
			{
				s0_611 = (word32) s0_180 + 2;
				goto l2305CE8A;
			}
			s0_611 = (word32) s0_180 + 1;
		}
l2305CE8A:
		while (((word32) *s0_611 + -48 & 0x00FF) <= 0x09)
			++s0_611;
		goto l2305CEAA;
	}
	struct Eq_337416 * a4_283;
	if (a5_76 == 91)
	{
		*(union Eq_2 *) 0x11 = a0;
		word32 a5_1437;
		Eq_2 a0_291 = skip((word32) a1 + 1, out a5_1437);
		a5_101 = (struct Eq_337416 *) 93;
		s0_180 = a0_291;
		if ((word32) *a0_291 == 93)
			goto l2305CF28;
		Eq_2 ra_301 = cJSON_New_Item(ra, a0_291, out a5_101);
		*((word32) a0_291 + 8) = a0;
		s2 = a0_291;
		if (a0_291 != 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg188 = <invalid>;
			Eq_2 stackArg204 = <invalid>;
			Eq_2 stackArg328 = <invalid>;
			Eq_2 stackArg360 = <invalid>;
			Eq_2 a0_314;
			word32 s1_1444;
			word32 a5_1438;
			word32 a5_1445;
			word32 s3_1446;
			word32 s0_1443;
			Eq_2 s4_321;
			Eq_2 s8_325;
			Eq_2 ra_318 = parse_value(ra_301, a0_291, skip(a0_291, out a5_1438), a0_291, s3, s4, s5, s6, s7, s8, s9, s11, fflags, frm, stackArg188, stackArg204, dwArgBC, stackArg328, stackArg360, out s0_1443, out s1_1444, out a0_314, out a5_1445, out s2, out s3_1446, out s4_321, out s5, out s6, out s7, out s8_325, out s9, out s11);
			Eq_2 a0_339 = skip(a0_314, out a5_101);
			s0_180 = a0_339;
			s3 = (struct Eq_337416 *) 44;
			while (a0_339 != 0x00)
			{
				ptr32 fflags_922;
				ptr32 frm_921;
				a5_101 = (word32) *s0_180;
				if (a5_101 != s3)
				{
					a4_283 = (struct Eq_337416 *) 93;
					goto l2305CF88;
				}
				Eq_2 ra_353 = cJSON_New_Item(ra_318, s0_180, out a5_101);
				if (a0_339 == 0x00)
					break;
				*s2 = a0_339;
				*((word32) a0_339 + 4) = s2;
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				// Failed to bind call argument.
				// Please report this issue at https://github.com/uxmal/reko
				Eq_2 stackArg204 = <invalid>;
				Eq_2 stackArg328 = <invalid>;
				Eq_2 stackArg360 = <invalid>;
				Eq_2 a0_378;
				Eq_2 s1_380;
				word32 a5_1461;
				word32 s0_1465;
				word32 s2_1467;
				word32 a5_1466;
				ra_318 = parse_value(ra_353, a0_339, skip((word32) s0_180 + 1, out a5_1461), s2, s3, s4_321, s5, s6, s7, s8_325, s9, s11, fflags_922, frm_921, dwArgBC, stackArg204, dwArgBC, stackArg328, stackArg360, out s0_1465, out s1_380, out a0_378, out a5_1466, out s2_1467, out s3, out s4_321, out s5, out s6, out s7, out s8_325, out s9, out s11);
				a0_339 = skip(a0_378, out a5_101);
				s0_180 = a0_339;
				s2 = s1_380;
				fflags_922 = fflags_931;
				frm_921 = frm_930;
			}
		}
	}
	else if (a5_76 == 0x007B)
	{
		*(union Eq_2 *) 0x12 = a0;
		word32 a5_1447;
		Eq_2 a0_92 = skip((word32) a1 + 1, out a5_1447);
		a5_101 = (struct Eq_337416 *) 0x007D;
		s0_180 = a0_92;
		if ((word32) *a0_92 == 0x007D)
		{
l2305CF28:
			a0_414 = (word32) s0_180 + 1;
			goto l2305CCCE;
		}
		Eq_2 ra_102 = cJSON_New_Item(ra, a0_92, out a5_101);
		*((word32) a0_92 + 8) = a0;
		s2 = a0_92;
		if (a0_92 != 0x00)
		{
			Eq_2 a0_113;
			Eq_2 s4_122;
			Eq_2 s8_123;
			word32 s1_1450;
			word32 a5_1451;
			word32 a5_1448;
			word32 s0_1449;
			Eq_2 ra_119 = parse_string(ra_102, a0_92, a0, a0_92, skip(a0_92, out a5_1448), a0_92, s3, s4, s5, s6, s7, s8, s9, s11, dwArgBC, out s0_1449, out s1_1450, out a0_113, out a5_1451, out s2, out s3, out s4_122, out s5, out s6, out s7, out s8_123, out s9, out s11);
			Eq_2 a0_138 = skip(a0_113, out a5_101);
			if (a0_138 != 0x00)
			{
				Eq_2 a5_140 = *((word32) s2 + 16);
				((word32) s2 + 16)->u0 = 0x00;
				*((word32) s2 + 32) = a5_140;
				if ((word32) *a0_138 != 58)
				{
l2305CFEE:
					g_t4200F4E8 = a0_138;
					a5_101 = (struct Eq_337416 *) &g_t4200F000;
				}
				else
				{
					// Failed to bind call argument.
					// Please report this issue at https://github.com/uxmal/reko
					// Failed to bind call argument.
					// Please report this issue at https://github.com/uxmal/reko
					// Failed to bind call argument.
					// Please report this issue at https://github.com/uxmal/reko
					// Failed to bind call argument.
					// Please report this issue at https://github.com/uxmal/reko
					Eq_2 stackArg188 = <invalid>;
					Eq_2 stackArg204 = <invalid>;
					Eq_2 stackArg328 = <invalid>;
					Eq_2 stackArg360 = <invalid>;
					Eq_2 a0_153;
					word32 s4_1460;
					word32 s0_1457;
					word32 a5_1459;
					word32 s1_1458;
					word32 a5_1452;
					Eq_2 s8_164;
					Eq_2 ra_157 = parse_value(ra_119, s2, skip((word32) a0_138 + 1, out a5_1452), s2, s3, s4_122, s5, s6, s7, s8_123, s9, s11, fflags, frm, stackArg188, stackArg204, dwArgBC, stackArg328, stackArg360, out s0_1457, out s1_1458, out a0_153, out a5_1459, out s2, out s3, out s4_1460, out s5, out s6, out s7, out s8_164, out s9, out s11);
					Eq_2 a0_178 = skip(a0_153, out a5_101);
					s0_180 = a0_178;
					if (a0_178 != 0x00)
					{
						s3 = (struct Eq_337416 *) 44;
						Eq_2 s4_182 = 58;
						do
						{
							ptr32 fflags_907;
							ptr32 frm_906;
							a5_101 = (word32) *s0_180;
							if (a5_101 != s3)
							{
								a4_283 = (struct Eq_337416 *) 0x007D;
l2305CF88:
								if (a5_101 != a4_283)
									goto l2305CF8C;
								goto l2305CF28;
							}
							Eq_2 ra_193 = cJSON_New_Item(ra_157, s0_180, out a5_101);
							if (a0_178 == 0x00)
								break;
							*s2 = a0_178;
							*((word32) a0_178 + 4) = s2;
							Eq_2 a0_215;
							Eq_2 s4_224;
							Eq_2 s8_225;
							word32 s0_1469;
							word32 a5_1471;
							word32 s1_1470;
							word32 a5_1468;
							Eq_2 ra_221 = parse_string(ra_193, s0_180, a0_178, a0_178, skip((word32) s0_180 + 1, out a5_1468), s2, s3, s4_182, s5, s6, s7, s8_164, s9, s11, dwArgBC, out s0_1469, out s1_1470, out a0_215, out a5_1471, out s2, out s3, out s4_224, out s5, out s6, out s7, out s8_225, out s9, out s11);
							a0_138 = skip(a0_215, out a5_101);
							if (a0_138 == 0x00)
								break;
							Eq_2 s1_242 = a5_101->t0010;
							*((word32) s1_242 + 16) = 0x00;
							a5_101->t0020 = s1_242;
							if ((word32) *a0_138 != s4_224)
								goto l2305CFEE;
							// Failed to bind call argument.
							// Please report this issue at https://github.com/uxmal/reko
							// Failed to bind call argument.
							// Please report this issue at https://github.com/uxmal/reko
							// Failed to bind call argument.
							// Please report this issue at https://github.com/uxmal/reko
							Eq_2 stackArg204 = <invalid>;
							Eq_2 stackArg328 = <invalid>;
							Eq_2 stackArg360 = <invalid>;
							Eq_2 a0_254;
							Eq_2 s1_256;
							word32 a5_1477;
							word32 s2_1478;
							word32 s0_1476;
							word32 a5_1472;
							ra_157 = parse_value(ra_221, s1_242, skip((word32) a0_138 + 1, out a5_1472), s2, s3, s4_224, s5, s6, s7, s8_225, s9, s11, fflags_907, frm_906, dwArgBC, stackArg204, dwArgBC, stackArg328, stackArg360, out s0_1476, out s1_256, out a0_254, out a5_1477, out s2_1478, out s3, out s4_182, out s5, out s6, out s7, out s8_164, out s9, out s11);
							a0_178 = skip(a0_254, out a5_101);
							s0_180 = a0_178;
							s2 = s1_256;
							frm_906 = frm_915;
							fflags_907 = fflags_916;
						} while (a0_178 != 0x00);
					}
				}
			}
		}
	}
	else
	{
l2305CF8C:
		g_t4200F4E8 = s0_180;
		a5_101 = (struct Eq_337416 *) &g_t4200F000;
	}
	a0_414 = null;
l2305CCCE:
	0x00 = (int8) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = a0_414;
	a5Out = a5_101;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg0168;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArg0148;
	s9Out = s9;
	s11Out = s11;
	return dwLoc08;
}

