pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305D074: void print_array.isra.4(Register Eq_2 ra, Register (ptr32 Eq_339651) s0, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register word32 s4, Register word32 s7, Register word32 s8, Register word32 s9, Register ptr32 s10, Register word32 s11, Stack word32 dwArg010C)
void print_array.isra.4(Eq_2 ra, struct Eq_339651 * s0, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, word32 s4, word32 s7, word32 s8, word32 s9, ptr32 s10, word32 s11, word32 dwArg010C)
{
	struct Eq_339651 * a0_30 = s0->ptr0000;
	Eq_2 s3_38 = 0x00;
	for (; s0 != null; s0 = s0->ptr0000)
		s3_38 = (word32) s3_38 + 1;
	if (s3_38 == 0x00)
	{
		Eq_2 a0_595;
		if (a3 != 0x00)
		{
			word32 s0_967;
			word32 a5_971;
			word32 s2_972;
			word32 s3_973;
			word32 s4_974;
			word32 s8_975;
			word32 s1_968;
			word32 a4_970;
			word32 a1_969;
			ensure(ra, a3, 0x03, a4, a5, s3_38, out s0_967, out s1_968, out a0_595, out a1_969, out a4_970, out a5_971, out s2_972, out s3_973, out s4_974, out s8_975);
		}
		else
		{
			<anonymous> * a5_578 = g_ptr4200ECA8;
			a5_578();
		}
		if (a0_595 != 0x00)
		{
			word32 a4_976;
			word32 a5_977;
			strcpy(a0_595, 587986872, out a4_976, out a5_977);
		}
		goto l2305D0BC;
	}
	if (a3 != 0x00)
	{
		byte * a0_444;
		struct Eq_339780 ** s2_447;
		word32 a5_981;
		word32 s3_982;
		word32 s8_984;
		word32 s4_983;
		word32 s1_979;
		word32 a1_980;
		word32 s0_978;
		Eq_2 a4_453;
		Eq_2 ra_456 = ensure(ra, a3, 0x01, a4, a5, s3_38, out s0_978, out s1_979, out a0_444, out a1_980, out a4_453, out a5_981, out s2_447, out s3_982, out s4_983, out s8_984);
		if (a0_444 != null)
		{
			*a0_444 = 0x5B;
			word32 s3_468 = (word32) (a2 != 0x00);
			Eq_2 s1_467 = *(union Eq_2 *) 99;
			*(union Eq_2 *) 100 = s1_467;
			Eq_2 s3_469 = s3_468 + 0x01;
			Eq_2 a5_470 = 0x5C;
			struct Eq_339780 * s2_472;
			for (s2_472 = *s2_447; s2_472 != null; s2_472 = s2_472->dw0000)
			{
				Eq_2 a4_490;
				word32 s0_985;
				word32 a0_986;
				word32 a2_987;
				word32 a3_988;
				word32 a5_989;
				ra_456 = print_value(ra_456, s2_472, s1_467, s10, out s0_985, out a0_986, out a2_987, out a3_988, out a4_490, out a5_989);
				word32 a5_990;
				update(s1_467, a4_490, out a4_453, out a5_990)->t0008 = s1_467;
				a5_470 = s2_472->dw0000;
				if (a5_470 != 0x00)
				{
					struct Eq_340067 * a0_508;
					word32 s8_513;
					word32 s0_1013;
					word32 s1_1014;
					word32 a1_1015;
					word32 a5_1016;
					word32 s4_1017;
					ra_456 = ensure(ra_456, s1_467, s3_468 + 0x02, a4_453, a5_470, s3_469, out s0_1013, out s1_1014, out a0_508, out a1_1015, out a4_453, out a5_1016, out s2_472, out s3_469, out s4_1017, out s8_513);
					if (a0_508 == null)
						goto l2305D0BC;
					a0_508->b0000 = (byte) s8_513;
					struct Eq_340094 * a5_530 = &a0_508->b0001;
					if (a2 != 0x00)
					{
						a0_508->b0001 = 0x20;
						a5_530 = (struct Eq_340094 *) (&a0_508->b0001 + 1);
					}
					a5_530->b0000 = 0x00;
					s1_467 = a5_530[4];
					a5_470 = a5_530 + s3_469;
					*((word32) a5_470 + 8) = s1_467;
				}
			}
			struct Eq_339823 * a0_551;
			word32 a5_995;
			word32 s8_999;
			word32 s2_996;
			word32 s4_998;
			word32 s3_997;
			word32 a1_993;
			word32 a4_994;
			word32 s0_991;
			word32 s1_992;
			ensure(ra_456, s1_467, 0x02, a4_453, a5_470, s3_469, out s0_991, out s1_992, out a0_551, out a1_993, out a4_994, out a5_995, out s2_996, out s3_997, out s4_998, out s8_999);
			if (a0_551 != null)
			{
				a0_551->b0000 = 0x5D;
				a0_551->b0001 = 0x00;
			}
		}
		goto l2305D0BC;
	}
	ui32 a2_47 = s3_38 << 0x02;
	struct Eq_339722 * sp_63;
	struct Eq_339780 ** s2_65;
	word32 s6_68;
	Eq_2 ra_69;
	Eq_2 a0_77;
	word32 a5_85;
	word32 s3_130;
	word32 s5_131;
	word32 s11_140;
	g_ptr4200ECA8();
	Eq_2 s4_135 = a0_77;
	if (a0_77 == 0x00)
		goto l2305D0BC;
	word32 t1_1000;
	word32 a4_1001;
	<anonymous> * a5_109;
	Eq_2 a0_141;
	word32 a1_123;
	word32 a2_124;
	word32 a3_125;
	Eq_2 ra_117 = memset(ra_69, a0_77, 0x00, sp_63->t0084, out t1_1000, out a0_141, out a1_123, out a2_124, out a3_125, out a4_1001, out a5_109);
	word32 s10_90 = (word32) (s5_131 != 0x00);
	Eq_2 s7_100 = a0_77;
	struct Eq_339780 * s8_101;
	Eq_2 s9_102 = a0_77;
	word32 s2_103 = 0x00;
	word32 s0_104 = 0x05;
	word32 s6_105 = s6_68 + 0x01;
	word32 s10_106 = s10_90 + 0x02;
	for (s8_101 = *s2_65; s8_101 != null; s8_101 = s8_101->dw0000)
	{
		if (s2_103 != 0x00)
			goto l2305D1CA;
		word32 a4_1002;
		ra_117 = print_value(ra_117, s8_101, 0x00, sp_63->ptr0010, out s0_104, out a0_141, out a2_124, out a3_125, out a4_1002, out a5_109);
		*s9_102 = a0_141;
		a1_123 = s6_68 + 0x01;
		if (a0_141 != 0x00)
		{
			word32 a4_1003;
			a0_141 = strlen(a0_141, out a1_123, out a2_124, out a3_125, out a4_1003, out a5_109);
			s0_104 = (word32) a0_141 + (s0_104 + (s10_90 + 0x02));
		}
		else
			s2_103 = 0x01;
		s9_102 = (word32) s9_102 + 4;
	}
	if (s2_103 == 0x00)
	{
		word32 a5_149;
		word32 a4_150;
		a5_109();
		Eq_2 s0_152 = a0_141;
		if (a0_141 != 0x00)
		{
			*a0_141 = 0x5B;
			*((word32) a0_141 + 1) = 0x00;
			Eq_2 s1_155 = (word32) a0_141 + 1;
			word32 s9_157 = s3_130 + -1;
			int32 s10_158 = 44;
			int32 s11_159 = 32;
			word32 s8_160 = 0x4200F000;
			do
			{
				word32 a4_1007;
				word32 a5_1008;
				word32 a1_1004;
				word32 a2_1005;
				word32 a3_1006;
				Eq_2 a0_164 = strlen(*s7_100, out a1_1004, out a2_1005, out a3_1006, out a4_1007, out a5_1008);
				word32 a1_178;
				word32 a2_179;
				word32 a3_180;
				word32 a4_1009;
				word32 a5_1010;
				word32 a7_1012;
				word32 a6_1011;
				memcpy(s1_155, *s7_100, a0_164, out a1_178, out a2_179, out a3_180, out a4_1009, out a5_1010, out a6_1011, out a7_1012);
				word32 s1_188 = s1_155 + a0_164;
				if (s9_157 != s2_103)
				{
					s1_188->b0000 = (byte) s10_158;
					if (s5_131 == 0x00)
						s1_188 = (struct Eq_339991 *) &s1_188->b0001;
					else
					{
						s1_188->b0001 = (byte) s11_159;
						s1_188 = &s1_188->b0001 + 1;
					}
					s1_188->b0000 = 0x00;
				}
				<anonymous> ** s6_203 = s8_160 + -860;
				<anonymous> ** s6_248;
				word32 a1_258;
				word32 a2_259;
				word32 a3_260;
				word32 a5_265;
				word32 a4_266;
				(*s6_203)();
			} while (s3_130 != s2_103);
			struct Eq_340046 * s1_275;
			word32 a4_297;
			(*s6_248)();
			s1_275->b0000 = 0x5D;
			s1_275->b0001 = 0x00;
l2305D0BC:
			0x00 = dwArg010C;
			return;
		}
	}
l2305D1CA:
	word32 s0_332 = 0x00;
	struct Eq_339922 * s1_333 = &g_t4200F000;
	do
	{
		if (a0_141 != 0x00)
		{
			word32 a5_378;
			word32 a4_379;
			s1_333->ptrFFFFFCA4();
		}
		++s0_332;
	} while (s3_130 != s0_332);
	<anonymous> * a5_390 = g_ptr4200ECA4;
	word32 a4_431;
	a5_390();
	goto l2305D0BC;
}

// 2305D2A6: Register Eq_2 print_value(Register Eq_2 ra, Register (ptr32 Eq_339780) a0, Register Eq_2 a3, Stack ptr32 dwArg10, Register out ptr32 s0Out, Register out (ptr32 Eq_339780) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_339801 a5Out)
// Called from:
//      print_array.isra.4
//      print_object.isra.3
//      cJSON_Print
Eq_2 print_value(Eq_2 ra, struct Eq_339780 * a0, Eq_2 a3, ptr32 dwArg10, ptr32 & s0Out, struct Eq_339780 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_339801 & a5Out)
{
	struct Eq_339780 * s0_26 = a0;
	if (a0 != null)
	{
		a5 = (word32) a0[6];
		a4 = 0x06;
		if (a3 != 0x00)
		{
			if (a5 <= 0x06)
			{
				<anonymous> * a5_40 = *((char *) g_a230BF760 + a5 * 0x04);
				ptr32 s0_42;
				Eq_2 ra_43;
				struct Eq_339780 * a0_44;
				Eq_339801 a5_45;
				ptr32 a4_46;
				Eq_2 a3_47;
				ptr32 a2_48;
				a5_40();
				s0Out = s0_42;
				a0Out = a0_44;
				a2Out = a2_48;
				a3Out = a3_47;
				a4Out = a4_46;
				a5Out = a5_45;
				return ra_43;
			}
		}
		else if (a5 <= 0x06)
		{
			<anonymous> * a5_17 = *((char *) g_a230BF77C + a5 * 0x04);
			ptr32 s0_19;
			Eq_2 ra_20;
			struct Eq_339780 * a0_21;
			Eq_339801 a5_22;
			ptr32 a4_23;
			Eq_2 a3_24;
			ptr32 a2_25;
			a5_17();
			s0Out = s0_19;
			a0Out = a0_21;
			a2Out = a2_25;
			a3Out = a3_24;
			a4Out = a4_23;
			a5Out = a5_22;
			return ra_20;
		}
		s0_26 = null;
	}
	s0Out = s0;
	a0Out = s0_26;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	return ra;
}

// 2305D39A: void print_object.isra.3(Register Eq_2 ra, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register word32 s4, Register word32 s7, Register word32 s8, Register word32 s9, Register word32 s10, Register word32 s11, Stack word32 dwArg84, Stack word32 dwArgC8)
void print_object.isra.3(Eq_2 ra, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, word32 s4, word32 s7, word32 s8, word32 s9, word32 s10, word32 s11, word32 dwArg84, word32 dwArgC8)
{
	Eq_2 a0_31 = *a5;
	ui32 s5_39 = 0x00;
	while (a5 != 0x00)
	{
		++s5_39;
		a5 = *a5;
	}
	if (s5_39 == 0x00)
	{
		word32 s1_1182;
		word32 s0_1181;
		struct Eq_340192 * a0_1194;
		if (a3 != 0x00)
		{
			Eq_2 a1_1209 = 0x03;
			if (a2 != 0x00)
				a1_1209 = a1 + 4;
			word32 s8_2144;
			word32 a1_2138;
			word32 s2_2141;
			word32 a4_2139;
			word32 s3_2142;
			word32 s4_2143;
			word32 a5_2140;
			ensure(ra, a3, a1_1209, a4, a5, s3, out s0_1181, out s1_1182, out a0_1194, out a1_2138, out a4_2139, out a5_2140, out s2_2141, out s3_2142, out s4_2143, out s8_2144);
		}
		else
		{
			<anonymous> * a5_1155 = g_ptr4200ECA8;
			word32 tp_1208;
			a5_1155();
		}
		if (a0_1194 != null)
		{
			a0_1194->b0000 = 0x7B;
			Eq_340231 a5_1243 = &a0_1194->b0001;
			if (s0_1181 != 0x00)
			{
				a0_1194->b0001 = 0x0A;
				a5_1243 = &a0_1194->b0001 + 1;
				Eq_340251 s1_1250 = s1_1182 + ~0x00;
				struct Eq_340254 * a3_1251 = ~0x01 - a0_1194;
				while (a5_1243 + a3_1251 < s1_1250)
				{
					a5_1243 = (word32) a5_1243 + 1;
					*((word32) a5_1243 + 0x0FFF) = 0x09;
				}
			}
			*a5_1243 = 0x7D;
			*((word32) a5_1243 + 1) = 0x00;
			return;
		}
	}
	else if (a3 != 0x00)
	{
		word32 s3_828 = (word32) (a2 != 0x00);
		struct Eq_340303 * a0_835;
		word32 s8_2147;
		word32 a1_2145;
		word32 a5_2146;
		word32 s0_1075;
		Eq_2 s2_1056;
		Eq_2 s3_1068;
		Eq_2 s4_1057;
		word32 s1_1067;
		Eq_2 a4_1089;
		Eq_2 ra_1065 = ensure(ra, a3, s3_828 + 0x02, a4, a5, s3_828 + 0x01, out s0_1075, out s1_1067, out a0_835, out a1_2145, out a4_1089, out a5_2146, out s2_1056, out s3_1068, out s4_1057, out s8_2147);
		if (a0_835 != null)
		{
			a0_835->b0000 = 0x7B;
			byte * a5_858 = &a0_835->b0001;
			if (s0_1075 != 0x00)
			{
				a0_835->b0001 = 0x0A;
				a4_1089.u0 = 0x0A;
				a5_858 = (byte *) (&a0_835->b0001 + 1);
			}
			*a5_858 = 0x00;
			word32 a5_1092 = Mem863[s2_1056 + 8:int32] + s3_1068;
			*((word32) s2_1056 + 8) = a5_1092;
			Eq_2 s5_867 = s1_1067 + 1;
			Eq_2 s7_868 = 58;
			struct Eq_340358 * s11_1096 = *a0_31;
			Eq_2 s8_1058 = (word32) (s0_1075 != 0x00);
			Eq_2 s6_876 = 0x09;
			Eq_2 s9_877 = 44;
			Eq_2 s10_878 = 0x0A;
			while (s11_1096 != null)
			{
				if (s0_1075 != 0x00)
				{
					ptr32 a0_889;
					word32 a4_2202;
					word32 a5_2203;
					word32 s0_2199;
					word32 s1_2200;
					word32 a1_2201;
					ra_1065 = ensure(ra_1065, s2_1056, s5_867, a4_1089, a5_1092, s3_1068, out s0_2199, out s1_2200, out a0_889, out a1_2201, out a4_2202, out a5_2203, out s2_1056, out s3_1068, out s4_1057, out s8_1058);
					if (a0_889 == 0x00)
						goto l2305D3DE;
					Eq_2 a5_910 = 0x00;
					while (a5_910 < s5_867)
					{
						*((word32) a5_910 + a0_889) = (byte) s6_876;
						a5_910 = (word32) a5_910 + 1;
					}
					Mem923[s2_1056 + 8:word32] = Mem919[s2_1056 + 8:int32] + s5_867;
				}
				Eq_2 a4_958;
				struct Eq_339780 * s11_966;
				Eq_2 s2_967;
				Eq_2 s3_968;
				word32 a5_2191;
				word32 a6_2192;
				word32 s4_2193;
				word32 a0_2189;
				word32 a1_2190;
				word32 s1_2188;
				Eq_2 ra_962 = print_string_ptr(ra_1065, s11_1096->t0020, s2_1056, s3_1068, s4_1057, s5_867, s6_876, s7_868, s8_1058, s9_877, s10_878, s8, dwArgC8, out s1_2188, out a0_2189, out a1_2190, out a4_958, out a5_2191, out a6_2192, out s2_967, out s3_968, out s4_2193, out s5_867, out s6_876, out s7_868, out s9_877, out s10_878, out s11_966);
				Eq_2 a4_988;
				Eq_2 a5_989;
				*((word32) s2_967 + 8) = update(s2_967, a4_958, out a4_988, out a5_989);
				struct Eq_340862 * a0_993;
				Eq_2 s2_996;
				word32 s8_998;
				word32 s0_1006;
				Eq_2 s3_1008;
				word32 a1_2195;
				word32 a5_2197;
				word32 s4_2198;
				word32 a4_2196;
				word32 s1_2194;
				Eq_2 ra_1005 = ensure(ra_962, s2_967, s3_968, a4_988, a5_989, s3_968, out s0_1006, out s1_2194, out a0_993, out a1_2195, out a4_2196, out a5_2197, out s2_996, out s3_1008, out s4_2198, out s8_998);
				if (a0_993 == null)
					goto l2305D3DE;
				a0_993->b0000 = (byte) s7_868;
				if (s0_1006 != 0x00)
					a0_993->b0001 = (byte) s6_876;
				Mem1024[s2_996 + 8:word32] = Mem1017[s2_996 + 8:int32] + s3_1008;
				Eq_2 a4_1033;
				word32 a3_2207;
				word32 a5_2208;
				word32 a0_2205;
				word32 a2_2206;
				word32 s0_2204;
				Eq_2 ra_1036 = print_value(ra_1005, s11_966, s2_996, dwLoc50, out s0_2204, out a0_2205, out a2_2206, out a3_2207, out a4_1033, out a5_2208);
				Eq_2 a4_1043;
				word32 a5_2209;
				*((word32) s2_996 + 8) = update(s2_996, a4_1033, out a4_1043, out a5_2209);
				Eq_2 a5_1050 = (word32) (s11_966->dw0000 != null) + s8_998;
				word32 a5_1063;
				word32 a1_2211;
				word32 s0_2210;
				word32 a4_2212;
				byte * a0_1053;
				ra_1065 = ensure(ra_1036, s2_996, (word32) a5_1050 + 1, a4_1043, a5_1050, s3_1008, out s0_2210, out s1_1067, out a0_1053, out a1_2211, out a4_2212, out a5_1063, out s2_1056, out s3_1068, out s4_1057, out s8_1058);
				if (a0_1053 == null)
					goto l2305D3DE;
				s0_1075 = dwArg84;
				if (s11_966->dw0000 != null)
				{
					*a0_1053 = (byte) s9_877;
					++a0_1053;
				}
				if (dwArg84 != 0x00)
				{
					*a0_1053 = (byte) s10_878;
					++a0_1053;
				}
				*a0_1053 = 0x00;
				a4_1089 = *((word32) s2_1056 + 8);
				a5_1092 = (byte) a4_1089.u0 + a5_1063;
				*((word32) s2_1056 + 8) = a5_1092;
				s11_1096 = s11_966->dw0000;
			}
			Eq_2 a1_1097 = 0x02;
			if (s0_1075 != 0x00)
				a1_1097 = s1_1067 + 2;
			word32 s0_1122;
			int32 s1_1123;
			word32 a1_2157;
			word32 a5_2159;
			word32 s2_2160;
			word32 s3_2161;
			word32 s4_2162;
			word32 a4_2158;
			word32 s8_2163;
			struct Eq_340471 * a0_1109;
			ensure(ra_1065, s2_1056, a1_1097, a4_1089, a5_1092, s3_1068, out s0_1122, out s1_1123, out a0_1109, out a1_2157, out a4_2158, out a5_2159, out s2_2160, out s3_2161, out s4_2162, out s8_2163);
			if (a0_1109 != null)
			{
				if (s0_1122 != 0x00)
				{
					int32 a5_1130;
					for (a5_1130 = 0x00; a5_1130 < s1_1123; ++a5_1130)
						a0_1109[a5_1130 / 2] = (struct Eq_340471) 0x09;
					int32 s4_1139 = s1_1123;
					if (s1_1123 < 0x00)
						s4_1139 = 0x00;
					a0_1109 += s4_1139 / 2;
				}
				a0_1109->a0000[0] = 0x7D;
				a0_1109->b0001 = 0x00;
				return;
			}
		}
	}
	else
	{
		<anonymous> * a5_48 = g_ptr4200ECA8;
		ui32 s8_49 = s5_39 << 0x02;
		struct Eq_340273 * sp_63;
		word32 s0_64;
		word32 s1_65;
		word32 s5_67;
		word32 s6_68;
		word32 ra_69;
		<anonymous> ** s3_70;
		word32 s4_71;
		word32 s7_72;
		word32 s8_73;
		word32 s9_74;
		word32 s10_75;
		word32 s11_76;
		word32 a0_77;
		word32 a1_79;
		word32 a2_80;
		word32 a3_81;
		word32 a4_87;
		word32 tp_1399;
		a5_48();
		sp_63->dw0008 = s4_71 + -856;
		if (a0_77 != 0x00)
		{
			<anonymous> * a5_763;
			<anonymous> * a5_91 = *s3_70;
			struct Eq_340384 * sp_93;
			Eq_2 a0_107;
			word32 a4_117;
			word32 tp_1403;
			Eq_2 s0_246;
			word32 s1_185;
			union Eq_2 * s6_753;
			Eq_2 ra_754;
			word32 s3_100;
			word32 s7_102;
			word32 s9_104;
			word32 s10_105;
			word32 s11_106;
			word32 a1_109;
			word32 a2_110;
			word32 a3_111;
			Eq_2 s2_1342;
			Eq_2 s5_1343;
			Eq_2 s8_103;
			a5_91();
			Eq_2 s4_118 = a0_107;
			if (a0_107 == 0x00)
				a5_763 = g_ptr4200ECA4;
			else
			{
				word32 s11_1352;
				Eq_2 s9_1350;
				word32 a2_2151;
				word32 a0_2149;
				word32 a4_2153;
				word32 a5_2154;
				word32 t1_2155;
				word32 a5_2156;
				word32 a3_2152;
				word32 a1_2150;
				word32 t1_2148;
				<anonymous> * a4_138;
				Eq_2 a0_1335;
				word32 a1_135;
				word32 a2_1354;
				word32 a3_1355;
				Eq_2 ra_1345 = memset(memset(ra_754, s2_1342, 0x00, s8_103, out t1_2148, out a0_2149, out a1_2150, out a2_2151, out a3_2152, out a4_2153, out a5_2154), a0_107, 0x00, s8_103, out t1_2155, out a0_1335, out a1_135, out a2_1354, out a3_1355, out a4_138, out a5_2156);
				sp_93->dw0084 = s1_185 + 1;
				Eq_2 s10_1351 = *s6_753;
				if (s0_246 != 0x00)
				{
					s11_1352 = s1_185 + 8;
					s9_1350 = s1_185 + 3;
				}
				else
				{
					s11_1352 = 0x07;
					s9_1350.u0 = 0x00;
				}
				sp_93->t0004 = a0_107;
				sp_93->ptr0088 = (ptr32) ((byte) s9_1350.u0 + 2);
				Eq_2 s7_1348 = a0_107;
				Eq_2 s6_1344 = s2_1342;
				Eq_2 a6_156 = s2_1342;
				Eq_2 s3_1310 = 0x00;
				while (s10_1351 != 0x00)
				{
					Eq_2 a0_163 = *((word32) s10_1351 + 32);
					sp_93->t000C = a6_156;
					word32 a5_180;
					union Eq_2 * a6_181;
					struct Eq_339780 * s10_186;
					Eq_2 a0_203;
					word32 a4_2164;
					word32 s9_2165;
					Eq_2 ra_183 = print_string_ptr(ra_1345, a0_163, 0x00, s3_1310, s4_118, s5_1343, s6_1344, s7_1348, s8_103, s9_1350, s10_1351, sp_93->dw001C, sp_93->dw0128, out s1_185, out a0_203, out a1_135, out a4_2164, out a5_180, out a6_181, out s2_1342, out s3_1310, out s4_118, out s5_1343, out s6_1344, out s7_1348, out s9_2165, out s10_186, out s11_1352);
					*a0_203 = a5_180;
					word32 s0_2166;
					word32 a5_214;
					ra_1345 = print_value(ra_183, s10_186, 0x00, sp_93->ptr0010, out s0_2166, out a0_1335, out a2_1354, out a3_1355, out a4_138, out a5_214);
					s8_103 = sp_93->t0008;
					*a6_181 = (union Eq_2 *) a0_1335;
					s9_1350 = a0_203;
					if (a0_203 != 0x00 && a0_1335 != 0x00)
					{
						sp_93->ptr008C = a6_181;
						word32 a3_2169;
						word32 a4_2170;
						word32 a5_2171;
						word32 a1_2167;
						word32 a2_2168;
						sp_93->t000C = strlen(a0_1335, out a1_2167, out a2_2168, out a3_2169, out a4_2170, out a5_2171);
						word32 a5_233;
						a0_1335 = strlen(a0_203, out a1_135, out a2_1354, out a3_1355, out a4_138, out a5_233);
						a5_214 = a5_233 + s11_1352 + a3_1355;
						s4_118 = sp_93->t00E4;
						s8_103 = sp_93->t00A4;
						s11_1352 = (word32) a0_1335 + a5_214;
					}
					else
						s3_1310.u0 = 0x01;
					s0_246 = sp_93->t00E4;
					s10_1351 = s10_186->dw0000;
					sp_93->t0004 = a5_214 + 0x04;
					a6_156 = (char *) a6_181 + 4;
				}
				if (s3_1310 == 0x00)
				{
					word32 a4_313;
					word32 tp_317;
					word32 s0_290;
					struct Eq_340567 * sp_289;
					word32 s1_291;
					a4_138();
					s10_1351 = a0_1335;
					if (a0_1335 != 0x00)
					{
						*a0_1335 = 0x7B;
						Eq_2 s9_321 = (word32) a0_1335 + 1;
						if (s0_290 != 0x00)
						{
							*((word32) a0_1335 + 1) = 0x0A;
							s9_321 = (word32) a0_1335 + 2;
						}
						*s9_321 = 0x00;
						sp_289->dw0004 = (word32) s5_1343 - 1;
						int32 a5_1326 = (word32) s5_1343 - 1;
						Eq_2 s8_329 = 0x00;
						do
						{
							if (s0_290 != 0x00)
							{
								int32 a3_333 = 0x00;
								while (true)
								{
									Eq_2 a2_339 = (word32) s9_321 + a3_333;
									if (a3_333 >= a5_1326)
										break;
									*a2_339 = 0x09;
									a5_1326 = 0x09;
									++a3_333;
								}
								s9_321 = a2_339;
							}
							word32 a2_2173;
							word32 a1_2172;
							word32 a3_2174;
							word32 a4_2175;
							word32 a5_2176;
							Eq_2 a0_351 = strlen(*s7_1348, out a1_2172, out a2_2173, out a3_2174, out a4_2175, out a5_2176);
							word32 a3_2179;
							word32 a4_2180;
							word32 a5_2181;
							word32 a6_2182;
							word32 a7_2183;
							word32 a1_2177;
							word32 a2_2178;
							memcpy(s9_321, *s7_1348, a0_351, out a1_2177, out a2_2178, out a3_2179, out a4_2180, out a5_2181, out a6_2182, out a7_2183);
							word32 a0_376 = s9_321 + a0_351;
							a0_376->b0000 = 0x3A;
							Eq_2 s9_379 = &a0_376->b0001;
							if (s0_290 != 0x00)
							{
								a0_376->b0001 = 0x09;
								s9_379 = &a0_376->b0001 + 1;
							}
							word32 a4_2184;
							word32 a5_2185;
							strcpy(s9_379, *s6_1344, out a4_2184, out a5_2185);
							word32 a3_398;
							Eq_2 a5_400;
							word32 a1_401;
							word32 a4_2187;
							word32 a2_2186;
							Eq_2 a0_397 = strlen(*s6_1344, out a1_401, out a2_2186, out a3_398, out a4_2187, out a5_400);
							word32 s0_406 = sp_289->dw00E4;
							word32 s9_407 = s9_379 + a0_397;
							if (a5_400 != s8_329)
							{
								*s9_407 = 44;
								++s9_407;
							}
							if (s0_406 != 0x00)
							{
								*s9_407 = 0x0A;
								++s9_407;
							}
							*s9_407 = 0x00;
							<anonymous> * a2_428 = g_ptr4200ECA4;
							word32 s0_485;
							word32 s1_486;
							word32 s2_487;
							word32 s5_488;
							word32 s6_489;
							word32 ra_490;
							word32 s3_491;
							word32 s4_492;
							word32 s7_493;
							word32 s8_494;
							word32 s9_495;
							word32 s10_496;
							<anonymous> ** s11_497;
							word32 a5_499;
							word32 a1_500;
							word32 a3_502;
							a2_428();
							<anonymous> * a2_514 = *s11_497;
							<anonymous> ** s11_529;
							word32 a1_532;
							word32 a3_534;
							word32 a4_540;
							word32 tp_544;
							a2_514();
						} while (s5_1343 != s8_329);
						<anonymous> * a2_545 = *s11_529;
						word32 s0_548;
						word32 s1_549;
						word32 s2_550;
						word32 s5_551;
						word32 s6_552;
						word32 ra_553;
						word32 s3_554;
						word32 s4_555;
						word32 s7_556;
						word32 s8_557;
						word32 s9_558;
						word32 s10_559;
						<anonymous> ** s11_560;
						word32 a5_562;
						word32 a1_563;
						word32 a2_564;
						a2_545();
						<anonymous> * a3_576 = *s11_560;
						word32 s0_579;
						word32 a4_602;
						word32 tp_606;
						int32 s3_585;
						int32 s1_580;
						struct Eq_341062 * s9_589;
						a3_576();
						if (s0_579 != 0x00)
						{
							for (; s3_585 < s1_580; ++s3_585)
								s9_589[s3_585 / 2] = (struct Eq_341062) 0x09;
							if (s1_580 < 0x00)
								s1_580 = 0x00;
							s9_589 += s1_580 / 2;
						}
						s9_589->a0000[0] = 0x7D;
						s9_589->b0001 = 0x00;
						return;
					}
				}
				Eq_2 s0_623 = 0x00;
				struct Eq_340573 * s1_624 = &g_t4200F000;
				do
				{
					if (a0_1335 != 0x00)
					{
						<anonymous> * a5_629 = s1_624->ptrFFFFFCA4;
						word32 a4_670;
						word32 tp_674;
						a5_629();
					}
					Eq_340575 a5_677 = *a0_1335;
					if (a0_1335 != 0x00)
					{
						<anonymous> * a5_679 = s1_624->ptrFFFFFCA4;
						word32 a4_720;
						word32 tp_724;
						a5_679();
					}
					s0_623 = (word32) s0_623 + 4;
				} while (s8_103 != s0_623);
				word32 a4_772;
				word32 tp_776;
				a5_677();
				s0_246 = *a5_763;
			}
			word32 a4_823;
			word32 tp_827;
			a5_763();
		}
	}
l2305D3DE:
}

