pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305D7D6: void cJSON_InitHooks(Register word32 a0, Register (ptr32 word32) a5)
// Called from:
//      __bl_ble_sync_task
void cJSON_InitHooks(word32 a0, word32 * a5)
{
	if (a0 == 0x00)
		g_dw2307BEFC = 0x4200ECA8;
	else
	{
		if (a5 == null)
			a5 = &g_dw2307BEFC;
		*a5 = 0x4200ECA8;
		if (a5 != null)
		{
l2305D80E:
			*a5 = 0x4200ECA4;
			return;
		}
	}
	a5 = &g_dw2307BEF4;
	goto l2305D80E;
}

// 2305D812: Register Eq_2 cJSON_Delete(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_341140) a5, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_341140) a5Out, Register out ptr32 s2Out, Register out Eq_341145 s3Out)
// Called from:
//      cJSON_Delete
//      cJSON_Parse
//      base_station_info
Eq_2 cJSON_Delete(Eq_2 ra, Eq_2 a0, struct Eq_341140 * a5, ptr32 & s1Out, union Eq_2 & a0Out, struct Eq_341140 & a5Out, ptr32 & s2Out, union Eq_341145 & s3Out)
{
	Eq_2 s0_101 = a0;
	ptr32 s2_102 = 0x4200F000;
	while (true)
	{
		struct Eq_341140 * a5_112;
		if (s0_101 == 0x00)
			break;
		struct Eq_341149 * a5_65;
		int32 s3_21 = *a5->ptr000C;
		struct Eq_341149 * a5_24 = a5 & 0x0100;
		if (a5_24 == null)
		{
			if (a0 != 0x00)
			{
				ui32 a5_41;
				word32 s1_158;
				ra = cJSON_Delete(ra, a0, a5_41 & 0x0100, out s1_158, out a0, out a5_41, out s2_102, out s3_21);
				a5_24 = a5_41 & 0x0100;
				if ((a5_41 & 0x0100) != 0x00)
					goto l2305D84C;
			}
			word32 s0_46 = *((word32) a0 + 16);
			if (a0 != 0x00)
			{
				a5_24();
				a5_24 = a5_65;
			}
			goto l2305D84C;
		}
l2305D84C:
		<anonymous> * a5_89;
		Eq_2 s0_68 = a5_24->t000C;
		<anonymous> * a5_69 = a5_24 & 0x0200;
		if (a5_69 == null)
		{
			s0_68 = *((word32) a0 + 32);
			if (a0 != 0x00)
			{
				a5_69();
				a5_69 = a5_89;
			}
		}
		a5_69();
		a5 = a5_112;
	}
	s1Out = s1;
	a0Out = a0;
	a5Out = a5;
	s2Out = s2_102;
	s3Out = s3;
	return ra;
}

// 2305D878: Register Eq_2 cJSON_ParseWithOpts(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register (ptr32 Eq_337416) a1, Register Eq_2 a2, Register Eq_337418 s5, Register Eq_337419 s6, Register Eq_337420 s7, Register Eq_2 s8, Register ptr32 s9, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out Eq_2 a0Out)
// Called from:
//      cJSON_Parse
Eq_2 cJSON_ParseWithOpts(Eq_2 ra, Eq_2 s0, Eq_2 a0, struct Eq_337416 * a1, Eq_2 a2, Eq_337418 s5, Eq_337419 s6, Eq_337420 s7, Eq_2 s8, ptr32 s9, Eq_2 s11, ptr32 fflags, ptr32 frm, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgEC, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, union Eq_2 & a0Out)
{
	word32 a5_244;
	Eq_2 ra_107 = cJSON_New_Item(ra, s0, out a5_244);
	g_t4200F4E8.u0 = 0x00;
	Eq_2 s0_115 = a0;
	if (a0 != 0x00)
	{
		Eq_2 a0_48;
		struct Eq_341140 * a5_53;
		union Eq_2 * s3_64;
		word32 s4_65;
		word32 s11_253;
		word32 s9_252;
		word32 s8_251;
		word32 s7_250;
		word32 s6_249;
		word32 s5_248;
		word32 s2_247;
		word32 s1_246;
		word32 a5_245;
		ra_107 = parse_value(ra_107, a0, skip(a0, out a5_245), 0x4200F4E8, a1, a2, s5, s6, s7, s8, s9, s11, fflags, frm, dwArg9C, dwArgAC, dwArgEC, dwArg0128, dwArg0148, out s0_115, out s1_246, out a0_48, out a5_53, out s2_247, out s3_64, out s4_65, out s5_248, out s6_249, out s7_250, out s8_251, out s9_252, out s11_253);
		Eq_2 s1_79 = a0_48;
		if (a0_48 == 0x00)
		{
			word32 s3_258;
			word32 s2_257;
			word32 a5_256;
			word32 a0_255;
			word32 s1_254;
			ra_107 = cJSON_Delete(ra_107, s0_115, a5_53, out s1_254, out a0_255, out a5_256, out s2_257, out s3_258);
			goto l2305D8B8;
		}
		if (s4_65 != 0x00)
		{
			word32 a5_259;
			Eq_2 a0_81 = skip(a0_48, out a5_259);
			struct Eq_341140 * a5_83 = (word32) *a0_81;
			s1_79 = a0_81;
			if (a5_83 != null)
			{
				word32 s1_95;
				word32 * s2_96;
				word32 s3_262;
				word32 a5_261;
				word32 a0_260;
				ra_107 = cJSON_Delete(ra_107, s0_115, a5_83, out s1_95, out a0_260, out a5_261, out s2_96, out s3_262);
				*s2_96 = s1_95;
l2305D8B8:
				s0_115.u0 = 0x00;
				goto l2305D8BA;
			}
		}
		if (s3_64 != null)
			*s3_64 = (union Eq_2 *) s1_79;
	}
l2305D8BA:
	s0Out = s1;
	a0Out = s0_115;
	return ra_107;
}

// 2305D8F2: Register Eq_2 cJSON_Parse(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_337418 s5, Register Eq_337419 s6, Register Eq_337420 s7, Register Eq_2 s8, Register ptr32 s9, Register Eq_2 s11, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgEC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 a0Out)
// Called from:
//      base_station_info
Eq_2 cJSON_Parse(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_337418 s5, Eq_337419 s6, Eq_337420 s7, Eq_2 s8, ptr32 s9, Eq_2 s11, ptr32 fflags, ptr32 frm, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgEC, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & a0Out)
{
	ptr32 s0_24;
	ptr32 a0_33;
	Eq_2 ra_23 = cJSON_ParseWithOpts(ra, s0, a0, null, 0x00, s5, s6, s7, s8, s9, s11, fflags, frm, dwArg9C, dwArgAC, dwArgEC, dwArg0128, dwArg0148, out s0_24, out a0_33);
	s0Out = s0_24;
	a0Out = a0_33;
	return ra_23;
}

// 2305D8FA: void cJSON_Print(Register Eq_2 ra, Register (ptr32 Eq_339780) a0, Stack ptr32 dwArg10)
void cJSON_Print(Eq_2 ra, struct Eq_339780 * a0, ptr32 dwArg10)
{
	word32 s0_17;
	word32 a0_18;
	word32 a2_19;
	word32 a3_20;
	word32 a4_21;
	word32 a5_22;
	print_value(ra, a0, 0x00, dwArg10, out s0_17, out a0_18, out a2_19, out a3_20, out a4_21, out a5_22);
}

// 2305D904: Register (ptr32 byte) cJSON_GetObjectItem(Register (ptr32 Eq_341367) s0, Register (ptr32 byte) a1, Register out (ptr32 Eq_341367) a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      base_station_info
byte * cJSON_GetObjectItem(struct Eq_341367 * s0, byte * a1, struct Eq_341367 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_338777 * a0_10 = s0->ptr0008;
	for (; s0 != null; s0 = s0->ptr0000)
	{
		s0 = (struct Eq_341367 *) a0_10[32];
		a0_10 = cJSON_strcasecmp(a0_10, a1, out a3, out a4);
		if (a0_10 == null)
			break;
	}
	a0Out = s0;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4;
	return a1;
}

// 2305D92C: void cJSON_AddItemToArray(Register (ptr32 Eq_341395) a1, Register (ptr32 (ptr32 Eq_341409)) a4, Register (ptr32 Eq_341397) a5)
// Called from:
//      cJSON_AddItemToObject
void cJSON_AddItemToArray(struct Eq_341395 * a1, struct Eq_341409 ** a4, struct Eq_341397 * a5)
{
	if (a1 == null)
		return;
	word32 a0_6 = a5->dw0008;
	if (a5 != null)
	{
		do
		{
			struct Eq_341409 * a5_9 = *a4;
		} while (a4 != null);
		a1->ptr0000 = a5_9;
		a5_9->ptr0004 = a1;
	}
	else
		a1->dw0008 = a0_6;
}

// 2305D942: void cJSON_AddItemToObject(Register Eq_2 ra, Register (ptr32 Eq_341422) a0, Register Eq_2 a1, Register word32 a2, Stack Eq_2 dwArg34, Stack word32 dwArg38)
void cJSON_AddItemToObject(Eq_2 ra, struct Eq_341422 * a0, Eq_2 a1, word32 a2, Eq_2 dwArg34, word32 dwArg38)
{
	if (a2 == 0x00)
		return;
	Eq_2 a2_9 = a0->t0020;
	Eq_2 s0_16 = a2_9;
	Eq_2 s2_18 = a1;
	if (a0 != null)
	{
		<anonymous> * a5_20 = g_ptr4200ECA4;
		word32 tp_30;
		word32 a4_31;
		word32 a3_67;
		word32 a6_68;
		word32 a7_69;
		word32 s8_70;
		word32 t0_71;
		word32 t1_72;
		word32 t3_73;
		word32 t4_74;
		word32 t5_75;
		word32 t6_76;
		a5_20();
	}
	struct Eq_341409 ** a4_41;
	struct Eq_341397 * a5_42;
	struct Eq_341439 * a0_54;
	struct Eq_341395 * s0_46 = cJSON_strdup(ra, s0_16, s2_18, dwArg34, out a0_54, out a4_41, out a5_42);
	a0_54->ptr0020 = s0_46;
	0x00 = dwArg38;
	cJSON_AddItemToArray(s0_46, a4_41, a5_42);
}

// 2305D97E: void cJSON_CreateNumber(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register ptr32 fflags, Register ptr32 frm, Stack word32 dwArg58)
void cJSON_CreateNumber(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, ptr32 fflags, ptr32 frm, word32 dwArg58)
{
	word32 a5_71;
	Eq_2 ra_21 = cJSON_New_Item(ra, s0, out a5_71);
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x0F = a0;
		*((word32) a0 + 24) = a0;
		*((word32) a0 + 28) = a1;
		word32 a5_75;
		word32 a4_74;
		word32 a3_73;
		word32 a1_72;
		*((word32) __fixdfsi(ra_21, a0, a1, fflags, frm, out a1_72, out a3_73, out a4_74, out a5_75) + 20) = a0;
	}
	0x00 = dwArg58;
}

// 2305D9B8: void cJSON_CreateString(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Stack Eq_2 dwArg34)
void cJSON_CreateString(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 dwArg34)
{
	word32 a5_81;
	Eq_2 ra_17 = cJSON_New_Item(ra, s0, out a5_81);
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x10 = a0;
		struct Eq_341518 * a0_40;
		word32 a4_82;
		word32 a5_83;
		a0_40->ptr0010 = cJSON_strdup(ra_17, a0, a0, dwArg34, out a0_40, out a4_82, out a5_83);
	}
}

// 2305D9E2: void cJSON_CreateObject(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0)
void cJSON_CreateObject(Eq_2 ra, Eq_2 s0, Eq_2 a0)
{
	word32 a5_32;
	cJSON_New_Item(ra, s0, out a5_32);
	if (a0 != 0x00)
		*(union Eq_2 *) 0x12 = a0;
}

// 2305D9F6: Register Eq_2 cli_command_get(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      proc_onecmd
//      help_cmd
//      aos_cli_input_direct
Eq_2 cli_command_get(Eq_2 a0, Eq_2 a1, Eq_2 a3, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_28 = ~0x00;
	if (a0 >= 0x00)
	{
		a5_28.u0 = ~0x00;
		a4 = *((word32) a3 + 44);
		a2 = (word32) a3 + 8;
		if (a0 < (word32) a3 + 8)
		{
			if (a0 < a3)
			{
				if (a1 != 0x00)
					*(union Eq_2 *) 0x01 = a1;
				a4 = *(union Eq_2 *) 0x14;
				a5_28 = (word32) a0 + 24;
			}
			else
			{
				if (a1 != 0x00)
					*a1 = 0x00;
				a4 = *(union Eq_2 *) 0x2B;
			}
		}
	}
	a2Out = a2;
	a4Out = a4;
	a5Out = a5_28;
	return a5_28;
}

// 2305DA3A: void exit_cmd()
void exit_cmd()
{
	g_dw4200F4F0 = 0x01;
}

// 2305DA46: void cb_idnoe(Register Eq_2 ra, Register (ptr32 Eq_341581) a1, Register Eq_2 a3, Register (ptr32 Eq_2) a5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cb_idnoe(Eq_2 ra, struct Eq_341581 * a1, Eq_2 a3, union Eq_2 * a5, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	Eq_2 a0_7 = *a5;
	if (a5 == null)
	{
		*(union Eq_2 *) 0x01 = a0_7;
		Eq_2 a3_20;
		word32 s1_174;
		word32 a0_175;
		word32 a2_176;
		word32 s10_171;
		word32 s11_172;
		word32 t4_173;
		word32 s7_168;
		word32 s8_169;
		word32 s9_170;
		word32 s4_165;
		word32 s5_166;
		word32 s6_167;
		word32 a7_162;
		word32 s2_163;
		word32 s3_164;
		word32 a2_159;
		word32 a4_160;
		word32 a5_161;
		word32 s1_156;
		word32 a0_157;
		word32 a1_158;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a7_180;
		word32 s2_181;
		word32 s3_182;
		word32 s4_183;
		word32 s5_184;
		word32 s6_185;
		word32 s7_186;
		word32 s8_187;
		word32 s9_188;
		word32 s10_189;
		word32 s11_190;
		word32 t4_191;
		ra = printf(printf(ra, &g_t230BF868, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_156, out a0_157, out a1_158, out a2_159, out a3_20, out a4_160, out a5_161, out a7_162, out s2_163, out s3_164, out s4_165, out s5_166, out s6_167, out s7_168, out s8_169, out s9_170, out s10_171, out s11_172, out t4_173), &g_t230BF888, a3_20, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_174, out a0_175, out a1, out a2_176, out a3_177, out a4_178, out a5_179, out a7_180, out s2_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out s9_188, out s10_189, out s11_190, out t4_191);
	}
	word32 a5_64 = (word32) a1->b0010;
	Eq_2 a3_78;
	if (a5_64 != 0x01)
	{
		if (a5_64 != 0x02)
		{
			if (a5_64 != 0x03)
				a3_78.u0 = 0x230B332C;
			else
				a3_78.u0 = 587987008;
		}
		else
			a3_78.u0 = 587987032;
	}
	else
		a3_78.u0 = 587987020;
	word32 s1_192;
	word32 a0_193;
	word32 a1_194;
	word32 a2_195;
	word32 a3_196;
	word32 a4_197;
	word32 a5_198;
	word32 a7_199;
	word32 s2_200;
	word32 s3_201;
	word32 s4_202;
	word32 s5_203;
	word32 s6_204;
	word32 s7_205;
	word32 s8_206;
	word32 s9_207;
	word32 s10_208;
	word32 s11_209;
	word32 t4_210;
	printf(ra, &g_t230BF8E0, a3_78, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_192, out a0_193, out a1_194, out a2_195, out a3_196, out a4_197, out a5_198, out a7_199, out s2_200, out s3_201, out s4_202, out s5_203, out s6_204, out s7_205, out s8_206, out s9_207, out s10_208, out s11_209, out t4_210);
}

// 2305DADE: void ota_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack word32 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0194)
void ota_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a4, Eq_2 a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg20, Eq_2 dwArg24, word32 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0194)
{
	aos_task_new(ra, s1, 587586294, 0x00, 0x01000000, a4, a5, s4, mstatus, dwArg04, dwArg20, dwArg24, dwArgA8, dwArgC8, dwArg0118, dwArg0138, dwArg0158, dwArg0178, dwArg0194);
}

// 2305DAF6: void tftp_ota_thread(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178)
void tftp_ota_thread(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0168, Eq_2 dwArg0178)
{
	aos_task_exit(a2, a3, a4, a5, mstatus, dwArg0128, dwArg0138, dwArg0168, dwArg0178);
}

// 2305DAFC: void cat_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cat_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	if (a2 != 0x02)
	{
		word32 a1_290;
		word32 s1_289;
		word32 a2_291;
		word32 a3_292;
		word32 a4_293;
		word32 a5_294;
		word32 a7_295;
		word32 s3_296;
		word32 s4_297;
		word32 s5_298;
		word32 s6_299;
		word32 s7_300;
		word32 s8_301;
		word32 s9_302;
		word32 s10_303;
		word32 s11_304;
		word32 t4_305;
		ra = printf(ra, &g_t230BF814, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_289, out a0, out a1_290, out a2_291, out a3_292, out a4_293, out a5_294, out a7_295, out s2, out s3_296, out s4_297, out s5_298, out s6_299, out s7_300, out s8_301, out s9_302, out s10_303, out s11_304, out t4_305);
	}
	Eq_2 a0_49;
	ptr32 mstatus_73;
	word32 s6_288;
	word32 s3_287;
	word32 s2_286;
	word32 a5_285;
	word32 s1_283;
	word32 s0_282;
	word32 a2_284;
	struct Eq_341835 * a4_108;
	Eq_2 a3_122;
	Eq_2 ra_107 = aos_open(ra, a0, s2, mstatus, dwLoc1C, dwArg64, s1, dwArgD8, dwArg0118, dwArg0158, out s0_282, out s1_283, out a0_49, out a2_284, out a3_122, out a4_108, out a5_285, out s2_286, out s3_287, out s6_288, out mstatus_73);
	Eq_2 s0_105 = a0_49;
	if (a0_49 >= 0x00)
	{
		word32 s1_101 = 0x230BF000;
		while (true)
		{
			word32 a0_110;
			word32 a1_362;
			Eq_2 ra_118 = aos_read(ra_107, s0_105, fp + ~0x10, a4_108, dwLoc20, dwArg24, out s0_105, out a0_110, out a1_362);
			if (a0_110 != 0x01)
				break;
			word32 a0_346;
			word32 a1_347;
			word32 a2_348;
			word32 a5_349;
			word32 a7_350;
			word32 s2_351;
			word32 s3_352;
			word32 s4_353;
			word32 s5_354;
			word32 s6_355;
			word32 s7_356;
			word32 s8_357;
			word32 s9_358;
			word32 s10_359;
			word32 s11_360;
			word32 t4_361;
			ra_107 = printf(ra_118, s1_101 + -664, a3_122, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_101, out a0_346, out a1_347, out a2_348, out a3_122, out a4_108, out a5_349, out a7_350, out s2_351, out s3_352, out s4_353, out s5_354, out s6_355, out s7_356, out s8_357, out s9_358, out s10_359, out s11_360, out t4_361);
		}
		Eq_2 a2_127;
		Eq_2 a3_128;
		Eq_2 a4_129;
		struct Eq_341941 * s2_135;
		word32 s1_325;
		word32 a0_326;
		word32 a1_327;
		word32 a5_328;
		word32 a7_329;
		word32 s3_330;
		word32 s4_331;
		word32 s5_332;
		word32 s6_333;
		word32 s7_334;
		word32 s8_335;
		word32 s9_336;
		word32 s10_337;
		word32 s11_338;
		word32 t4_339;
		word32 a2_340;
		word32 a4_341;
		word32 a5_342;
		word32 s2_343;
		word32 s3_344;
		word32 s6_345;
		aos_close(printf(ra_118, &g_b230C6900, a3_122, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_325, out a0_326, out a1_327, out a2_127, out a3_128, out a4_129, out a5_328, out a7_329, out s2_135, out s3_330, out s4_331, out s5_332, out s6_333, out s7_334, out s8_335, out s9_336, out s10_337, out s11_338, out t4_339), s0_105, a2_127, a3_128, a4_129, s2_135, mstatus_73, dwArg18, out a2_340, out a4_341, out a5_342, out s2_343, out s3_344, out s6_345);
	}
	else
	{
		word32 s1_306;
		word32 a0_307;
		word32 a1_308;
		word32 a2_309;
		word32 a3_310;
		word32 a4_311;
		word32 a5_312;
		word32 a7_313;
		word32 s2_314;
		word32 s3_315;
		word32 s4_316;
		word32 s5_317;
		word32 s6_318;
		word32 s7_319;
		word32 s8_320;
		word32 s9_321;
		word32 s10_322;
		word32 s11_323;
		word32 t4_324;
		printf(ra_107, &g_t230BF82C, a3_122, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_306, out a0_307, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out a7_313, out s2_314, out s3_315, out s4_316, out s5_317, out s6_318, out s7_319, out s8_320, out s9_321, out s10_322, out s11_323, out t4_324);
	}
}

// 2305DB76: void hexdump_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack word32 dwArg0178)
void hexdump_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, word32 dwArg0178)
{
	if (a2 != 0x02)
	{
		word32 s1_294;
		word32 a1_295;
		word32 a2_296;
		word32 a3_297;
		word32 a4_298;
		word32 a5_299;
		word32 a7_300;
		word32 s3_301;
		word32 s4_302;
		word32 s5_303;
		word32 s6_304;
		word32 s7_305;
		word32 s8_306;
		word32 s9_307;
		word32 s10_308;
		word32 s11_309;
		word32 t4_310;
		ra = printf(ra, &g_t230BF814, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_294, out a0, out a1_295, out a2_296, out a3_297, out a4_298, out a5_299, out a7_300, out s2, out s3_301, out s4_302, out s5_303, out s6_304, out s7_305, out s8_306, out s9_307, out s10_308, out s11_309, out t4_310);
	}
	Eq_2 a0_49;
	Eq_2 a3_57;
	ptr32 mstatus_73;
	word32 s0_286;
	word32 s1_287;
	word32 a2_288;
	word32 a4_289;
	word32 a5_290;
	word32 s2_291;
	word32 s3_292;
	word32 s6_293;
	Eq_2 ra_74 = aos_open(ra, a0, s2, mstatus, dwLoc1C, dwArg64, s1, dwArgD8, dwArg0118, dwArg0158, out s0_286, out s1_287, out a0_49, out a2_288, out a3_57, out a4_289, out a5_290, out s2_291, out s3_292, out s6_293, out mstatus_73);
	if (a0_49 < 0x00)
	{
		word32 s1_342;
		word32 a0_343;
		word32 a1_344;
		word32 a2_345;
		word32 a3_346;
		word32 a4_347;
		word32 a5_348;
		word32 a7_349;
		word32 s2_350;
		word32 s3_351;
		word32 s4_352;
		word32 s5_353;
		word32 s6_354;
		word32 s7_355;
		word32 s8_356;
		word32 s9_357;
		word32 s10_358;
		word32 s11_359;
		word32 t4_360;
		printf(ra_74, &g_t230BF82C, a3_57, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_342, out a0_343, out a1_344, out a2_345, out a3_346, out a4_347, out a5_348, out a7_349, out s2_350, out s3_351, out s4_352, out s5_353, out s6_354, out s7_355, out s8_356, out s9_357, out s10_358, out s11_359, out t4_360);
	}
	else
	{
		struct Eq_446 * a4_83;
		Eq_2 a3_94;
		Eq_2 a1_109;
		Eq_2 a3_111;
		Eq_2 s1_115;
		Eq_2 s10_116;
		Eq_2 a2_132;
		Eq_2 a3_133;
		Eq_2 a4_134;
		Eq_2 s0_139;
		struct Eq_341941 * s2_143;
		word32 t1_311;
		word32 a0_312;
		word32 a1_313;
		word32 a2_314;
		word32 a3_315;
		word32 a5_316;
		word32 s0_317;
		word32 a0_318;
		word32 a2_319;
		word32 a4_320;
		word32 a0_321;
		word32 a2_322;
		word32 a4_323;
		word32 a5_324;
		word32 a7_325;
		word32 s2_326;
		word32 s3_327;
		word32 s4_328;
		word32 s5_329;
		word32 s6_330;
		word32 s7_331;
		word32 s8_332;
		word32 s9_333;
		word32 s11_334;
		word32 t4_335;
		word32 a2_336;
		word32 a4_337;
		word32 a5_338;
		word32 s2_339;
		word32 s3_340;
		word32 s6_341;
		aos_close(utils_hexdump(printf(aos_ioctl(memset(ra_74, fp + ~0x17, 0x00, 0x08, out t1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_83, out a5_316), a0_49, 0x01, fp + ~0x17, a4_83, dwLoc20, dwArg24, out s0_317, out a0_318, out a2_319, out a3_94, out a4_320), &g_t230BFAC0, a3_94, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_115, out a0_321, out a1_109, out a2_322, out a3_111, out a4_323, out a5_324, out a7_325, out s2_326, out s3_327, out s4_328, out s5_329, out s6_330, out s7_331, out s8_332, out s9_333, out s10_116, out s11_334, out t4_335), s1_115, a1_109, a3_111, s10_116, dwArg10, dwArg14, dwArg5C, dwArg0178, out s0_139, out a2_132, out a3_133, out a4_134, out s2_143), s0_139, a2_132, a3_133, a4_134, s2_143, mstatus_73, dwArg18, out a2_336, out a4_337, out a5_338, out s2_339, out s3_340, out s6_341);
	}
}

// 2305DBEE: Register Eq_2 aos_cli_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 s3Out)
// Called from:
//      aos_loop_proc
Eq_2 aos_cli_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & s3Out)
{
	Eq_2 a0_16;
	ptr32 s3_26;
	word32 s4_100;
	word32 s2_99;
	word32 a5_98;
	word32 a4_97;
	word32 a3_96;
	word32 s1_95;
	*a0_16 = aos_malloc(ra, s1, 0x0244, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_95, out a0_16, out a3_96, out a4_97, out a5_98, out s2_99, out s3_26, out s4_100);
	if (a0_16 != 0x00)
	{
		Eq_2 a4_39;
		word32 t1_101;
		word32 a0_102;
		word32 a1_103;
		word32 a2_104;
		word32 a3_105;
		word32 a5_106;
		ra = memset(ra, a0_16, 0x00, 0x0244, out t1_101, out a0_102, out a1_103, out a2_104, out a3_105, out a4_39, out a5_106);
		g_t230CBB30 = a4_39;
		*((word32) a4_39 + 4) = 0x00;
		*(union Eq_2 *) ~0x55555390 = a4_39;
		*(union Eq_2 *) ~0x5555538C = a4_39;
		*(union Eq_2 *) 0x01 = a4_39;
	}
	s3Out = s3_26;
	return ra;
}

// 2305DC50: Register word32 aos_cli_event_cb_read_get()
// Called from:
//      aos_loop_proc
word32 aos_cli_event_cb_read_get()
{
	return 0x2305EE6C;
}

