pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305DC5A: Register word32 cli_putstr(Register Eq_2 ra, Register Eq_2 a0, Stack word32 dwArg24, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_342406) a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      ps_cmd
//      aos_cli_printf
word32 cli_putstr(Eq_2 ra, Eq_2 a0, word32 dwArg24, union Eq_2 & s1Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_342406 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ptr32 a3_17;
	word32 a2_104;
	ptr32 a1_20;
	struct Eq_342406 * a4_18;
	ptr32 a5_19;
	Eq_2 a0_16 = strlen(a0, out a1_20, out a2_104, out a3_17, out a4_18, out a5_19);
	Eq_2 s0_23 = 0x00;
	while (s0_23 < a0_16)
	{
		int32 a0_36;
		word32 s0_40;
		ra = aos_write(ra, g_t4200F4F8, a0 + s0_23, a4_18, dwLoc20, dwArg24, out t1, out s0_40, out a0_36, out a1_20, out a4_18, out a5_19);
		if (a0_36 < 0x00)
			break;
		s0_23 = s0_40 + a0_36;
	}
	s1Out = a0_16;
	a1Out = a1_20;
	a2Out = dwArg48;
	a3Out = a3_17;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = a0;
	s3Out = 0x4200F000;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return t1;
}

// 2305DCA0: void ps_cmd(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
void ps_cmd(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s5, Eq_2 s7, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, word32 dwArg14, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgF8, word32 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	Eq_2 a0_17;
	Eq_2 s3_27;
	word32 s1_213;
	word32 a1_214;
	word32 a2_215;
	word32 a3_216;
	word32 a4_217;
	word32 a5_218;
	word32 a6_219;
	word32 s2_220;
	word32 s4_221;
	word32 s8_222;
	pvPortMalloc(ra, s1, 0x0600, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_213, out a0_17, out a1_214, out a2_215, out a3_216, out a4_217, out a5_218, out a6_219, out s2_220, out s3_27, out s4_221, out s8_222);
	if (a0_17 == 0x00)
		0x00 = dwArg38;
	else
	{
		word32 a4_223;
		word32 a5_224;
		strcpy(a0_17, 587988268, out a4_223, out a5_224);
		word32 a1_225;
		word32 a2_226;
		word32 a3_227;
		word32 a4_228;
		word32 a5_229;
		word32 s0_49 = a0_17 + strlen(a0_17, out a1_225, out a2_226, out a3_227, out a4_228, out a5_229);
		word32 a1_230;
		word32 a2_231;
		word32 a3_232;
		word32 a4_233;
		word32 a5_234;
		byte * a0_57 = strlen(587988268, out a1_230, out a2_231, out a3_232, out a4_233, out a5_234) - s0_49;
		while (s0_49 + a0_57 <= 0x0C)
		{
			*s0_49 = 0x20;
			s0_49 = (word32) s0_49 + 1;
			*s0_49 = 0x00;
		}
		word32 a4_235;
		word32 a5_236;
		strcpy(s0_49, 587988276, out a4_235, out a5_236);
		Eq_2 a3_76;
		Eq_2 a4_77;
		Eq_2 a5_117;
		Eq_2 s1_121;
		word32 a1_237;
		word32 a2_238;
		word32 a5_239;
		word32 a1_240;
		word32 a2_241;
		word32 a3_242;
		word32 a4_243;
		word32 s2_244;
		word32 s3_245;
		word32 s4_246;
		word32 s8_247;
		cli_putstr(ra, vTaskList(ra, a0_17, strlen(587988276, out a1_237, out a2_238, out a3_76, out a4_77, out a5_239) + s0_49, a3_76, a4_77, s3_27, s5, s7, s9, mstatus, dwLoc08, dwArg00, dwArg04, dwArg24, dwArg68, dwArg8C, dwArgA8, dwArgB8, dwArgF8, dwArg0118, dwArg0138, dwArg0148, dwArg0188), dwArg14, out s1_121, out a1_240, out a2_241, out a3_242, out a4_243, out a5_117, out s2_244, out s3_245, out s4_246, out s8_247);
		0x00 = dwArg38;
		word32 s0_248;
		word32 s1_249;
		word32 a0_250;
		word32 a1_251;
		word32 a2_252;
		word32 a3_253;
		word32 a4_254;
		word32 a5_255;
		word32 a6_256;
		word32 s4_257;
		word32 t3_258;
		vPortFree(s1_121, dwArg10, a5_117, mstatus, dwArg0158, dwArg0198, out s0_248, out s1_249, out a0_250, out a1_251, out a2_252, out a3_253, out a4_254, out a5_255, out a6_256, out s4_257, out t3_258);
	}
}

// 2305DD2E: Register word32 aos_cli_printf(Register Eq_2 ra, Register (ptr32 Eq_274) a0, Register out ptr32 t1Out, Register out ptr32 a1Out, Register out (ptr32 Eq_342673) a2Out, Register out (ptr32 Eq_342674) a3Out, Register out ptr32 a4Out, Register out Eq_342676 a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_99509) s2Out, Register out ptr32 s3Out, Register out Eq_342680 s4Out, Register out ptr32 s5Out, Register out Eq_342682 s6Out, Register out (ptr32 (arr byte)) s7Out, Register out ptr32 s8Out, Register out (ptr32 Eq_342685) s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 t4Out)
// Called from:
//      proc_onecmd
//      ls_cmd
//      uptime_cmd
//      reset_cmd
//      poweroff_cmd
//      reboot_cmd
//      version_cmd
//      devname_cmd
//      echo_cmd
//      mmem_cmd
//      pmem_cmd
//      help_cmd
//      aos_cli_input_direct
word32 aos_cli_printf(Eq_2 ra, struct Eq_274 * a0, ptr32 & t1Out, ptr32 & a1Out, struct Eq_342673 & a2Out, struct Eq_342674 & a3Out, ptr32 & a4Out, union Eq_342676 & a5Out, ptr32 & a7Out, union Eq_99509 & s2Out, ptr32 & s3Out, union Eq_342680 & s4Out, ptr32 & s5Out, union Eq_342682 & s6Out, byte (& s7Out, ptr32 & s8Out, struct Eq_342685 & s9Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & t4Out)
{
	word32 a0_186;
	word32 a1_187;
	word32 a2_188;
	word32 a3_189;
	word32 a4_190;
	word32 a5_191;
	ptr32 t1_103;
	Eq_2 ra_35 = memset(ra, fp + -304, 0x00, 0x0100, out t1_103, out a0_186, out a1_187, out a2_188, out a3_189, out a4_190, out a5_191);
	Eq_2 a0_40 = 0x00;
	if ((word32) g_b4200F4F5 != 0x00)
	{
		word32 a4_194;
		word32 a5_195;
		strcpy(fp + -304, 0x42017458, out a4_194, out a5_195);
		word32 a1_196;
		word32 a2_197;
		word32 a3_198;
		word32 a4_199;
		word32 a5_200;
		a0_40 = strlen(0x42017458, out a1_196, out a2_197, out a3_198, out a4_199, out a5_200);
	}
	int32 a0_65;
	ptr32 a7_68;
	ptr32 s10_72;
	ptr32 s11_73;
	Eq_342682 s6_77;
	byte (* s7_78)[];
	struct Eq_342685 * s9_80;
	word32 t0_81;
	ptr32 t4_83;
	ptr32 s5_87;
	word32 s0_192;
	word32 s1_193;
	Eq_342680 s4_101;
	ptr32 s3_100;
	union Eq_99509 * s2_155;
	Eq_342676 a5_149;
	struct Eq_342674 * a3_147;
	ptr32 a4_148;
	ptr32 a1_145;
	struct Eq_342673 * a2_146;
	ptr32 s8_102;
	Eq_2 ra_69 = vsnprintf(ra_35, (word32) a0_40 + (fp + -304), 0x0100 - a0_40, a0, fp + -28, dwLocE8, dwLocC8, dwLoc9C, dwLoc80, dwLoc7C, dwLoc58, dwLoc34, out t0_81, out s0_192, out s1_193, out a0_65, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out a7_68, out s2_155, out s3_100, out s4_101, out s5_87, out s6_77, out s7_78, out s8_102, out s9_80, out s10_72, out s11_73, out t4_83);
	if (a0_65 > 0x00)
	{
		word32 s1_201;
		t1_103 = cli_putstr(ra_69, fp + -304, dwLoc011C, out s1_201, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out s2_155, out s3_100, out s4_101, out s8_102);
	}
	t1Out = t1_103;
	a1Out = a1_145;
	a2Out = a2_146;
	a3Out = a3_147;
	a4Out = a4_148;
	a5Out = a5_149;
	a7Out = a7_68;
	s2Out = s2_155;
	s3Out = s3_100;
	s4Out = s4_101;
	s5Out = s5_87;
	s6Out = s6_77;
	s7Out = s7_78;
	s8Out = s8_102;
	s9Out = s9_80;
	s10Out = s10_72;
	s11Out = s11_73;
	t4Out = t4_83;
	return t0_81;
}

// 2305DDB8: Register Eq_2 proc_onecmd(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      aos_cli_input_direct
Eq_2 proc_onecmd(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s3, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	if (a0 <= 0x00)
	{
		s0Out = s0;
		a0Out = 0x00;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s2_212 = a0;
		if (*((word32) g_t4200F4EC + 4) == 0x00)
		{
			word32 s11_613;
			word32 t4_614;
			word32 s4_606;
			word32 s5_607;
			word32 s6_608;
			word32 s9_611;
			word32 s10_612;
			word32 s7_609;
			word32 s8_610;
			word32 a1_599;
			word32 a2_600;
			word32 a3_601;
			word32 a7_604;
			word32 s3_605;
			word32 a4_602;
			word32 a5_603;
			word32 s1_598;
			ra = printf(ra, &g_b230C6900, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_598, out a0, out a1_599, out a2_600, out a3_601, out a4_602, out a5_603, out a7_604, out s2_212, out s3_605, out s4_606, out s5_607, out s6_608, out s7_609, out s8_610, out s9_611, out s10_612, out s11_613, out t4_614);
		}
		Eq_2 s1_58 = *a0;
		word32 a4_597;
		word32 a1_595;
		word32 a2_596;
		Eq_2 a5_101;
		Eq_2 a3_108;
		Eq_2 a0_65 = strchr(a0, 46, out a1_595, out a2_596, out a3_108, out a4_597, out a5_101);
		Eq_2 s5_215 = 0x00;
		Eq_2 s6_216 = *s1_58;
		if (a0_65 != 0x00)
			s5_215 = a0_65 - s6_216;
		Eq_2 s3_213 = 0x00;
		Eq_2 s4_267 = 0x00;
		while (true)
		{
			ptr32 a0_240;
			Eq_2 a5_79 = (word32) a5_101 + 8;
			if (s3_213 >= a5_79 || s4_267 >= a5_79)
				break;
			word32 a2_615;
			word32 a4_616;
			struct Eq_342969 * a0_86 = cli_command_get(s3_213, 0x00, a3_108, out a2_615, out a4_616, out a5_101);
			Eq_2 a0_91 = a0_86->t0000;
			if (a0_91 != 0x00)
			{
				Eq_2 a4_109;
				Eq_2 a0_106;
				if (s5_215 != 0x00)
					a0_106 = strncmp(a0_91, s6_216, s5_215, out a3_108, out a4_109, out a5_101);
				else
				{
					word32 a2_618;
					word32 a1_617;
					a0_106 = strcmp(a0_91, s6_216, out a1_617, out a2_618, out a3_108, out a4_109, out a5_101);
				}
				if (a0_106 == 0x00)
				{
					word32 a0_132;
					struct Eq_343007 * a5_137;
					word32 s1_140;
					word32 s2_141;
					struct Eq_343010 * s3_142;
					word32 s4_143;
					word32 a4_620;
					word32 a3_619;
					aos_malloc(ra, s1_58, 0x0200, a3_108, a4_109, a5_101, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_140, out a0_132, out a3_619, out a4_620, out a5_137, out s2_141, out s3_142, out s4_143);
					s3_142->dw0138 = a0_132;
					int32 a0_149 = a5_137->dw0138;
					if (a0_149 != 0x00)
					{
						word32 a4_156;
						struct Eq_343037 * sp_170;
						word32 t2_197;
						a0_86->ptr0008();
						word32 s7_631;
						Eq_2 a2_205;
						Eq_2 a5_208;
						word32 a7_209;
						word32 s10_210;
						word32 s11_211;
						word32 s8_218;
						word32 s9_219;
						word32 t1_221;
						word32 t4_223;
						word32 s4_630;
						word32 a4_629;
						word32 a3_628;
						word32 a1_627;
						word32 t0_220 = aos_cli_printf(ra, &g_t230C6978, out t1_221, out a1_627, out a2_205, out a3_628, out a4_629, out a5_208, out a7_209, out s2_212, out s3_213, out s4_630, out s5_215, out s6_216, out s7_631, out s8_218, out s9_219, out s10_210, out s11_211, out t4_223);
						word32 a4_231;
						struct Eq_343080 * a5_232;
						word32 a6_233;
						word32 t3_237;
						word32 s1_632;
						word32 a0_633;
						word32 a2_634;
						word32 tp_238 = aos_free(*((word32) a5_208 + 312), a2_205, a5_208, mstatus, sp_170->t0158, sp_170->t0198, out s1_632, out a0_633, out a2_634, out a3_108, out a4_231, out a5_232, out a6_233, out t3_237);
						a5_232->dw0138 = 0x00;
						a0_240 = 0x00;
						goto l2305DE8A;
					}
					else
					{
						word32 a2_637;
						word32 a4_638;
						word32 a7_640;
						word32 a5_639;
						word32 t1_635;
						word32 a1_636;
						word32 s10_645;
						word32 s9_644;
						word32 t4_647;
						word32 s4_641;
						word32 s11_646;
						word32 s7_642;
						word32 s8_643;
						aos_cli_printf(ra, &g_t230BFD0C, out t1_635, out a1_636, out a2_637, out a3_108, out a4_638, out a5_639, out a7_640, out s2_212, out s3_213, out s4_641, out s5_215, out s6_216, out s7_642, out s8_643, out s9_644, out s10_645, out s11_646, out t4_647);
						break;
					}
				}
				s4_267 = (word32) s4_267 + 1;
			}
			s3_213 = (word32) s3_213 + 1;
		}
		a0_240 = 0x01;
l2305DE8A:
		0x00 = (int8) dwArg0128;
		s0Out = dwArgE4;
		a0Out = a0_240;
		a3Out = a3_108;
		s2Out = s2_212;
		s3Out = s3_213;
		s4Out = dwArg78;
		s5Out = s5_215;
		s6Out = s6_216;
		s8Out = s5;
		mstatusOut = mstatus;
		return ra;
	}
}

