pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305DECA: void ls_cmd(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8)
void ls_cmd(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8)
{
	Eq_2 a2_127;
	Eq_2 a5_130;
	struct Eq_343179 * a5_118;
	struct Eq_274 * a0_122;
	Eq_2 a0_33;
	word32 s1_41;
	Eq_2 s2_42;
	word32 a2_987;
	word32 a3_988;
	word32 a5_990;
	word32 a6_991;
	word32 s3_992;
	word32 s4_993;
	word32 s8_994;
	word32 a1_986;
	word32 a4_989;
	pvPortMalloc(ra, a2, 88, a3, a4, a5, mstatus, dwLoc80, dwLoc7C, dwLoc34, dwArg78, dwArgB8, out s1_41, out a0_33, out a1_986, out a2_987, out a3_988, out a4_989, out a5_990, out a6_991, out s2_42, out s3_992, out s4_993, out s8_994);
	Eq_2 s0_156 = a0_33;
	word32 a5_1008;
	word32 a4_1007;
	word32 a2_1005;
	word32 a1_1004;
	word32 a0_1003;
	word32 a5_1001;
	word32 a4_1000;
	word32 a3_999;
	word32 a1_997;
	word32 a0_996;
	word32 t1_995;
	word32 a3_1006;
	word32 t1_1002;
	word32 a2_998;
	Eq_2 ra_71 = memset(memset(ra, 587878404, 0x00, 88, out t1_995, out a0_996, out a1_997, out a2_998, out a3_999, out a4_1000, out a5_1001), fp + -0x00B0, 0x00, 0x0080, out t1_1002, out a0_1003, out a1_1004, out a2_1005, out a3_1006, out a4_1007, out a5_1008);
	if (s1_41 == 0x02)
	{
		union Eq_2 * a0_263;
		union Eq_2 * s2_234;
		Eq_2 ra_261;
		struct Eq_274 * a0_195;
		Eq_2 a3_169;
		Eq_2 ra_175;
		Eq_2 a2_83;
		Eq_2 a3_84;
		Eq_2 a4_85;
		Eq_2 a5_87;
		word32 a1_1009;
		if (strcmp(*((word32) s2_42 + 4), 587987688, out a1_1009, out a2_83, out a3_84, out a4_85, out a5_87) == 0x00)
		{
			word32 a0_464;
			ra_175 = aos_opendir(ra_71, 587987688, a2_83, a3_84, a4_85, a5_87, s2_42, mstatus, dwLocBC, 0x00, dwLoc38, dwArg38, dwArg78, dwArgB8, out s0_156, out a0_464, out a3_169, out mstatus);
			if (a0_464 != 0x00)
			{
				word32 a2_1038;
				word32 a4_1040;
				word32 a7_1042;
				word32 s4_1044;
				word32 s6_1046;
				word32 s9_1049;
				Eq_2 a3_502;
				word32 a0_1036;
				word32 t4_1034;
				word32 s10_1032;
				word32 s8_1030;
				word32 s6_1028;
				word32 s4_1026;
				word32 s2_1024;
				word32 a5_1022;
				word32 a4_1021;
				word32 a2_1020;
				word32 a1_1019;
				word32 a0_1018;
				word32 s1_1017;
				word32 t4_1052;
				word32 s11_1051;
				word32 s10_1050;
				word32 s8_1048;
				word32 s7_1047;
				word32 s5_1045;
				word32 s3_1043;
				word32 a5_1041;
				word32 a3_1039;
				word32 a1_1037;
				word32 s1_1035;
				word32 s11_1033;
				word32 s9_1031;
				word32 s7_1029;
				word32 s5_1027;
				word32 s3_1025;
				word32 a7_1023;
				Eq_2 ra_529 = printf(printf(ra_175, &g_t230BF868, a3_169, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1017, out a0_1018, out a1_1019, out a2_1020, out a3_502, out a4_1021, out a5_1022, out a7_1023, out s2_1024, out s3_1025, out s4_1026, out s5_1027, out s6_1028, out s7_1029, out s8_1030, out s9_1031, out s10_1032, out s11_1033, out t4_1034), &g_t230BF888, a3_502, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1035, out a0_1036, out a1_1037, out a2_1038, out a3_1039, out a4_1040, out a5_1041, out a7_1042, out s2_234, out s3_1043, out s4_1044, out s5_1045, out s6_1046, out s7_1047, out s8_1048, out s9_1049, out s10_1050, out s11_1051, out t4_1052);
				word32 s4_543 = 0x230C0000;
				while (true)
				{
					word32 a0_551;
					ra_261 = aos_readdir(ra_529, s2_234, dwLocC0, dwLoc7C, out a0_551);
					if (a0_551 == 0x00)
						break;
					Eq_2 a2_637;
					Eq_2 a3_638;
					Eq_2 a4_639;
					Eq_2 a5_640;
					Eq_2 s2_647;
					word32 a0_660;
					Eq_2 a3_669;
					ui32 a5_671;
					word32 s3_675;
					word32 s5_676;
					word32 s10_1065;
					word32 s6_1067;
					word32 s11_1066;
					word32 s9_1064;
					word32 s8_1063;
					word32 s7_1062;
					word32 s4_1059;
					word32 s6_1061;
					word32 s5_1060;
					word32 s3_1058;
					word32 a7_1057;
					word32 a1_1056;
					word32 a0_1055;
					word32 s1_1054;
					word32 s0_1053;
					ra_529 = aos_stat(snprintf(ra_261, fp + -0x00B0, 0x007F, s4_543 + -0x0510, dwLocA8, dwLoc88, dwLoc5C, dwLoc40, 0x00, dwLoc18, s7, out s0_1053, out s1_1054, out a0_1055, out a1_1056, out a2_637, out a3_638, out a4_639, out a5_640, out a7_1057, out s2_647, out s3_1058, out s4_1059, out s5_1060, out s6_1061, out s7_1062, out s8_1063, out s9_1064, out s10_1065, out s11_1066), fp + -0x00B0, a2_637, a3_638, a4_639, a5_640, s2_647, mstatus, dwLocBC, 0x00, dwLoc38, dwArg38, dwArg78, dwArgB8, out a0_660, out a3_669, out a5_671, out s2_234, out s3_675, out s4_543, out s5_676, out s6_1067, out mstatus);
					if (a0_660 == 0x00)
					{
						struct Eq_274 * a0_690 = s5_676 + -0x0504;
						if (a5_671 << 0x11 >= 0x00)
							a0_690 = s3_675 + -0x04E8;
						word32 t4_1084;
						word32 s11_1083;
						word32 s8_1080;
						word32 s10_1082;
						word32 s9_1081;
						word32 s7_1079;
						word32 s6_1078;
						word32 s5_1077;
						word32 a5_1074;
						word32 s3_1076;
						word32 a7_1075;
						word32 a4_1073;
						word32 a3_1072;
						word32 a2_1071;
						word32 a1_1070;
						word32 a0_1069;
						word32 s1_1068;
						ra_529 = printf(ra_529, a0_690, a3_669, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1068, out a0_1069, out a1_1070, out a2_1071, out a3_1072, out a4_1073, out a5_1074, out a7_1075, out s2_234, out s3_1076, out s4_543, out s5_1077, out s6_1078, out s7_1079, out s8_1080, out s9_1081, out s10_1082, out s11_1083, out t4_1084);
					}
				}
				a0_263 = s2_234;
				goto l2305DF9A;
			}
			a0_195 = (struct Eq_274 *) &g_t230BFB30;
			goto l2305DFC4;
		}
		Eq_2 a3_104;
		Eq_2 a4_105;
		Eq_2 a2_107;
		word32 a5_1016;
		word32 a5_1014;
		word32 a2_1011;
		word32 a3_1012;
		word32 a1_1015;
		word32 a4_1013;
		word32 a1_1010;
		Eq_2 a0_102 = memcmp(*((word32) s2_42 + 4), 587987784, strlen(587987784, out a1_1010, out a2_1011, out a3_1012, out a4_1013, out a5_1014), out a1_1015, out a2_107, out a3_104, out a4_105, out a5_1016);
		Eq_2 a5_108 = *((word32) s2_42 + 4);
		if (a0_102 == 0x00)
		{
			word32 a0_192;
			ra_175 = aos_opendir(ra_71, a5_108, a2_107, a3_104, a4_105, a5_108, s2_42, mstatus, dwLocBC, 0x00, dwLoc38, dwArg38, dwArg78, dwArgB8, out s0_156, out a0_192, out a3_169, out mstatus);
			if (a0_192 != 0x00)
			{
				Eq_2 a3_203;
				word32 s11_1132;
				word32 s10_1131;
				word32 s9_1130;
				word32 s8_1129;
				word32 s7_1128;
				word32 s6_1127;
				word32 s5_1126;
				word32 s4_1125;
				word32 s3_1124;
				word32 s2_1123;
				word32 a7_1122;
				word32 a5_1121;
				word32 a2_1119;
				word32 a4_1120;
				word32 a0_1117;
				word32 a1_1118;
				word32 s1_1116;
				word32 t4_1133;
				word32 s1_1134;
				word32 a0_1135;
				word32 a1_1136;
				word32 a2_1137;
				word32 a3_1138;
				word32 a4_1139;
				word32 a5_1140;
				word32 a7_1141;
				word32 s4_1142;
				word32 s5_1143;
				word32 s6_1144;
				word32 s7_1145;
				word32 s8_1146;
				word32 s9_1147;
				word32 s10_1148;
				word32 s11_1149;
				word32 t4_1150;
				union Eq_2 * s3_235;
				Eq_2 ra_230 = printf(printf(ra_175, &g_t230BF868, a3_169, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1116, out a0_1117, out a1_1118, out a2_1119, out a3_203, out a4_1120, out a5_1121, out a7_1122, out s2_1123, out s3_1124, out s4_1125, out s5_1126, out s6_1127, out s7_1128, out s8_1129, out s9_1130, out s10_1131, out s11_1132, out t4_1133), &g_t230BF888, a3_203, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1134, out a0_1135, out a1_1136, out a2_1137, out a3_1138, out a4_1139, out a5_1140, out a7_1141, out s2_234, out s3_235, out s4_1142, out s5_1143, out s6_1144, out s7_1145, out s8_1146, out s9_1147, out s10_1148, out s11_1149, out t4_1150);
				word32 s4_244 = 0x230C7000;
				while (true)
				{
					word32 a0_253;
					ra_261 = aos_readdir(ra_230, s3_235, dwLocC0, dwLoc7C, out a0_253);
					if (a0_253 == 0x00)
						break;
					word32 s4_296;
					word32 s5_297;
					word32 t1_1151;
					word32 a0_1152;
					word32 a1_1153;
					word32 a2_1154;
					word32 a3_1155;
					word32 a4_1156;
					word32 a5_1157;
					word32 s0_1158;
					word32 s1_1159;
					word32 a0_1160;
					word32 a1_1161;
					word32 a2_1162;
					word32 a3_1163;
					word32 a4_1164;
					word32 a5_1165;
					word32 a7_1166;
					word32 s2_1167;
					word32 s3_1168;
					word32 s6_1169;
					word32 s7_1170;
					word32 s8_1171;
					word32 s9_1172;
					word32 s10_1173;
					word32 s11_1174;
					Eq_2 ra_289 = snprintf(memset(ra_261, fp + -0x00B0, 0x00, 0x0080, out t1_1151, out a0_1152, out a1_1153, out a2_1154, out a3_1155, out a4_1156, out a5_1157), fp + -0x00B0, 0x007F, s4_244 + -0x0688, dwLocA8, dwLoc88, dwLoc5C, dwLoc40, 0x00, dwLoc18, s7, out s0_1158, out s1_1159, out a0_1160, out a1_1161, out a2_1162, out a3_1163, out a4_1164, out a5_1165, out a7_1166, out s2_1167, out s3_1168, out s4_296, out s5_297, out s6_1169, out s7_1170, out s8_1171, out s9_1172, out s10_1173, out s11_1174);
					word32 a1_1175;
					word32 a2_1176;
					word32 a3_1177;
					word32 a4_1178;
					word32 a5_1179;
					if ((word32) ((word32) strlen(fp + -0x00B0, out a1_1175, out a2_1176, out a3_1177, out a4_1178, out a5_1179) + (fp + -48) + -0x0081) != s5_297)
					{
						word32 a1_1204;
						word32 a2_1205;
						word32 a3_1206;
						word32 a4_1207;
						word32 a5_1208;
						(word32) strlen(fp + -0x00B0, out a1_1204, out a2_1205, out a3_1206, out a4_1207, out a5_1208) + (fp + -48) + 0x0F80 = (word32) (byte) s5_297;
					}
					Eq_2 a2_354;
					Eq_2 a3_355;
					Eq_2 a4_356;
					Eq_2 a5_357;
					Eq_2 s2_364;
					word32 s7_369;
					word32 a0_379;
					Eq_2 a3_388;
					ui32 a5_390;
					word32 s6_396;
					word32 a1_1180;
					word32 a2_1181;
					word32 a3_1182;
					word32 a4_1183;
					word32 a5_1184;
					word32 a1_1185;
					word32 a2_1186;
					word32 a3_1187;
					word32 a4_1188;
					word32 a5_1189;
					word32 s0_1190;
					word32 s1_1191;
					word32 a0_1192;
					word32 a1_1193;
					word32 a7_1194;
					word32 s3_1195;
					word32 s4_1196;
					word32 s5_1197;
					word32 s6_1198;
					word32 s8_1199;
					word32 s9_1200;
					word32 s10_1201;
					word32 s11_1202;
					word32 s5_1203;
					ra_230 = aos_stat(snprintf(ra_289, (word32) strlen(fp + -0x00B0, out a1_1180, out a2_1181, out a3_1182, out a4_1183, out a5_1184) + (fp + -0x00B0), 0x007F - strlen(fp + -0x00B0, out a1_1185, out a2_1186, out a3_1187, out a4_1188, out a5_1189), s4_296 + -0x0688, dwLocA8, dwLoc88, dwLoc5C, dwLoc40, 0x00, dwLoc18, s7, out s0_1190, out s1_1191, out a0_1192, out a1_1193, out a2_354, out a3_355, out a4_356, out a5_357, out a7_1194, out s2_364, out s3_1195, out s4_1196, out s5_1197, out s6_1198, out s7_369, out s8_1199, out s9_1200, out s10_1201, out s11_1202), fp + -0x00B0, a2_354, a3_355, a4_356, a5_357, s2_364, mstatus, dwLocBC, 0x00, dwLoc38, dwArg38, dwArg78, dwArgB8, out a0_379, out a3_388, out a5_390, out s2_234, out s3_235, out s4_244, out s5_1203, out s6_396, out mstatus);
					if (a0_379 == 0x00)
					{
						struct Eq_274 * a0_409 = s7_369 + -0x0504;
						if (a5_390 << 0x11 >= 0x00)
							a0_409 = s6_396 + -0x04E8;
						word32 s1_1209;
						word32 a0_1210;
						word32 a1_1211;
						word32 a2_1212;
						word32 a3_1213;
						word32 a4_1214;
						word32 a5_1215;
						word32 a7_1216;
						word32 s5_1217;
						word32 s6_1218;
						word32 s7_1219;
						word32 s8_1220;
						word32 s9_1221;
						word32 s10_1222;
						word32 s11_1223;
						word32 t4_1224;
						ra_230 = printf(ra_230, a0_409, a3_388, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1209, out a0_1210, out a1_1211, out a2_1212, out a3_1213, out a4_1214, out a5_1215, out a7_1216, out s2_234, out s3_235, out s4_244, out s5_1217, out s6_1218, out s7_1219, out s8_1220, out s9_1221, out s10_1222, out s11_1223, out t4_1224);
					}
				}
				a0_263 = s3_235;
l2305DF9A:
				s0_156 = aos_closedir(ra_261, a0_263, s2_234, mstatus, dwLoc7C, out a2_127, out a5_130);
				goto l2305DF9E;
			}
			a0_195 = (struct Eq_274 *) &g_t230BFB50;
l2305DFC4:
			word32 s1_1225;
			word32 a0_1226;
			word32 a1_1227;
			word32 a3_1228;
			word32 a4_1229;
			word32 a7_1230;
			word32 s2_1231;
			word32 s3_1232;
			word32 s4_1233;
			word32 s5_1234;
			word32 s6_1235;
			word32 s7_1236;
			word32 s8_1237;
			word32 s9_1238;
			word32 s10_1239;
			word32 s11_1240;
			word32 t4_1241;
			printf(ra_175, a0_195, a3_169, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_1225, out a0_1226, out a1_1227, out a2_127, out a3_1228, out a4_1229, out a5_130, out a7_1230, out s2_1231, out s3_1232, out s4_1233, out s5_1234, out s6_1235, out s7_1236, out s8_1237, out s9_1238, out s10_1239, out s11_1240, out t4_1241);
l2305DF9E:
			word32 t3_1111;
			word32 a6_1109;
			word32 s4_1110;
			word32 a5_1108;
			word32 a4_1107;
			word32 a3_1106;
			word32 a2_1105;
			word32 a1_1104;
			word32 a0_1103;
			word32 s1_1102;
			word32 s0_1101;
			vPortFree(s0_156, a2_127, a5_130, mstatus, dwArg98, dwArgD8, out s0_1101, out s1_1102, out a0_1103, out a1_1104, out a2_1105, out a3_1106, out a4_1107, out a5_1108, out a6_1109, out s4_1110, out t3_1111);
			return;
		}
		word32 a4_1115;
		word32 a2_1113;
		word32 a3_1114;
		word32 a1_1112;
		if (strcmp(a5_108, 588016080, out a1_1112, out a2_1113, out a3_1114, out a4_1115, out a5_118) == 0x00)
		{
l2305E0D2:
			s0_156 = inode_forearch_name(ra_71, &g_t2305DA46, fp + -0x00B4, a5_118, out a2_127, out a5_130);
			goto l2305DF9E;
		}
		a0_122 = (struct Eq_274 *) &g_t230BFB68;
	}
	else
	{
		a5_118 = (struct Eq_343179 *) 0x01;
		if (s1_41 == 0x01)
			goto l2305E0D2;
		a0_122 = (struct Eq_274 *) &g_t230BF814;
	}
	word32 s10_1098;
	word32 t4_1100;
	word32 s11_1099;
	word32 s9_1097;
	word32 s8_1096;
	word32 s7_1095;
	word32 s4_1092;
	word32 s6_1094;
	word32 s5_1093;
	word32 s3_1091;
	word32 s2_1090;
	word32 a7_1089;
	word32 a1_1086;
	word32 a4_1088;
	word32 a3_1087;
	word32 t1_1085;
	aos_cli_printf(ra_71, a0_122, out t1_1085, out a1_1086, out a2_127, out a3_1087, out a4_1088, out a5_130, out a7_1089, out s2_1090, out s3_1091, out s4_1092, out s5_1093, out s6_1094, out s7_1095, out s8_1096, out s9_1097, out s10_1098, out s11_1099, out t4_1100);
	goto l2305DF9E;
}

// 2305E100: void uptime_cmd(Register Eq_2 ra, Register Eq_2 a3)
void uptime_cmd(Eq_2 ra, Eq_2 a3)
{
	Eq_2 a0_15;
	Eq_2 a1_16;
	word32 a2_211;
	word32 a4_212;
	word32 a5_213;
	aos_now_ms(a3, out a0_15, out a1_16, out a2_211, out a4_212, out a5_213);
	word32 t1_214;
	word32 a1_215;
	word32 a2_216;
	word32 a3_217;
	word32 a4_218;
	word32 a5_219;
	word32 a7_220;
	word32 s2_221;
	word32 s3_222;
	word32 s4_223;
	word32 s5_224;
	word32 s6_225;
	word32 s7_226;
	word32 s8_227;
	word32 s9_228;
	word32 s10_229;
	word32 s11_230;
	word32 t4_231;
	aos_cli_printf(ra, &g_t230BFEF8, out t1_214, out a1_215, out a2_216, out a3_217, out a4_218, out a5_219, out a7_220, out s2_221, out s3_222, out s4_223, out s5_224, out s6_225, out s7_226, out s8_227, out s9_228, out s10_229, out s11_230, out t4_231);
	Eq_208947 a1_56;
	word32 a5_232;
	__moddi3(__divdi3(a0_15, a1_16, 0x0EFFFA60, 0x00, out a1_56, out a5_232), a1_56, 60, 0x00);
	Eq_208947 a1_85;
	word32 a5_233;
	__moddi3(__divdi3(a0_15, a1_16, 3600000, 0x00, out a1_85, out a5_233), a1_85, 0x18, 0x00);
	word32 a1_234;
	word32 a5_235;
	__divdi3(a0_15, a1_16, 86400000, 0x00, out a1_234, out a5_235);
	Eq_208947 a1_133;
	word32 a5_236;
	__moddi3(__divdi3(a0_15, a1_16, 1000, 0x00, out a1_133, out a5_236), a1_133, 60, 0x00);
	word32 t1_237;
	word32 a1_238;
	word32 a2_239;
	word32 a3_240;
	word32 a4_241;
	word32 a5_242;
	word32 a7_243;
	word32 s2_244;
	word32 s3_245;
	word32 s4_246;
	word32 s5_247;
	word32 s6_248;
	word32 s7_249;
	word32 s8_250;
	word32 s9_251;
	word32 s10_252;
	word32 s11_253;
	word32 t4_254;
	aos_cli_printf(ra, &g_t230BFF10, out t1_237, out a1_238, out a2_239, out a3_240, out a4_241, out a5_242, out a7_243, out s2_244, out s3_245, out s4_246, out s5_247, out s6_248, out s7_249, out s8_250, out s9_251, out s10_252, out s11_253, out t4_254);
}

// 2305E1B8: void reset_cmd(Register Eq_2 ra, Register ptr32 mstatus)
void reset_cmd(Eq_2 ra, ptr32 mstatus)
{
	word32 t1_35;
	word32 a1_36;
	word32 a2_37;
	word32 a3_38;
	word32 a4_39;
	word32 a5_40;
	word32 a7_41;
	word32 s2_42;
	word32 s3_43;
	word32 s4_44;
	word32 s5_45;
	word32 s6_46;
	word32 s7_47;
	word32 s8_48;
	word32 s9_49;
	word32 s10_50;
	word32 s11_51;
	word32 t4_52;
	aos_cli_printf(ra, &g_t230BFDA8, out t1_35, out a1_36, out a2_37, out a3_38, out a4_39, out a5_40, out a7_41, out s2_42, out s3_43, out s4_44, out s5_45, out s6_46, out s7_47, out s8_48, out s9_49, out s10_50, out s11_51, out t4_52);
	hal_sys_reset(mstatus);
}

