pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305E670: Register Eq_2 cli_getchar(Register Eq_2 ra, Register ptr32 a0, Stack Eq_2 dwArg34, Register out (ptr32 (arr Eq_346942)) s0Out, Register out (ptr32 Eq_285637) s1Out, Register out Eq_345802 a0Out, Register out Eq_345803 s4Out, Register out ptr32 s8Out)
// Called from:
//      aos_cli_input_direct
Eq_2 cli_getchar(Eq_2 ra, ptr32 a0, Eq_2 dwArg34, Eq_346942 (& s0Out, union Eq_285637 & s1Out, union Eq_345802 & a0Out, union Eq_345803 & s4Out, ptr32 & s8Out)
{
	Eq_345802 a0_39;
	word32 a5_82;
	word32 a4_81;
	word32 a3_80;
	word32 a2_79;
	word32 a1_78;
	word32 a0_77;
	word32 t1_76;
	Eq_2 ra_20 = memset(ra, fp + -76, 0x00, 60, out t1_76, out a0_77, out a1_78, out a2_79, out a3_80, out a4_81, out a5_82);
	up32 a0_29;
	Eq_345803 s4_32;
	ptr32 s8_33;
	word32 a2_83;
	word32 a4_84;
	word32 a5_85;
	Eq_346942 (* s0_30)[] = hal_uart_recv_II(fp + -76, a0, 0x01, fp + -80, dwArg34, out a0_29, out a2_83, out a4_84, out a5_85, out s4_32, out s8_33);
	union Eq_285637 * dwLoc4C_57 = SEQ(nLoc4B, 0x00);
	if (a0_29 == 0x00)
	{
		0x00 = dwLoc0C;
		a0_39 = (word32) (a0_29 < ~0x01);
	}
	else
		a0_39.u0 = 0x00;
	s0Out = s0_30;
	s1Out = dwLoc4C_57;
	a0Out = a0_39;
	s4Out = s4_32;
	s8Out = s8_33;
	return ra_20;
}

// 2305E6AE: Register Eq_2 cli_main_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register int32 a5, Register Eq_2 s6, Register ptr32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_99509) s2Out, Register out Eq_2 s6Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      console_cb_read
//      aos_cli_input_direct
Eq_2 cli_main_input(Eq_2 ra, Eq_2 s0, Eq_2 a0, int32 a5, Eq_2 s6, ptr32 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_99509 & s2Out, union Eq_2 & s6Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	Eq_2 s6_110;
	struct Eq_274 * a0_1252;
	Eq_2 s9_113 = g_t4200F4EC;
	byte bLoc50_1465 = (byte) s10;
	if (s9_113 != 0x38)
	{
		Eq_2 s7_111 = a0;
		Eq_2 s1_103 = 0x4200F4EC;
		int32 s4_108 = 0x00;
		word32 s8_112 = 0x230C7000;
		s6_110 = s6;
		do
		{
			Eq_2 s0_54;
			if (s7_111 != 0x00)
			{
				s0_54 = dwArg74;
				if (s4_108 >= a5)
					goto l2305EBEC;
				++s4_108;
				bLoc50_1465 = (byte) (word32) *((word32) s7_111 + s4_108);
			}
			else
			{
				ra = cli_getchar(ra, fp + -80, s0, out s0_54, out s1_103, out a0, out s4_108, out s8_112);
				if (a0 != 0x01)
					goto l2305EBEC;
			}
			struct Eq_345921 * a4_72 = (word32) bLoc50_1465;
			if (a4_72 == (struct Eq_345921 *) 0x0A || a4_72 == (struct Eq_345921 *) 0x0D)
			{
				Eq_285637 s2_779 = *s1_103;
				Mem782[s0_54 + Mem71[s9_113 + 52:int32]:byte] = 0x00;
				((word32) s9_113 + 52)->u0 = 0x00;
				word32 a5_2870;
				word32 a3_2868;
				word32 a2_2867;
				word32 a1_2866;
				word32 a4_2869;
				if (strlen((word32) s2_779.u0 + 56, out a1_2866, out a2_2867, out a3_2868, out a4_2869, out a5_2870) != 0x00)
				{
					word32 s6_815;
					Eq_2 a2_826;
					Eq_2 a1_827;
					Eq_285637 s3_792 = *s1_103;
					struct Eq_346481 * a5_798;
					word32 a2_2973;
					word32 a3_2974;
					word32 a4_2975;
					word32 a1_2972;
					Eq_2 a0_795 = strlen((word32) s3_792.u0 + 56, out a1_2972, out a2_2973, out a3_2974, out a4_2975, out a5_798);
					int32 s0_804 = a5_798->dw0140;
					a5_798->dw013C = s0_804;
					int32 s0_808 = s0_804 + ((word32) a0_795 + 1);
					Eq_2 s4_806 = 0x0100 - s0_804;
					Eq_2 a0_809 = a5_798 + (s0_804 + 0x0144) / 0x0144;
					int32 s0_810 = s0_808 + ~0x00;
					if (s4_806 >= (word32) a0_795 + 1)
					{
						s6_815 = (word32) (&(a5_798 + (s0_808 + ~0x00) / 0x0144)->dw0140)[1];
						a2_826 = (word32) a0_795 + 1;
						a1_827 = (word32) s3_792.u0 + 56;
					}
					else
					{
						s0_810 = s0_808 + ~0x00 | 0x0100;
						s6_815 = (word32) (&(a5_798 + s0_810 / 0x0144)->dw0140)[1];
						word32 a4_2981;
						word32 a2_2979;
						word32 a3_2980;
						word32 a5_2982;
						strncpy(a0_809, (word32) s3_792.u0 + 56, s4_806, out a2_2979, out a3_2980, out a4_2981, out a5_2982);
						a2_826 = (word32) a0_795 + 1 - s4_806;
						a1_827 = (word32) s4_806 + ((word32) s3_792.u0 + 56);
						a0_809 = (word32) a0_809 + 0x0144;
					}
					struct Eq_346527 * a4_836;
					word32 a5_2978;
					word32 a3_2977;
					word32 a2_2976;
					strncpy(a0_809, a1_827, a2_826, out a2_2976, out a3_2977, out a4_836, out a5_2978);
					int32 s0_846 = s0_810 + 0x01;
					a4_836->dw0140 = s0_846 | 0x0100;
					int32 s0_848 = s0_846 | 0x0100;
					if (s6_815 != 0x00)
					{
						while (true)
						{
							struct Eq_346549 * a5_856 = a4_836 + s0_848 / 0x0144;
							if ((word32) a5_856->b0144 == 0x00)
								break;
							a5_856->b0144 = 0x00;
							s0_848 = s0_848 + 0x01 | 0x0100;
						}
					}
				}
				word32 a2_2881;
				word32 a1_2886;
				word32 a1_2873;
				word32 t1_2871;
				word32 a0_2872;
				word32 a0_2879;
				word32 a2_2874;
				word32 a3_2882;
				word32 t1_2878;
				word32 a5_2877;
				word32 a4_2876;
				word32 a1_2880;
				word32 a3_2875;
				word32 a5_2890;
				word32 a2_2887;
				word32 a5_2884;
				word32 t1_2885;
				word32 a4_2889;
				word32 a3_2888;
				word32 a4_2883;
				Eq_2 a0_1013;
				ra = memset(memset(memset(ra, 1107391320, 0x00, 0x0100, out t1_2871, out a0_2872, out a1_2873, out a2_2874, out a3_2875, out a4_2876, out a5_2877), fp + -80, 0x00, 0x10, out t1_2878, out a0_2879, out a1_2880, out a2_2881, out a3_2882, out a4_2883, out a5_2884), fp + -84, 0x00, 0x04, out t1_2885, out a0_1013, out a1_2886, out a2_2887, out a3_2888, out a4_2889, out a5_2890);
				struct Eq_346017 * a5_1028 = null;
				int32 * s11_1048 = fp + -80;
				int32 s8_1044 = 0x00;
				Eq_2 s6_1123 = 32;
				do
				{
					Eq_2 a7_1002;
					ui32 a3_943;
					Eq_2 s0_924 = a5_1028 + ((word32) s2_779.u0 + 56);
					Eq_346031 a3_926 = (word32) *s0_924;
					if (a3_926 != 32)
					{
						if (a3_926 <= 32)
						{
							if (a3_926 != 0x00)
								goto l2305E78E;
							ui32 a3_1049 = (word32) bLoc54;
							if ((a3_1049 & 2) != 0x00)
								goto l2305EE5E;
							bLoc54 = (byte) (a3_1049 | 4);
							goto l2305ED18;
						}
						if (a3_926 != 0x0022)
						{
							if (a3_926 == 59)
							{
								ui32 a3_992 = (word32) bLoc54;
								if (a5_1028 != null)
								{
									a7_1002 = (char *) a5_1028 - 1 + ((word32) s2_779.u0 + 56);
									if ((word32) *a7_1002 == 92 && (a3_992 & 1) != 0x00)
										goto l2305EDC0;
								}
								if ((a3_992 & 0x02) != 0x00)
									goto l2305EE5E;
								if ((a3_992 & 0x02 & 0x03) == 0x01)
								{
									*s0_924 = 0x00;
									bLoc54 = (byte) ((word32) bLoc54 & ~0x01);
									if (*s11_1048 != 0x00)
									{
										++s8_1044;
										if (s8_1044 <= 0x03)
											s11_1048 = (s8_1044 << 0x02) + (fp + -80);
									}
								}
							}
							else
							{
l2305E78E:
								ui32 a3_1055 = (word32) bLoc54;
								if ((a3_1055 & 1) == 0x00)
								{
									int32 a2_1058 = *s11_1048;
									*s11_1048 = a2_1058 + 1;
									*s0_924 = ((s8_1044 << 0x04) + a2_1058 << 2) + 1107391320;
									bLoc54 = (byte) (a3_1055 | 1);
								}
							}
							goto l2305ED18;
						}
						if (a5_1028 != null)
						{
							a7_1002 = (char *) a5_1028 - 1 + ((word32) s2_779.u0 + 56);
							a3_926 = (word32) *a7_1002;
							if (a3_926 != 92)
								goto l2305EDDE;
							ui32 a3_948 = (word32) bLoc54;
							a3_926 = a3_948 & 0x01;
							if ((a3_948 & 0x01) != 0x00)
								goto l2305EDC0;
						}
l2305EDDE:
						ui32 a3_954 = a3_926 & 0x03;
						if (a3_954 == 0x01)
							goto l2305ED18;
						if (a3_954 == 0x02)
							goto l2305EE5E;
						if (a3_954 == 0x00)
						{
							int32 a2_972 = *s11_1048;
							*s11_1048 = a2_972 + 1;
							(a5_1028 + 1)[(word32) s2_779.u0 + 56] = (struct Eq_346017) (((s8_1044 << 0x04) + a2_972 << 2) + 1107391320);
							bLoc54 = (byte) ((word32) bLoc54 & ~0x03 | 3);
							goto l2305ED18;
						}
						if (a3_954 != 0x03)
							goto l2305ED18;
						a3_943 = (word32) bLoc54 & ~0x03;
						goto l2305EE24;
					}
					if (a5_1028 != null)
					{
						a7_1002 = (char *) a5_1028 - 1 + ((word32) s2_779.u0 + 56);
						a3_926 = (word32) *a7_1002;
						if (a3_926 != 92)
							goto l2305EE48;
						ui32 a3_933 = (word32) bLoc54;
						a3_926 = a3_933 & 0x01;
						if ((a3_933 & 0x01) == 0x00)
							goto l2305EE48;
l2305EDC0:
						struct Eq_346017 * a6_1020;
						word32 a2_2967;
						word32 a3_2963;
						word32 a2_2962;
						word32 a1_2961;
						word32 a4_2964;
						word32 a3_2968;
						word32 a4_2969;
						word32 a1_2966;
						word32 a5_2965;
						word32 a5_2970;
						word32 a7_2971;
						memcpy(a7_1002, s6, (word32) strlen(s0_924, out a1_2961, out a2_2962, out a3_2963, out a4_2964, out a5_2965) + 1, out a1_2966, out a2_2967, out a3_2968, out a4_2969, out a5_2970, out a6_1020, out a7_2971);
						a0_1013 = a7_1002;
						a5_1028 = a6_1020;
					}
					else
					{
l2305EE48:
						if ((a3_926 & 0x03) == 0x01)
						{
							a3_943 = (word32) bLoc54 & ~0x01;
l2305EE24:
							*s0_924 = 0x00;
							bLoc54 = (byte) a3_943;
						}
					}
l2305ED18:
					ui32 a3_1073 = (word32) bLoc54;
					if ((a3_1073 & 4) != 0x00)
						break;
					++a5_1028;
				} while (a5_1028 <= (struct Eq_346017 *) 0x00FF && (s8_1044 <= 0x03 && *s11_1048 <= 0x0F));
				Eq_2 a3_1098 = a3_1073 & 0x02;
				if ((a3_1073 & 0x02) == 0x00)
				{
					Eq_2 s3_1111 = 0x00;
					do
					{
						word32 s2_1137;
						ui32 s3_1138;
						int32 s4_1139;
						int32 s5_1140;
						int32 s8_1142;
						word32 s0_2891;
						ra = proc_onecmd(ra, a0_1013, a3_1098, s3_1111, s6_1123, mstatus, 0x00, 0x00, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, dwArg98, dwArgB8, dwArgD8, out s0_2891, out a0_1013, out a3_1098, out s2_1137, out s3_1138, out s4_1139, out s5_1140, out s6_1123, out s8_1142, out mstatus);
						s3_1111 = s3_1138 | a0_1013;
					} while (s8_1142 >= s4_1139 && s4_1139 != s5_1140);
					if (s3_1111 == 0x01)
					{
						if (s2_1137 != 0x00)
						{
							word32 t1_2892;
							word32 a1_2893;
							word32 s10_2907;
							word32 s9_2906;
							word32 s5_2902;
							word32 s6_2903;
							word32 a7_2898;
							word32 s7_2904;
							word32 s3_2900;
							word32 a5_2897;
							word32 s2_2899;
							word32 s8_2905;
							word32 a2_2894;
							word32 a3_2895;
							word32 a4_2896;
							word32 s4_2901;
							word32 s11_2908;
							word32 t4_2909;
							aos_cli_printf(ra, &g_t230BF97C, out t1_2892, out a1_2893, out a2_2894, out a3_2895, out a4_2896, out a5_2897, out a7_2898, out s2_2899, out s3_2900, out s4_2901, out s5_2902, out s6_2903, out s7_2904, out s8_2905, out s9_2906, out s10_2907, out s11_2908, out t4_2909);
						}
						goto l2305ED80;
					}
					if (s3_1111 != 0x02)
					{
l2305ED80:
						word32 s5_2920;
						word32 s7_2922;
						word32 s6_2921;
						word32 a5_2915;
						word32 t1_2910;
						word32 a1_2911;
						word32 a3_2913;
						word32 s2_2917;
						word32 a7_2916;
						word32 s3_2918;
						word32 t4_2927;
						word32 a4_2914;
						word32 s4_2919;
						word32 s10_2925;
						word32 a2_2912;
						word32 s9_2924;
						word32 s8_2923;
						word32 s11_2926;
						aos_cli_printf(ra, &g_b230C6900, out t1_2910, out a1_2911, out a2_2912, out a3_2913, out a4_2914, out a5_2915, out a7_2916, out s2_2917, out s3_2918, out s4_2919, out s5_2920, out s6_2921, out s7_2922, out s8_2923, out s9_2924, out s10_2925, out s11_2926, out t4_2927);
						g_b42017458 = 0x00;
						g_b4200F4F5 = 0x00;
						a0_1252 = (struct Eq_274 *) &g_t230BF950;
						goto l2305E7C4;
					}
				}
l2305EE5E:
				word32 s2_2950;
				word32 s4_2952;
				word32 a5_2948;
				word32 a4_2947;
				word32 s5_2953;
				word32 s6_2954;
				word32 a7_2949;
				word32 a2_2945;
				word32 t1_2943;
				word32 s11_2959;
				word32 a3_2946;
				word32 s3_2951;
				word32 s9_2957;
				word32 a1_2944;
				word32 s8_2956;
				word32 s7_2955;
				word32 s10_2958;
				word32 t4_2960;
				aos_cli_printf(ra, &g_t230BF998, out t1_2943, out a1_2944, out a2_2945, out a3_2946, out a4_2947, out a5_2948, out a7_2949, out s2_2950, out s3_2951, out s4_2952, out s5_2953, out s6_2954, out s7_2955, out s8_2956, out s9_2957, out s10_2958, out s11_2959, out t4_2960);
				goto l2305ED80;
			}
			a5 = 0x4200F000;
			a0.u0 = 0x1B;
			s2 = (union Eq_99509 *) &g_b4200F4F4;
			if (a4_72 == (struct Eq_345921 *) 0x1B)
			{
				g_b4200F4F4 = 0x01;
				g_b4200FCAC = ~0x00;
				g_b4200FCAD = ~0x00;
				continue;
			}
			if ((int32) g_b4200F4F4 != 0x00)
			{
				struct Eq_274 * a0_632;
				Eq_2 a3_628;
				int32 a1_439 = (int32) g_b4200ECAC;
				if (a1_439 >= 0x00)
				{
					if ((int32) g_b4200ECAD < 0x00)
					{
						int32 a2_444 = (int32) (byte) a4_72;
						g_b4200ECAD = (byte) a2_444;
						if (a2_444 == 116)
						{
							g_b42017458 = 0x1B;
							g_b42017459 = (byte) a1_439;
							g_b4200F4F5 = 0x02;
						}
					}
					struct Eq_346720 * a2_456 = (int32) g_b4200ECAD;
					a0 = a2_456 & 0x00FF;
					if (((a2_456 & 0x00FF) + -65 & 0x00FF) > 0x01)
					{
						byte * s5_613 = &g_b42017458;
						byte * s3_614 = &g_b4200F4F5;
						if (a2_456 != (struct Eq_346720 *) 116)
						{
							Mem665[Mem455[s9_113 + 52:int32] + s0_54:byte] = 0x1B;
							Eq_2 a4_666 = *((word32) s9_113 + 52);
							*((word32) s9_113 + 52) = (word32) a4_666 + 1;
							*((word32) s0_54 + ((word32) a4_666 + 1)) = (byte) a1_439;
							Eq_2 a4_672 = *((word32) s9_113 + 52);
							*((word32) s9_113 + 52) = (word32) a4_672 + 1;
							*((word32) s0_54 + ((word32) a4_672 + 1)) = (byte) (a2_456 & 0x00FF);
							Eq_2 a4_677 = *((word32) s9_113 + 52);
							*((word32) s9_113 + 52) = (word32) a4_677 + 1;
							s1_103 = *((word32) a4_677 + 1);
							if (*((word32) a4_677 + 5) == 0x00)
							{
								word32 t4_2998;
								word32 a2_2993;
								word32 a1_2992;
								word32 s11_2997;
								word32 a4_2995;
								word32 a3_2994;
								word32 a7_2996;
								ra = printf(ra, &g_t230BF908, 0x1B, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0, out a1_2992, out a2_2993, out a3_2994, out a4_2995, out a5, out a7_2996, out s2, out s3_614, out s4_108, out s5_613, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_2997, out t4_2998);
							}
							*s5_613 = 0x00;
							*s3_614 = 0x00;
						}
						else
						{
							Eq_2 a3_615 = (word32) g_b4200F4F5;
							if (a3_615 > 63)
							{
								g_b42017458 = 0x00;
								g_b4200F4F5 = 0x00;
								g_b4200F4F4 = 0x00;
								word32 s11_3006;
								word32 s5_3005;
								word32 a1_2999;
								word32 a4_3002;
								word32 a3_3001;
								word32 a2_3000;
								word32 a7_3003;
								word32 s3_3004;
								word32 t4_3007;
								ra = printf(ra, &g_t230BF918, a3_615, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0, out a1_2999, out a2_3000, out a3_3001, out a4_3002, out a5, out a7_3003, out s2, out s3_3004, out s4_108, out s5_3005, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_3006, out t4_3007);
								continue;
							}
							*((word32) a3_615 + 1107391576) = (byte) a4_72;
							word32 a2_619 = a3_615 + 1 & 0x00FF;
							g_b4200F4F5 = (byte) a2_619;
							if (a4_72 != (struct Eq_345921 *) 0x006D)
								continue;
							s1_103 = a4_72->t0000;
							a2_619->b42017458 = 0x00;
							word32 a4_627 = a4_72->dw0004;
							Mem629[0x4200F4F5:byte] = SLICE(a3_615 + 0x02, byte, 0);
							a3_628 = a3_615 + 0x02;
							if (a4_627 == 0x00)
							{
								a0_632 = (struct Eq_274 *) &g_t230C6978;
l2305E84E:
								word32 a4_2986;
								word32 a3_2985;
								word32 a1_2983;
								word32 a2_2984;
								word32 a7_2987;
								word32 s3_2988;
								word32 s5_2989;
								word32 s11_2990;
								word32 t4_2991;
								ra = printf(ra, a0_632, a3_628, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0, out a1_2983, out a2_2984, out a3_2985, out a4_2986, out a5, out a7_2987, out s2, out s3_2988, out s4_108, out s5_2989, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_2990, out t4_2991);
							}
						}
					}
					else
					{
						Eq_2 a3_464;
						Eq_2 a4_492;
						if (a2_456 == (struct Eq_346720 *) 65)
						{
							a3_464 = (a2_456 & 0x00FF)->t013C;
							int32 a4_507 = (word32) a3_464 + 0x00FF;
							while (true)
							{
								Eq_2 a4_510 = a4_507 | 0x0100;
								if (CONVERT(Mem455[(a2_456 & 0x00FF) + a4_510 + 0x0144:byte], byte, word32) != 0x00)
									break;
								if (a3_464 == a4_510)
									goto l2305E93C;
								a4_507 = (word32) a4_510 + 0x00FF;
							}
							if (a3_464 != a4_510)
							{
								do
								{
									int32 a4_518 = (word32) a4_510 + 0x00FF;
									a4_510 = a4_518 | 0x0100;
								} while ((word32) ((word32) (a2_456 & 0x00FF) + (a4_518 | 0x0100) + 0x0144) != 0x00);
								a4_510 = (a4_518 | 0x0100) + 0x01 | 0x0100;
							}
l2305E93C:
							(a2_456 & 0x00FF)->t013C = a4_510;
							a4_492 = s0_54;
							while (true)
							{
								word32 a2_540 = CONVERT(Mem539[(a2_456 & 0x00FF) + a3_464 + 0x0144:byte], byte, word32);
								if (a2_540 == 0x00)
									break;
								a4_492 = (word32) a4_492 + 1;
								*((word32) a4_492 + 0x0FFF) = (byte) a2_540;
								a3_464 = (word32) a3_464 + 1 | 0x0100;
							}
						}
						else
						{
							a3_464 = a2_456->t013C;
							Eq_2 a4_465 = a3_464;
							while (CONVERT(Mem455[a2_456 + a4_465 + 0x0144:byte], byte, word32) != 0x00)
								a4_465 = (word32) a4_465 + 1 | 0x0100;
							if (a3_464 != a4_465)
							{
								do
								{
									int32 a4_477 = (word32) a4_465 + 1;
									a4_465 = a4_477 | 0x0100;
								} while ((word32) *((char *) &(a2_456 + (a4_477 | 0x0100) / 320)->t013C + 8) == 0x00);
							}
							a2_456->t013C = a4_465;
							a4_492 = s0_54;
							while (true)
							{
								word32 a1_497 = CONVERT(Mem496[a2_456 + a3_464 + 0x0144:byte], byte, word32);
								if (a1_497 == 0x00)
									break;
								a4_492 = (word32) a4_492 + 1;
								*((word32) a4_492 + 0x0FFF) = (byte) a1_497;
								a3_464 = (word32) a3_464 + 1 | 0x0100;
							}
						}
						*a4_492 = 0x00;
						word32 a0_3008;
						word32 s5_3016;
						word32 a2_3010;
						word32 a1_3009;
						word32 a3_3011;
						word32 a4_3012;
						word32 a5_3013;
						word32 a7_3014;
						word32 s3_3015;
						word32 s11_3017;
						word32 t4_3018;
						ra = printf(ra, &g_t230BF910, a3_464, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0_3008, out a1_3009, out a2_3010, out a3_3011, out a4_3012, out a5_3013, out a7_3014, out s2, out s3_3015, out s4_108, out s5_3016, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_3017, out t4_3018);
						word32 a3_3021;
						word32 a1_3019;
						word32 a2_3020;
						word32 a4_3022;
						a0 = strlen(s0_54, out a1_3019, out a2_3020, out a3_3021, out a4_3022, out a5);
						*((word32) s9_113 + 52) = a0;
						g_b42017458 = 0x00;
						g_b4200F4F5 = 0x00;
					}
l2305E852:
					*s2 = (union Eq_99509 *) 0x00;
					continue;
				}
				else
				{
					int32 a1_711 = (int32) (byte) a4_72;
					g_b4200ECAC = (byte) a1_711;
					if (a1_711 == 91)
						continue;
					Mem716[Mem712[s9_113 + 52:int32] + s0_54:byte] = 0x1B;
					Eq_2 a3_717 = *((word32) s9_113 + 52);
					*((word32) s9_113 + 52) = (word32) a3_717 + 1;
					a3_628 = (word32) s0_54 + ((word32) a3_717 + 1);
					*a3_628 = (byte) a4_72;
					Eq_2 a4_722 = *((word32) s9_113 + 52);
					*((word32) s9_113 + 52) = (word32) a4_722 + 1;
					s1_103 = *((word32) a4_722 + 1);
					if (*((word32) a4_722 + 5) != 0x00)
						goto l2305E852;
					a0_632 = (struct Eq_274 *) &g_t230BF904;
					goto l2305E84E;
				}
			}
			Mem84[Mem71[s9_113 + 52:int32] + s0_54:byte] = SLICE(a4_72, byte, 0);
			Eq_2 a3_413 = 0x08;
			if (a4_72 == (struct Eq_345921 *) 0x08)
			{
l2305EA88:
				Eq_2 a4_403 = *((word32) s9_113 + 52);
				if (a4_403 != 0x00)
				{
					*((word32) s9_113 + 52) = (word32) a4_403 - 1;
					s1_103 = *((word32) a4_403 - 1);
					if (*((word32) a4_403 + 3) == 0x00)
					{
						word32 a1_3023;
						word32 a7_3027;
						word32 s3_3028;
						word32 a2_3024;
						word32 a3_3025;
						word32 s11_3030;
						word32 s5_3029;
						word32 t4_3031;
						word32 a4_3026;
						ra = printf(ra, &g_t230BF93C, a3_413, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0, out a1_3023, out a2_3024, out a3_3025, out a4_3026, out a5, out a7_3027, out s2, out s3_3028, out s4_108, out s5_3029, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_3030, out t4_3031);
					}
				}
				continue;
			}
			a3_413.u0 = 0x007F;
			if (a4_72 == (struct Eq_345921 *) 0x007F)
				goto l2305EA88;
			if (a4_72 == (struct Eq_345921 *) 0x09)
			{
				Mem178[Mem84[s9_113 + 52:int32] + s0_54:byte] = 0x00;
				word32 a2_3034;
				word32 s11_3043;
				word32 t4_3044;
				word32 s10_3042;
				word32 s6_3040;
				word32 s7_3041;
				word32 a1_3033;
				word32 t1_3032;
				word32 a7_3036;
				word32 a5_3035;
				word32 s2_3037;
				word32 s4_3038;
				word32 s5_3039;
				word32 s8_194;
				Eq_2 a3_1331;
				word32 a4_1335;
				struct Eq_347167 * s9_1340;
				Eq_2 s3_1352;
				aos_cli_printf(ra, s8_112 + -0x0700, out t1_3032, out a1_3033, out a2_3034, out a3_1331, out a4_1335, out a5_3035, out a7_3036, out s2_3037, out s3_1352, out s4_3038, out s5_3039, out s6_3040, out s7_3041, out s8_194, out s9_1340, out s10_3042, out s11_3043, out t4_3044);
				int32 s2_1344 = 0x00;
				Eq_2 s6_1337 = 0x00;
				Eq_2 s5_203 = 0x00;
				int32 s10_1346 = 0x01;
				int32 s11_1348 = 0x02;
				while (true)
				{
					s1_103 = *a3_1331;
					Eq_2 a4_211 = a4_1335 + 0x08;
					if (s5_203 >= a4_211)
						break;
					a3_1331 = *((word32) a4_211 + 48);
					if (s6_1337 >= a4_211)
						break;
					word32 a5_3086;
					word32 a2_3085;
					cli_command_get(s5_203, 0x00, a3_1331, out a2_3085, out a4_1335, out a5_3086);
					if (false)
					{
						word32 a5_3087;
						if (strncmp(s0_54, 0x00, s9_1340->t0034, out a3_1331, out a4_1335, out a5_3087) == 0x00)
						{
							++s2_1344;
							a4_1335 = (word32) *dwArg54;
							if (s2_1344 != s10_1346)
							{
								if (s2_1344 == s11_1348)
								{
									word32 a5_3091;
									word32 s4_3093;
									word32 s7_3094;
									word32 t4_3095;
									word32 a7_3092;
									word32 a2_3090;
									word32 t1_3088;
									word32 a1_3089;
									aos_cli_printf(ra, &g_t230BF944, out t1_3088, out a1_3089, out a2_3090, out a3_1331, out a4_1335, out a5_3091, out a7_3092, out s2_1344, out s3_1352, out s4_3093, out s5_203, out s6_1337, out s7_3094, out s8_194, out s9_1340, out s10_1346, out s11_1348, out t4_3095);
								}
								else
								{
									word32 s7_3102;
									word32 t4_3103;
									word32 a2_3098;
									word32 a5_3099;
									word32 s4_3101;
									word32 a7_3100;
									word32 a1_3097;
									word32 t1_3096;
