pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
									aos_cli_printf(ra, &g_t230BF94C, out t1_3096, out a1_3097, out a2_3098, out a3_1331, out a4_1335, out a5_3099, out a7_3100, out s2_1344, out s3_1352, out s4_3101, out s5_203, out s6_1337, out s7_3102, out s8_194, out s9_1340, out s10_1346, out s11_1348, out t4_3103);
								}
							}
							else
								s3_1352 = dwArg54;
						}
						s6_1337 = (word32) s6_1337 + 1;
					}
					s5_203 = (word32) s5_203 + 1;
				}
				if (s2_1344 == 0x01)
				{
					if (s3_1352 != 0x00)
					{
						word32 a1_3045;
						word32 a2_3046;
						word32 a3_3047;
						word32 a5_3049;
						word32 a4_3048;
						Eq_2 a0_334 = strlen(s3_1352, out a1_3045, out a2_3046, out a3_3047, out a4_3048, out a5_3049);
						if (a0_334 <= 0x00FF)
						{
							Eq_2 a4_343 = s9_1340->t0034;
							Eq_2 s2_344 = a0_334 - a4_343;
							word32 a7_3056;
							word32 a5_3054;
							word32 a6_3055;
							word32 a1_3050;
							word32 a2_3051;
							word32 a4_3053;
							word32 a3_3052;
							memcpy(s0_54 + a4_343, s3_1352 + a4_343, s2_344, out a1_3050, out a2_3051, out a3_3052, out a4_3053, out a5_3054, out a6_3055, out a7_3056);
							word32 s2_363 = s2_344 + Mem207[s9_1340 + 52:int32];
							s9_1340->t0034 = (word32) s2_363 + 1;
							Mem368[s2_363 + s0_54:byte] = 0x20;
							Mem371[Mem368[s9_1340 + 52:int32] + s0_54:byte] = 0x00;
						}
					}
				}
				else if (s2_1344 > 0x01)
				{
					word32 s10_3082;
					word32 s11_3083;
					word32 t4_3084;
					word32 a2_3069;
					word32 s8_3080;
					word32 s9_3081;
					word32 a4_3071;
					word32 s4_3076;
					word32 s5_3077;
					word32 s7_3079;
					word32 s6_3078;
					word32 a5_3072;
					word32 a7_3073;
					word32 s3_3075;
					word32 s2_3074;
					word32 a3_3070;
					word32 a1_3068;
					word32 t1_3067;
					aos_cli_printf(ra, s8_194 + -0x0700, out t1_3067, out a1_3068, out a2_3069, out a3_3070, out a4_3071, out a5_3072, out a7_3073, out s2_3074, out s3_3075, out s4_3076, out s5_3077, out s6_3078, out s7_3079, out s8_3080, out s9_3081, out s10_3082, out s11_3083, out t4_3084);
				}
				word32 a2_3059;
				word32 a3_3060;
				word32 a4_3061;
				word32 s3_3063;
				word32 s5_3064;
				word32 s11_3065;
				word32 t4_3066;
				word32 a7_3062;
				word32 t1_3057;
				word32 a1_3058;
				aos_cli_printf(ra, &g_t230BF954, out t1_3057, out a1_3058, out a2_3059, out a3_3060, out a4_3061, out a5, out a7_3062, out s2, out s3_3063, out s4_108, out s5_3064, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_3065, out t4_3066);
				a0 = a0_379;
				continue;
			}
			s1_103 = *(union Eq_2 *) 0x09;
			Eq_2 a3_89 = *(union Eq_2 *) 0x0D;
			if (a3_89 == 0x00)
			{
				word32 a1_3104;
				word32 s11_3111;
				word32 t4_3112;
				word32 a3_3106;
				word32 a4_3107;
				word32 a7_3108;
				word32 s3_3109;
				word32 s5_3110;
				word32 a2_3105;
				ra = printf(ra, &g_t230BED68, a3_89, dwLoc68, s6, dwArg00, dwArg04, dwArg28, dwArg4C, out s1_103, out a0, out a1_3104, out a2_3105, out a3_3106, out a4_3107, out a5, out a7_3108, out s2, out s3_3109, out s4_108, out s5_3110, out s6_110, out s7_111, out s8_112, out s9_113, out s10, out s11_3111, out t4_3112);
			}
			Eq_2 a4_118 = *((word32) s9_113 + 52);
			*((word32) s9_113 + 52) = (word32) a4_118 + 1;
		} while (a4_118 <= ~0xFD);
		word32 t1_3113;
		word32 s4_3122;
		word32 s11_3129;
		word32 t4_3130;
		word32 s6_3124;
		word32 s7_3125;
		word32 s8_3126;
		word32 s9_3127;
		word32 s10_3128;
		word32 s5_3123;
		word32 s2_3120;
		word32 s3_3121;
		word32 a2_3115;
		word32 a3_3116;
		word32 a4_3117;
		word32 a5_3118;
		word32 a7_3119;
		word32 a1_3114;
		aos_cli_printf(ra, &g_t230BF95C, out t1_3113, out a1_3114, out a2_3115, out a3_3116, out a4_3117, out a5_3118, out a7_3119, out s2_3120, out s3_3121, out s4_3122, out s5_3123, out s6_3124, out s7_3125, out s8_3126, out s9_3127, out s10_3128, out s11_3129, out t4_3130);
		struct Eq_347526 * s9_165;
		word32 s5_3140;
		word32 t1_3131;
		word32 s8_3142;
		word32 s11_3143;
		word32 t4_3144;
		word32 s7_3141;
		word32 s3_3138;
		word32 s4_3139;
		word32 a2_3133;
		word32 a3_3134;
		word32 a4_3135;
		word32 a5_3136;
		word32 a7_3137;
		word32 a1_3132;
		aos_cli_printf(ra, &g_t230BF950, out t1_3131, out a1_3132, out a2_3133, out a3_3134, out a4_3135, out a5_3136, out a7_3137, out s2, out s3_3138, out s4_3139, out s5_3140, out s6_110, out s7_3141, out s8_3142, out s9_165, out s10, out s11_3143, out t4_3144);
		s9_165->dw0034 = 0x00;
	}
	else
	{
		a0_1252 = (struct Eq_274 *) &g_t230BF8F4;
l2305E7C4:
		word32 s7_2938;
		word32 t1_2928;
		word32 a3_2931;
		word32 a2_2930;
		word32 a1_2929;
		word32 a4_2932;
		word32 a7_2934;
		word32 s5_2937;
		word32 s3_2935;
		word32 s4_2936;
		word32 a5_2933;
		word32 t4_2942;
		word32 s11_2941;
		word32 s9_2940;
		word32 s8_2939;
		aos_cli_printf(ra, a0_1252, out t1_2928, out a1_2929, out a2_2930, out a3_2931, out a4_2932, out a5_2933, out a7_2934, out s2, out s3_2935, out s4_2936, out s5_2937, out s6_110, out s7_2938, out s8_2939, out s9_2940, out s10, out s11_2941, out t4_2942);
	}
l2305EBEC:
	s1Out = dwLoc64;
	a0Out = a0;
	s2Out = s2;
	s6Out = s6_110;
	s10Out = s10;
	mstatusOut = mstatus;
	return dwLoc24;
}

// 2305EE6C: void console_cb_read(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 Eq_341835) a4, Register Eq_2 s6, Register ptr32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg24, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8)
void console_cb_read(Eq_2 ra, Eq_2 a0, Eq_2 a3, struct Eq_341835 * a4, Eq_2 s6, ptr32 s10, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg24, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8)
{
	int32 a0_13;
	Eq_2 s0_17;
	word32 a1_152;
	Eq_2 ra_21 = aos_read(ra, a0, fp + ~0x1F, a4, dwLoc20, dwArg24, out s0_17, out a0_13, out a1_152);
	if (a0_13 > 0x00)
	{
		if (a0_13 <= 0x10)
		{
			g_t4200F4F8 = s0_17;
			word32 s1_172;
			word32 a0_173;
			word32 s2_174;
			word32 s6_175;
			word32 s10_176;
			word32 mstatus_177;
			cli_main_input(ra_21, s0_17, fp + ~0x1F, 0x4200F000, s6, s10, mstatus, dwLoc20, dwLoc1C, dwLoc04, dwArg08, dwArg2C, dwArg34, dwArg54, dwArg78, dwArg98, dwArgB8, out s1_172, out a0_173, out s2_174, out s6_175, out s10_176, out mstatus_177);
		}
		else
		{
			word32 s1_153;
			word32 a0_154;
			word32 a1_155;
			word32 a2_156;
			word32 a3_157;
			word32 a4_158;
			word32 a5_159;
			word32 a7_160;
			word32 s2_161;
			word32 s3_162;
			word32 s4_163;
			word32 s5_164;
			word32 s6_165;
			word32 s7_166;
			word32 s8_167;
			word32 s9_168;
			word32 s10_169;
			word32 s11_170;
			word32 t4_171;
			printf(ra_21, &g_t230BF9A8, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_153, out a0_154, out a1_155, out a2_156, out a3_157, out a4_158, out a5_159, out a7_160, out s2_161, out s3_162, out s4_163, out s5_164, out s6_165, out s7_166, out s8_167, out s9_168, out s10_169, out s11_170, out t4_171);
		}
	}
}

// 2305EEAC: Register Eq_2 aos_cli_input_direct(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register int32 a5, Register Eq_2 s6, Register ptr32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s6Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      app_delayed_action_bleadv
//      app_delayed_action_bleadvstop
Eq_2 aos_cli_input_direct(Eq_2 ra, Eq_2 s0, Eq_2 a0, int32 a5, Eq_2 s6, ptr32 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s6Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	ptr32 a0_11;
	ptr32 s1_21;
	ptr32 s10_22;
	ptr32 s2_24;
	ptr32 s6_27;
	ptr32 mstatus_36;
	Eq_2 ra_19 = cli_main_input(ra, s0, a0, a5, s6, s10, mstatus, dwArg00, dwArg04, dwArg1C, dwArg28, dwArg4C, dwArg54, dwArg74, dwArg98, dwArgB8, dwArgD8, out s1_21, out a0_11, out s2_24, out s6_27, out s10_22, out mstatus_36);
	s1Out = s1_21;
	a0Out = a0_11;
	s2Out = s2_24;
	s6Out = s6_27;
	s10Out = s10_22;
	mstatusOut = mstatus_36;
	return ra_19;
}

// 2305EEB0: void get_dns_request(Register Eq_2 ra, Register (ptr32 Eq_347692) a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register word32 a4, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack word32 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void get_dns_request(Eq_2 ra, struct Eq_347692 * a0, word32 a1, Eq_2 a2, Eq_2 a3, word32 a4, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, word32 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	uint16 wLoc4C = (uint16) dwLoc4C;
	a0->dw0108 = a1;
	a0->t010C = a3;
	a0->w0110 = (word16) a4;
	Eq_2 a4_101 = (word32) *((word32) a2 + 8);
	Eq_2 s1_117 = a2;
	if (a4_101 > 11)
	{
		Eq_2 s1_43;
		word32 s8_759;
		word32 a3_753;
		word32 a5_755;
		word32 a4_754;
		word32 s2_756;
		word32 s4_758;
		word32 s3_757;
		word32 a0_750;
		word32 a2_752;
		word32 a1_751;
		Eq_2 s0_39 = pbuf_copy_partial(a2, fp + -76, 0x0C, 0x00, out s1_43, out a0_750, out a1_751, out a2_752, out a3_753, out a4_754, out a5_755, out s2_756, out s3_757, out s4_758, out s8_759);
		word32 a5_760;
		*((word32) s0_39 + 0x0100) = (word16) lwip_htons((word32) wLoc4C, out a5_760);
		word32 a5_761;
		*((word32) s0_39 + 258) = (word16) lwip_htons((word32) wLoc48, out a5_761);
		Eq_347911 a2_64 = (word32) *((word32) s1_43 + 8);
		if (a2_64 > 0x00FF)
			a2_64.u0 = 0x00FF;
		word32 a4_765;
		word32 s2_767;
		word32 a5_766;
		word32 s3_768;
		word32 s8_769;
		word32 a0_762;
		word32 a2_764;
		word32 a1_763;
		Eq_2 s0_80 = pbuf_copy_partial(s1_43, s0_39, (word32) (word16) a2_64, 0x0C, out s1_117, out a0_762, out a1_763, out a2_764, out a3, out a4_765, out a5_766, out s2_767, out s3_768, out s4, out s8_769);
		Eq_347943 a5_102;
		if (utils_dns_domain_get(s0_80, s0_80, fp + -80, out a4_101, out a5_102) == 0x00)
		{
			0x00 = dwArg94;
			if (a5_102 > 0x00)
			{
				a5_102 = (word32) a5_102 - 1;
				a3 = (word32) *((word32) s0_80 + ((word32) a5_102 - 1));
				a4_101.u0 = 46;
			}
			0x00 = dwArg94;
			Mem116[a5_102 + s0_80:byte] = 0x00;
		}
	}
	Eq_2 s0_137;
	Eq_2 a3_141;
	Eq_2 a4_142;
	Eq_2 s1_144;
	ptr32 mstatus_158;
	struct Eq_347740 * a0_163;
	struct Eq_347741 * s0_168;
	ptr32 mstatus_179;
	word32 s5_747;
	word32 s8_749;
	word32 s6_748;
	word32 s2_744;
	word32 s4_746;
	word32 s3_745;
	word32 a4_741;
	word32 a7_743;
	word32 a5_742;
	word32 s1_737;
	word32 a1_738;
	word32 a3_740;
	word32 a2_739;
	word32 s5_734;
	word32 s8_736;
	word32 s6_735;
	word32 s4_733;
	word32 s3_732;
	word32 s2_731;
	word32 a7_730;
	word32 a0_726;
	word32 a1_727;
	word32 a5_729;
	word32 a2_728;
	Eq_2 ra_180 = pbuf_alloc(pbuf_free(ra, s1_117, a3, a4_101, s4, mstatus, dwArgD8, out s0_137, out s1_144, out a0_726, out a1_727, out a2_728, out a3_141, out a4_142, out a5_729, out a7_730, out s2_731, out s3_732, out s4_733, out s5_734, out s6_735, out s8_736, out mstatus_158), s0_137, s1_144, 0x00B6, 0x0200, 640, a3_141, a4_142, mstatus_158, dwLoc4C, dwLoc0C, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_168, out s1_737, out a0_163, out a1_738, out a2_739, out a3_740, out a4_741, out a5_742, out a7_743, out s2_744, out s3_745, out s4_746, out s5_747, out s6_748, out s8_749, out mstatus_179);
	if (a0_163 != null)
	{
		word32 a0_771;
		word32 a2_773;
		word32 a1_772;
		word32 a3_774;
		word32 a5_776;
		word32 a4_775;
		word32 t1_770;
		Eq_2 ra_198 = memset(ra_180, fp + -64, 0x00, 0x0C, out t1_770, out a0_771, out a1_772, out a2_773, out a3_774, out a4_775, out a5_776);
		word32 a5_777;
		lwip_htons((word32) s0_168->w0100, out a5_777);
		word32 a5_778;
		lwip_htons(0x08000180, out a5_778);
		word32 a5_779;
		lwip_htons(0x01, out a5_779);
		word32 a5_780;
		lwip_htons(0x01, out a5_780);
		word32 a5_781;
		lwip_htons(0x00, out a5_781);
		word32 a5_782;
		lwip_htons(0x00, out a5_782);
		word32 s8_786;
		word32 a3_783;
		word32 s4_785;
		word32 a4_784;
		byte * s3_245;
		Eq_2 s2_244;
		Eq_2 s1_235;
		Eq_2 s0_234 = pbuf_take(a0_163, fp + -64, 0x0C, out s1_235, out a3_783, out a4_784, out s2_244, out s3_245, out s4_785, out s8_786);
		do
		{
			Eq_2 s3_253 = s3_245 + 1;
			ui32 s4_255 = 0x00;
			s3_256 = s3_253;
			while (true)
			{
				Eq_2 s3_256;
				int32 a5_258 = (word32) *s3_256;
				if (a5_258 == 46 || a5_258 == 0x00)
					break;
				s4_255 = s4_255 + 0x01 & 0x00FF;
				s3_256 = (word32) s3_256 + 1;
			}
			pbuf_put_at(s0_234, s1_235, s2_244, s4_255);
			uint32 s4_320;
			word32 a4_788;
			word32 a3_787;
			word32 s2_789;
			word32 s8_790;
			s0_234 = pbuf_take_at(s1_235, s3_253, (word32) (word16) (s3_256 - s3_253), (word32) (word16) ((word32) s2_244 + 1), dwArgD8, out s1_235, out a3_787, out a4_788, out s2_789, out s3_245, out s4_320, out s8_790);
			s2_244 = (word32) (word16) ((s4_320 >> 0x10) + 1);
		} while ((word32) *s3_245 != 0x00);
		pbuf_put_at(s0_234, s1_235, s2_244, 0x00);
		word32 a5_791;
		lwip_htons(0x01, out a5_791);
		word32 a5_792;
		lwip_htons(0x01, out a5_792);
		word32 a5_793;
		lwip_htons(0x0C00000C, out a5_793);
		word32 a5_794;
		lwip_htons(0x01, out a5_794);
		word32 a5_795;
		lwip_htons(0x01, out a5_795);
		word32 a5_796;
		lwip_htons(0x00, out a5_796);
		word32 a3_797;
		word32 a4_798;
		word32 a5_799;
		Eq_2 a0_364 = lwip_htonl(0x003C0004, out a3_797, out a4_798, out a5_799);
		word32 a4_801;
		word32 a5_802;
		word32 a3_800;
		lwip_htonl(3232278785, out a3_800, out a4_801, out a5_802);
		Eq_2 s3_386;
		Eq_2 a3_389;
		Eq_2 a4_390;
		Eq_2 s1_392;
		Eq_2 s2_395;
		Eq_2 s4_401;
		word32 s8_803;
		Eq_2 s0_385 = pbuf_take_at(s1_235, fp + -52, 0x14, (word32) (word16) ((s4_320 >> 0x10) + 2), dwArgD8, out s1_392, out a3_389, out a4_390, out s2_395, out s3_386, out s4_401, out s8_803);
		word32 a1_822;
		word32 a2_823;
		word32 a0_821;
		word32 a4_825;
		word32 a5_826;
		word32 a3_824;
		word32 s2_828;
		word32 s3_829;
		word32 a7_827;
		word32 s5_831;
		word32 s6_832;
		word32 s4_830;
		word32 mstatus_834;
		word32 s8_833;
		Eq_2 s1_417;
		ptr32 mstatus_423;
		Eq_2 s4_427;
		Eq_2 a3_444;
		Eq_2 a4_445;
		ptr32 mstatus_449;
		Eq_2 s1_452;
		Eq_2 s4_455;
		word32 s9_818;
		word32 s1_820;
		word32 s0_819;
		word32 a2_815;
		word32 s5_817;
		word32 s3_816;
		word32 s8_812;
		word32 a0_814;
		word32 s0_813;
		word32 s3_809;
		word32 s6_811;
		word32 s5_810;
		word32 a5_807;
		word32 s2_808;
		word32 a2_804;
		word32 a4_806;
		word32 a3_805;
		pbuf_free(udp_sendto(pbuf_realloc(ra_198, s0_385, s1_392, (word32) (word16) ((word32) s4_401 + 22), a3_389, a4_390, s2_395, s3_386, s4_401, mstatus_179, a0_364, s5, dwArg78, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0118, out s1_417, out a2_804, out a3_805, out a4_806, out a5_807, out s2_808, out s3_809, out s4_427, out s5_810, out s6_811, out s8_812, out mstatus_423), *((word32) s0_385 + 264), s1_417, *((word32) s0_385 + 268), (word32) *((word32) s0_385 + 272), s4_427, mstatus_423, a0_364, dwLoc28, dwLoc08, dwArg28, dwArg38, dwArg58, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgD8, out s0_813, out s1_452, out a0_814, out a2_815, out a3_444, out a4_445, out s3_816, out s4_455, out s5_817, out s9_818, out mstatus_449), s1_452, a3_444, a4_445, s4_455, mstatus_449, dwArgD8, out s0_819, out s1_820, out a0_821, out a1_822, out a2_823, out a3_824, out a4_825, out a5_826, out a7_827, out s2_828, out s3_829, out s4_830, out s5_831, out s6_832, out s8_833, out mstatus_834);
	}
}

