pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305F0D0: Register Eq_2 dns_server_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a4Out)
// Called from:
//      stateGlobalGuard_AP
Eq_2 dns_server_init(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a4Out)
{
	ptr32 a4_15;
	Eq_2 s1_17;
	word32 a5_142;
	word32 a3_141;
	Eq_2 ra_20 = udp_new(ra, s1, a3, a4, mstatus, out s1_17, out a3_141, out a4_15, out a5_142);
	if (a0 == 0x00)
	{
		a4Out = a4_15;
		return ra_20;
	}
	else
	{
		Eq_2 s0_31 = a0;
		Eq_2 a4_33;
		Eq_2 a5_35;
		Eq_2 a3_34;
		if (udp_bind(a0, 588036828, (union Eq_2 *) 53, out a3_34, out a4_33, out a5_35) == 0x00)
		{
			Eq_2 a0_40;
			word32 s1_143;
			word32 a1_144;
			word32 a2_145;
			word32 a4_146;
			word32 a5_147;
			word32 a6_148;
			word32 s2_149;
			word32 s3_150;
			word32 s4_151;
			word32 s8_152;
			s0_31 = pvPortMalloc(ra_20, s1_17, 0x0114, a3_34, a4_33, a5_35, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_143, out a0_40, out a1_144, out a2_145, out a3_34, out a4_146, out a5_147, out a6_148, out s2_149, out s3_150, out s4_151, out s8_152);
			if (a0_40 != 0x00)
			{
				ptr32 a4_80;
				word32 t1_153;
				word32 a0_154;
				word32 a1_155;
				word32 a2_156;
				word32 a3_157;
				word32 a5_158;
				Eq_2 ra_82 = memset(ra_20, a0_40, 0x00, 0x04, out t1_153, out a0_154, out a1_155, out a2_156, out a3_157, out a4_80, out a5_158);
				udp_recv(s0_31, &g_t2305EEB0, a0_40);
				a4Out = a4_80;
				return ra_82;
			}
		}
		ptr32 a4_70;
		word32 a0_159;
		word32 a2_160;
		word32 a3_161;
		word32 a5_162;
		udp_remove(s0_31, a3_34, mstatus, out a0_159, out a2_160, out a3_161, out a4_70, out a5_162);
		a4Out = a4_70;
		return ra_20;
	}
}

// 2305F136: Register Eq_2 easyflash_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out ptr32 s10Out)
// Called from:
//      aos_loop_proc
Eq_2 easyflash_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, ptr32 & s10Out)
{
	struct Eq_274 * a0_83;
	Eq_348496 a0_19;
	int32 a1_20;
	Eq_2 a3_22;
	Eq_2 ra_27 = ef_port_init(ra, s0, a3, a4, a5, s2, s3, mstatus, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg3C, dwArg48, dwArg64, ra, dwArg78, dwArgB8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out a0_19, out a1_20, out a3_22);
	if (a0_19 == 0x00)
	{
		word32 a0_52;
		ra_27 = ef_env_init(ra_27, a0_19, a1_20, mstatus, 0x00, dwLoc08, dwLoc04, dwArg08, dwArg18, dwArg38, dwArg40, dwArg44, dwArg48, dwArg58, s1, dwArg88, dwArg8C, dwArg98, dwArgD8, out a0_52, out a3_22);
		if (a0_52 == 0x00)
		{
			a0_83 = (struct Eq_274 *) &g_t230BFFCC;
l2305F168:
			Eq_2 a3_99;
			ptr32 s10_129;
			word32 a5_219;
			word32 s2_220;
			word32 a2_217;
			word32 a4_218;
			word32 a0_215;
			word32 a1_216;
			word32 s1_214;
			word32 s3_221;
			word32 s4_222;
			word32 s5_223;
			word32 s6_224;
			word32 s7_225;
			word32 s9_226;
			word32 s10_227;
			word32 s11_228;
			word32 s1_229;
			word32 a0_230;
			word32 a1_231;
			word32 a2_232;
			word32 a3_233;
			word32 a4_234;
			word32 a5_235;
			word32 s2_236;
			word32 s3_237;
			word32 s4_238;
			word32 s5_239;
			word32 s6_240;
			word32 s7_241;
			word32 s9_242;
			word32 s11_243;
			Eq_2 ra_127 = ef_log_info(ef_log_info(ra_27, a0_83, a3_22, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_214, out a0_215, out a1_216, out a2_217, out a3_99, out a4_218, out a5_219, out s2_220, out s3_221, out s4_222, out s5_223, out s6_224, out s7_225, out s9_226, out s10_227, out s11_228), &g_t230C0018, a3_99, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out s2_236, out s3_237, out s4_238, out s5_239, out s6_240, out s7_241, out s9_242, out s10_129, out s11_243);
			s10Out = s10_129;
			return ra_127;
		}
	}
	a0_83 = (struct Eq_274 *) &g_t230BFFF4;
	goto l2305F168;
}

// 2305F192: Register Eq_348667 get_status(Register Eq_348667 a0, Register word32 a1, Register out Eq_348667 a1Out, Register out ptr32 a3Out, Register out Eq_348667 a5Out)
// Called from:
//      read_env
//      read_sector_meta_data
//      del_env
Eq_348667 get_status(Eq_348667 a0, word32 a1, union Eq_348667 & a1Out, ptr32 & a3Out, union Eq_348667 & a5Out)
{
	Eq_348667 a1_13 = a1 + ~0x00;
	while (true)
	{
		Eq_348667 a5_7 = (word32) a1_13.u0 - 1;
		if (a5_7 == ~0x00)
			break;
		a3 = CONVERT(Mem0[a0 + a5_7:byte], byte, word32);
		if (a3 == 0x00)
			break;
		a1_13 = a5_7;
	}
	a1Out = a1_13;
	a3Out = a3;
	a5Out = a5_7;
	return a1_13;
}

// 2305F1B0: Register Eq_348686 update_sector_cache(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_348686 a4Out, Register out (ptr32 Eq_348690) a5Out)
// Called from:
//      update_sec_status
//      format_sector.constprop.16
//      read_sector_meta_data
//      move_env
//      create_env_blob
Eq_348686 update_sector_cache(Eq_2 a0, Eq_2 a1, union Eq_348686 & a4Out, struct Eq_348690 & a5Out)
{
	struct Eq_348691 * a2_13 = g_a42017588;
	Eq_348686 a3_30 = 0x04;
	Eq_348686 a4_22 = 0x00;
	struct Eq_348690 * a5_44 = g_a42017588;
	do
	{
		Eq_2 a7_15 = a2_13->dw0000;
		if (a0 < a1 && a1 < (word32) a0 + 0x01000000)
		{
			if (a0 == a7_15)
			{
				a4_22 <<= 3;
				a5_44 = (word32) a4_22 + 1107391880;
				goto l2305F1DC;
			}
			if (a7_15 == ~0x00 && a3_30 == 0x04)
				a3_30 = a4_22;
		}
		else if (a0 == a7_15)
		{
			ui32 a4_23 = a4_22 << 3;
			*(union Eq_2 *) ~0x00 = a4_23 + 1107391880;
			a4Out.u0 = ~0x00;
			a5Out = a4_23 + 1107391880;
			return a3_30;
		}
		a4_22 = (word32) a4_22 + 1;
		++a2_13;
	} while (a4_22 != 0x04);
	if (a3_30 != a4_22)
	{
		a3_30 <<= 3;
		*a0 = (word32) a3_30 + 1107391880;
		a5_44 = (word32) a3_30 + 1107391880;
l2305F1DC:
		*((word32) a1 + 4) = a5_44;
	}
	a4Out = a4_22;
	a5Out = a5_44;
	return a3_30;
}

// 2305F20C: Register Eq_332972 get_next_sector_addr(Register (ptr32 Eq_348745) a5, Register out Eq_2 a3Out, Register out Eq_332972 a4Out, Register out (ptr32 Eq_348745) a5Out)
// Called from:
//      sector_iterator
//      env_iterator
Eq_332972 get_next_sector_addr(struct Eq_348745 * a5, union Eq_2 & a3Out, union Eq_332972 & a4Out, struct Eq_348745 & a5Out)
{
	Eq_332972 a0_15;
	struct Eq_348750 * a0_5 = a5->ptr0004;
	Eq_332972 a4_18 = g_t4200F504;
	if (a5 != (struct Eq_348745 *) ~0x00)
	{
		ui32 a0_11;
		ui32 a0_10 = a0_5->dw000C;
		if (a0_10 == ~0x00)
			a0_11 = 0x01000000;
		else
			a0_11 = a0_10 << 0x0C;
		a0_15 = a5 + a0_11 / 8;
		a5 = (struct Eq_348745 *) 0x08000000;
		a4_18 = (word32) a4_18 + 0x08000000;
		if (a0_15 >= (word32) a4_18 + 0x08000000)
		{
			a3Out.u0 = <invalid>;
			a4Out = (word32) a4_18 + 0x08000000;
			a5Out = (struct Eq_348745 *) 0x08000000;
			return ~0x00;
		}
	}
	else
		a0_15 = a4_18;
	a3Out.u0 = <invalid>;
	a4Out = a4_18;
	a5Out = a5;
	return a0_15;
}

// 2305F23A: void gc_check_cb(Register (ptr32 byte) a0)
void gc_check_cb(byte * a0)
{
	struct Eq_348779 * a5_5 = (word32) *a0;
	if (a5_5 != null)
		a5_5->dw0001 = a5_5->dw0000;
}

// 2305F24A: Register Eq_2 update_env_cache(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a3Out, Register out (ptr32 Eq_348796) a4Out, Register out (ptr32 Eq_348797) a5Out)
// Called from:
//      find_env
//      del_env
//      move_env
//      create_env_blob
Eq_2 update_env_cache(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a3Out, struct Eq_348796 & a4Out, struct Eq_348797 & a5Out)
{
	word32 a4_146;
	word32 a5_147;
	word32 a2_145;
	struct Eq_348801 * a0_15 = ef_calc_crc32(null, a0, a1, out a2_145, out a4_146, out a5_147);
	struct Eq_348815 * a2_23 = g_a420174F0;
	struct Eq_348796 * a7_101 = (struct Eq_348796 *) 0x0FFFFFFF;
	Eq_2 a6_25 = 0x10;
	Eq_2 a1_119 = 0x10;
	Eq_2 a3_122 = 0x00;
	struct Eq_348797 * a5_129 = g_a420174F0;
	do
	{
		struct Eq_348796 * a4_125 = (word32) a2_23->w0000;
		if (a2 != ~0x00)
		{
			if (a4_125 == a0_15 >> 16)
			{
				a3_122 <<= 3;
				*((word32) a2 + 4) = (word32) a3_122 + 0x420174F0;
				a5_129 = (word32) a3_122 + 0x420174F0;
				goto l2305F28A;
			}
			a2_23 = a4_125->dw0004;
			if (a4_125 == (struct Eq_348796 *) ~0x00)
			{
				if (a1_119 == 0x10)
					a1_119 = a3_122;
			}
			else
			{
				word32 a4_43 = (word32) a2_23->w0002;
				if (a4_43 != 0x00)
					a2_23->w0002 = (word16) (a4_43 + ~0x00);
				a4_125 = (word32) a2_23->w0002;
				if (a4_125 < a7_101)
				{
					a7_101 = a4_125;
					a6_25 = a3_122;
				}
			}
		}
		else if (a4_125 == a0_15 >> 16)
		{
			a3_122 <<= 3;
			*((word32) a2 + 4) = (word32) a3_122 + 0x420174F0;
			a5_129 = (word32) a3_122 + 0x420174F0;
			goto l2305F2DA;
		}
		a3_122 = (word32) a3_122 + 1;
		++a2_23;
	} while (a3_122 != 0x10);
	if (a1_119 != a3_122)
	{
		a1_119 <<= 3;
		a5_129 = (word32) a1_119 + 0x420174F0;
	}
	else
	{
		if (a6_25 == a1_119)
			goto l2305F28A;
		a5_129 = (a6_25 << 3) + 0x420174F0;
	}
	*((word32) a2 + 4) = a5_129;
	a5_129->w0000 = (word16) (a0_15 >> 16);
l2305F2DA:
	a5_129->w0002 = 0x00;
l2305F28A:
	a3Out = a3_122;
	a4Out = a4_125;
	a5Out = a5_129;
	return a1_119;
}

// 2305F2EA: void find_env_cb(Register (ptr32 Eq_348908) a0, Register Eq_2 a1, Register (ptr32 byte) a2, Stack Eq_2 dwArg44)
void find_env_cb(struct Eq_348908 * a0, Eq_2 a1, byte * a2, Eq_2 dwArg44)
{
	Eq_2 a1_23;
	word32 a4_95;
	word32 a5_96;
	word32 a2_93;
	word32 a3_94;
	if (dwArg44 != strlen(a1, out a1_23, out a2_93, out a3_94, out a4_95, out a5_96) || ((word32) a0->b0001 == 0x00 || (word32) a0->b0000 != 0x02))
		return;
	word32 a3_97;
	word32 a4_98;
	word32 a5_99;
	if (strncmp(&a0->b0001 + 0x0F, a1_23, dwArg44, out a3_97, out a4_98, out a5_99) != 0x00)
		return;
	*a2 = 0x01;
}

