pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305F33C: void sector_statistics_cb(Register (ptr32 Eq_348953) a0)
void sector_statistics_cb(struct Eq_348953 * a0)
{
	if ((word32) a0->b0000 != 0x00)
	{
		struct Eq_348960 * a5_6 = (word32) a0->b0001;
		if (a5_6 == (struct Eq_348960 *) 0x01)
			a5_6->dw0001 = a5_6->dw0000;
		else if (a5_6 == (struct Eq_348960 *) 0x02)
			a5_6->dw0001 = a5_6->dw0000;
	}
}

// 2305F364: void alloc_env_cb(Register (ptr32 byte) a0, Register word32 a2, Register (ptr32 Eq_348983) a3, Register (ptr32 Eq_348983) a4)
void alloc_env_cb(byte * a0, word32 a2, struct Eq_348983 * a3, struct Eq_348983 * a4)
{
	if ((word32) *a0 == 0x00)
		return;
	struct Eq_348991 * a0_7 = a3->ptr0010;
	if (a4 >= a3)
		return;
	word32 * a4_10 = (word32) a0_7->b0002;
	if (a4_10 != (word32 *) 0x01)
	{
		if (a4_10 != (word32 *) 0x02)
			return;
		a4_10 = (word32) g_b4200F508;
		if (a4_10 != null)
			return;
	}
	*a4_10 = a2;
}

// 2305F398: Register Eq_2 write_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register uint32 a2, Register uint32 a3, Register Eq_2 s2, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_349028) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 byte) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      read_env
//      update_sec_status
//      del_env
//      move_env
//      check_and_recovery_env_cb
//      do_gc
//      create_env_blob
Eq_2 write_status(Eq_2 ra, Eq_2 a0, Eq_2 a1, uint32 a2, uint32 a3, Eq_2 s2, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, struct Eq_349028 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, byte & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	if (a3 < a2)
	{
		if (a1 != 0x00)
		{
			word32 a3_25;
			word32 t1_171;
			word32 a0_172;
			word32 a1_173;
			word32 a2_174;
			word32 a4_175;
			word32 a5_176;
			Eq_2 ra_28 = memset(ra, a1, 0x00FF, (a2 << 3) + ~0x00 >> 3, out t1_171, out a0_172, out a1_173, out a2_174, out a3_25, out a4_175, out a5_176);
			Eq_2 a1_34 = (word32) a1 + (a3_25 + ~0x00);
			*a1_34 = 0x00;
			Eq_332972 a0_38 = (word32) a0 + (a3_25 + ~0x00);
			ptr32 a0_42;
			ptr32 a1_43;
			ptr32 a3_45;
			ptr32 a4_46;
			ptr32 a5_47;
			struct Eq_349028 * s0_51;
			ptr32 s1_52;
			ptr32 s10_53;
			ptr32 s11_54;
			byte * s2_55;
			ptr32 s3_56;
			ptr32 s4_57;
			ptr32 s6_59;
			ptr32 s7_60;
			word32 s5_187;
			Eq_2 ra_50 = ef_port_write(ra_28, a0, a0_38, a1_34, 0x01, s2, dwArg00, dwArg04, dwArg28, dwArg4C, out s0_51, out s1_52, out a0_42, out a1_43, out a3_45, out a4_46, out a5_47, out s2_55, out s3_56, out s4_57, out s5_187, out s6_59, out s7_60, out s10_53, out s11_54);
			s0Out = s0_51;
			s1Out = s1_52;
			a0Out = a0_42;
			a1Out = a1_43;
			a3Out = a3_45;
			a4Out = a4_46;
			a5Out = a5_47;
			s2Out = s2_55;
			s3Out = s3_56;
			s4Out = s4_57;
			s6Out = s6_59;
			s7Out = s7_60;
			s10Out = s10_53;
			s11Out = s11_54;
			return ra_50;
		}
		else
		{
			word32 s1_177;
			word32 a0_178;
			word32 a1_179;
			word32 a3_180;
			word32 a4_181;
			word32 s2_182;
			word32 s3_183;
			word32 s4_184;
			word32 s5_185;
			word32 s6_186;
			ef_log_debug(ra, &g_t230C0664, 0x230C06D0, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_177, out a0_178, out a1_179, out a3_180, out a4_181, out s2_182, out s3_183, out s4_184, out s5_185, out s6_186);
			while (true)
				;
		}
	}
	else
	{
		word32 s1_161;
		word32 a0_162;
		word32 a1_163;
		word32 a3_164;
		word32 a4_165;
		word32 s2_166;
		word32 s3_167;
		word32 s4_168;
		word32 s5_169;
		word32 s6_170;
		ef_log_debug(ra, &g_t230C0664, 587990600, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_161, out a0_162, out a1_163, out a3_164, out a4_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170);
		while (true)
			;
	}
}

// 2305F42E: Register Eq_2 read_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg84, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_349221) a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      read_sector_meta_data
//      env_iterator
//      find_env
//      do_gc
Eq_2 read_env(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg5C, Eq_2 dwArg84, union Eq_2 & s0Out, ptr32 & a3Out, struct Eq_349221 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 a5_104;
	word32 a4_365;
	word32 a1_363;
	word32 a3_364;
	word32 a0_362;
	Eq_2 ra_103 = ef_port_read(ra, *((word32) a0 + 80), fp + -92, 0x1C, out a0_362, out a1_363, out a3_364, out a4_365);
	Eq_2 a3_32;
	struct Eq_349259 * a5_34;
	word32 a1_366;
	ui32 a0_30 = get_status(fp + -92, 0x06, out a1_366, out a3_32, out a5_34);
	*a0 = (byte) (a0_30 & 0x00FF);
	a5_34->t0008 = a0;
	Eq_2 s0_17 = a0;
	struct Eq_348801 * a0_36 = a0_30 & 0x00FF;
	word32 s2_191 = a5_34 + -20;
	struct Eq_349221 * a4_101 = (struct Eq_349221 *) 0x07FFFFEC;
	if (a5_34 > (struct Eq_349259 *) 0xF8000000)
	{
		*(union Eq_2 *) 0x24 = a0;
		a5_104.u0 = 0x05;
		if ((a0_30 & 0x00FF) != 0x05)
		{
			**((word32) a3_32 + 80) = 0x05;
			word32 a1_368;
			Eq_2 a0_152;
			Eq_2 s2_163;
			word32 s1_367;
			word32 a3_369;
			word32 a4_370;
			word32 s4_372;
			word32 s3_371;
			word32 s5_373;
			word32 s6_374;
			word32 s1_375;
			word32 a0_376;
			word32 a1_377;
			word32 a3_378;
			ra_103 = write_status(ef_log_debug(ra_103, &g_t230C05E8, a3_32, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_367, out a0_152, out a1_368, out a3_369, out a4_370, out s2_163, out s3_371, out s4_372, out s5_373, out s6_374), a0_152, fp + -92, 0x06, 0x05, s2_163, dwLoc60, dwLoc5C, dwLoc58, s2, dwLoc14, dwLoc10, dwLoc0C, dwArg18, dwArg3C, out s0_17, out s1_375, out a0_376, out a1_377, out a3_378, out a4_101, out a5_104, out s2_191, out s3, out s4, out s6, out s7, out s10, out s11);
		}
	}
	else
	{
		a5_104 = (char *) a5_34 - 0x00FFFFED;
		a4_101 = (struct Eq_349221 *) 0x07000012;
		if (a5_34 <= (struct Eq_349259 *) 0xF8000001)
		{
			word32 s1_379;
			word32 a0_380;
			word32 a1_381;
			word32 a3_382;
			word32 a4_383;
			word32 s2_384;
			word32 s3_385;
			word32 s4_386;
			word32 s5_387;
			word32 s6_388;
			ef_log_debug(ra_103, &g_t230C0664, 587899788, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_379, out a0_380, out a1_381, out a3_382, out a4_383, out s2_384, out s3_385, out s4_386, out s5_387, out s6_388);
			while (true)
				;
		}
		struct Eq_349372 * s1_47;
		struct Eq_348801 * s4_48 = null;
		for (s1_47 = null; s1_47 <u a5_34 + -20; s1_47 += s3)
		{
			s3.u0 = 32;
			if (s1_47 + 32 >=u a5_34 + -20)
				s3 = a5_34 + -20 - s1_47;
			s0_17 = a0_36->t0050;
			word32 a0_392;
			word32 a1_393;
			word32 a3_394;
			word32 a4_395;
			ra_103 = ef_port_read(ra_103, a0_36 + 0x14 + s1_47, fp + -64, s3, out a0_392, out a1_393, out a3_394, out a4_395);
			word32 a2_396;
			a0_36 = ef_calc_crc32(s4_48, fp + -64, s3, out a2_396, out a4_101, out a5_104);
			s4_48 = a0_36;
		}
		s4 = dwArg84;
		if (a5_104 == dwArg84)
		{
			s0_17 = s1_47->t0050;
			*((word32) s0_17 + 1) = 0x01;
			Eq_2 s1_93 = (char *) &s1_47->t0008 + 20;
			a5_104 = (word32) bLoc48;
			word32 a0_389;
			word32 a1_390;
			word32 a3_391;
			ra_103 = ef_port_read(ra_103, s1_93, (word32) s0_17 + 16, (word32) bLoc48, out a0_389, out a1_390, out a3_391, out a4_101);
			Mem108[s1_93 + a5_104 + 84:word32] = s0_17;
			a4_101->t000C = s0_17;
			*((word32) s0_17 + 2) = (byte) a5_104;
l2305F4A2:
			s0Out = s0_17;
			a3Out = dwArg08;
			a4Out = a4_101;
			a5Out = a5_104;
			s2Out = s2_191;
			s3Out = s3;
			s4Out = s4;
			s6Out = s6;
			s7Out = s7;
			s10Out = s10;
			s11Out = s11;
			return ra_103;
		}
	}
	*((word32) s0_17 + 1) = 0x00;
	goto l2305F4A2;
}

// 2305F552: Register Eq_2 update_sec_status(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 byte) a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Register out (ptr32 byte) s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_349488 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      move_env
//      create_env_blob
Eq_2 update_sec_status(Eq_2 ra, Eq_2 a0, Eq_2 a1, byte * a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, byte & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_349488 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	Eq_2 s2_106;
	Eq_349488 a4_13 = (word32) *((word32) a0 + 1);
	if (a4_13 == 0x01)
	{
		Eq_2 a0_79;
		word32 s0_190;
		word32 a5_191;
		word32 s2_192;
		word32 s4_193;
		word32 s7_194;
		word32 s10_195;
		word32 s11_196;
		ra = write_status(ra, *((word32) a0 + 4), fp + ~0x13, 0x04, 0x02, s2, dwLoc20, dwLoc1C, s2, dwArg08, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_190, out s1, out a0_79, out a1, out a3, out a4_13, out a5_191, out s2_192, out s3, out s4_193, out s6, out s7_194, out s10_195, out s11_196);
		s2_106 = a0_79;
	}
	else
	{
		s2_106.u0 = 0x00;
		if (a4_13 == 0x02)
		{
			Eq_2 a0_18 = *(union Eq_2 *) 0x12;
			a4_13.u0 = 91;
			s1 = a2;
			if (false && 0x02 - a1 > 91)
			{
				if (a2 != null)
					*a2 = 0x00;
			}
			else
			{
				Eq_2 a0_34;
				word32 s0_197;
				word32 a1_198;
				word32 a3_199;
				word32 a4_200;
				word32 a5_201;
				word32 s2_202;
				word32 s4_203;
				word32 s7_204;
				word32 s10_205;
				word32 s11_206;
				ra = write_status(ra, a0_18, fp + ~0x13, 0x04, 0x03, 0x00, dwLoc20, dwLoc1C, s2, dwArg08, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_197, out s1, out a0_34, out a1_198, out a3_199, out a4_200, out a5_201, out s2_202, out s3, out s4_203, out s6, out s7_204, out s10_205, out s11_206);
				s2_106 = a0_34;
				a1 = (word32) a0_34 + 0x01000000;
				word32 a5_207;
				a3 = update_sector_cache(a0_34, (word32) a0_34 + 0x01000000, out a4_13, out a5_207);
				if (s1 != null)
					*s1 = 0x01;
			}
		}
	}
	s1Out = s1;
	a0Out = s2_106;
	a1Out = a1;
	a3Out = a3;
	a4Out = a4_13;
	s2Out = s2_106;
	s3Out = s3;
	s6Out = s6;
	return ra;
}

