pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305FB02: Register Eq_2 alloc_env(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      new_env
//      move_env
Eq_2 alloc_env(Eq_2 ra, Eq_2 a0, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	word32 s0_278;
	word32 s4_279;
	up32 a5_31;
	ptr32 s5_121;
	ptr32 s3_119;
	Eq_2 s2_118;
	ptr32 s1_115;
	ptr32 a4_111;
	Eq_2 a3_110;
	ptr32 a1_108;
	ptr32 a0_107;
	ptr32 s6_122;
	Eq_2 ra_106 = sector_iterator(ra, a0, dwArgF8, out s0_278, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out a5_31, out s2_118, out s3_119, out s4_279, out s5_121, out s6_122);
	if (a5_31 != 0x00)
	{
		word32 s0_280;
		word32 s4_281;
		ra_106 = sector_iterator(ra_106, s2_118, dwArgF8, out s0_280, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out a5_31, out s2_118, out s3_119, out s4_281, out s5_121, out s6_122);
	}
	if (a5_31 != 0x00)
	{
		a4_111 = ~0x00;
		if (a3_110 == ~0x00)
		{
			if (a5_31 <= 0x01 && (word32) g_b4200F508 == 0x00)
			{
				word32 s4_285;
				ra_106 = ef_log_debug(ra_106, &g_t230C00C8, a3_110, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out s2_118, out s3_119, out s4_285, out s5_121, out s6_122);
				g_b4200F508 = (byte) s1_115;
			}
			else
			{
				word32 s0_282;
				word32 a5_283;
				word32 s4_284;
				ra_106 = sector_iterator(ra_106, s2_118, dwArgF8, out s0_282, out s1_115, out a0_107, out a1_108, out a3_110, out a4_111, out a5_283, out s2_118, out s3_119, out s4_284, out s5_121, out s6_122);
			}
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_115;
	a0Out = a0_107;
	a1Out = a1_108;
	a3Out = a3_110;
	a4Out = a4_111;
	s2Out = s2_118;
	s3Out = s3_119;
	s4Out = dwArg14;
	s5Out = s5_121;
	s6Out = s6_122;
	return ra_106;
}

// 2305FBA8: Register Eq_2 gc_collect(Register Eq_2 ra, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      new_env
//      check_and_recovery_gc_cb
//      ef_set_env
//      ef_load_env
Eq_2 gc_collect(Eq_2 ra, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 a3_17;
	word32 s0_157;
	word32 s1_158;
	word32 a0_159;
	word32 a1_160;
	word32 a4_161;
	word32 a5_162;
	word32 s2_163;
	word32 s3_164;
	word32 s4_165;
	word32 s5_166;
	word32 s6_167;
	word32 a0_168;
	word32 a1_169;
	word32 a3_170;
	word32 s3_171;
	word32 s5_172;
	word32 s6_173;
	ptr32 a4_130;
	ptr32 s1_135;
	ptr32 s2_138;
	ptr32 s4_140;
	Eq_2 ra_133 = ef_log_debug(sector_iterator(ra, fp + -40, dwArgF8, out s0_157, out s1_158, out a0_159, out a1_160, out a3_17, out a4_161, out a5_162, out s2_163, out s3_164, out s4_165, out s5_166, out s6_167), &g_t230C0510, a3_17, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_135, out a0_168, out a1_169, out a3_170, out a4_130, out s2_138, out s3_171, out s4_140, out s5_172, out s6_173);
	if (a4_130 <= 0x01)
	{
		word32 s0_174;
		word32 a0_175;
		word32 a1_176;
		word32 a3_177;
		word32 a5_178;
		word32 s3_179;
		word32 s5_180;
		word32 s6_181;
		ra_133 = sector_iterator(ra_133, fp + -40, dwArgF8, out s0_174, out s1_135, out a0_175, out a1_176, out a3_177, out a4_130, out a5_178, out s2_138, out s3_179, out s4_140, out s5_180, out s6_181);
	}
	g_b4200F508 = 0x00;
	s1Out = s1_135;
	a4Out = a4_130;
	s2Out = s2_138;
	s4Out = s4_140;
	return ra_133;
}

// 2305FC0C: Register Eq_2 new_env(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      create_env_blob
//      ef_set_env
Eq_2 new_env(Eq_2 ra, Eq_2 a0, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	Eq_2 s0_23;
	ptr32 a3_106;
	ptr32 a1_104;
	ptr32 a0_103;
	ptr32 a4_107;
	ptr32 s1_113;
	ptr32 s2_116;
	ptr32 s3_117;
	ptr32 s4_118;
	ptr32 s5_119;
	ptr32 s6_120;
	Eq_2 ra_111 = alloc_env(ra, a0, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118, out s0_23, out s1_113, out a0_103, out a1_104, out a3_106, out a4_107, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120);
	if (a0_103 == ~0x00 && (word32) g_b4200F508 != 0x00)
	{
		Eq_2 s1_83;
		word32 s1_192;
		word32 a0_193;
		word32 a1_194;
		word32 a3_195;
		word32 a4_196;
		word32 s2_197;
		word32 s3_198;
		word32 s4_199;
		word32 s5_200;
		word32 s6_201;
		word32 a4_202;
		word32 s2_203;
		word32 s4_204;
		word32 s0_205;
		ra_111 = alloc_env(gc_collect(ef_log_debug(ra_111, &g_t230C0578, s0_23, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_192, out a0_193, out a1_194, out a3_195, out a4_196, out s2_197, out s3_198, out s4_199, out s5_200, out s6_201), dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, out s1_83, out a4_202, out s2_203, out s4_204), s1_83, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118, out s0_205, out s1_113, out a0_103, out a1_104, out a3_106, out a4_107, out s2_116, out s3_117, out s4_118, out s5_119, out s6_120);
	}
	s1Out = s1_113;
	a0Out = a0_103;
	a1Out = a1_104;
	a3Out = a3_106;
	a4Out = a4_107;
	s2Out = s2_116;
	s3Out = s3_117;
	s4Out = s4_118;
	s5Out = s5_119;
	s6Out = s6_120;
	return ra_111;
}

// 2305FC5C: void check_and_recovery_gc_cb(Register Eq_2 ra, Register (ptr32 Eq_351037) a0, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgE8)
void check_and_recovery_gc_cb(Eq_2 ra, struct Eq_351037 * a0, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArgE8)
{
	if ((word32) a0->b0000 == 0x00 || (word32) a0->b0002 != 0x03)
		return;
	g_b4200F508 = 0x01;
	word32 s4_138;
	word32 s2_137;
	word32 a4_136;
	word32 s1_135;
	gc_collect(ra, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, out s1_135, out a4_136, out s2_137, out s4_138);
}

// 2305FC8A: Register Eq_2 env_iterator(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register (ptr32 Eq_351071) s4, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_348745) s5Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      find_env
//      move_env
//      ef_load_env
//      psm_dump_cmd
Eq_2 env_iterator(Eq_2 ra, Eq_2 a0, Eq_2 s2, struct Eq_351071 * s4, Eq_2 dwArg1C, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_348745 & s5Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_348745 * a5_32 = (struct Eq_348745 *) ~0x00;
	Eq_2 s0_20 = a0;
	ptr32 s2_142 = a1;
	ptr32 s3_143 = a2;
	Eq_2 s1_28 = ~0x00;
	struct Eq_348745 * s5_145 = (struct Eq_348745 *) 0x01;
	do
	{
l2305FCAA:
		ptr32 a4_135;
		ptr32 a5_136;
		ptr32 a3_134;
		Eq_2 a0_33 = get_next_sector_addr(a5_32, out a3_134, out a4_135, out a5_136);
		if (a0_33 == s1_28)
			goto l2305FCEC;
		word32 a0_43;
		word32 a1_297;
		word32 a3_298;
		word32 a4_299;
		word32 s4_300;
		word32 s6_301;
		word32 s7_302;
		ra = read_sector_meta_data(ra, s0_20, a0_33, fp + -56, 0x00, dwArg98, dwArgD8, out s0_20, out s1_28, out a0_43, out a1_297, out a3_298, out a4_299, out a5_32, out s2_142, out s3_143, out s4_300, out s5_145, out s6_301, out s7_302, out s10, out s11);
		if (a0_43 != 0x00)
			continue;
		a5_32 = (word32) bLoc37 + ~0x01 & 0x00FF;
	} while (s5_145 < a5_32);
	*((word32) s1_28 + 80) = s0_20;
	do
	{
		Eq_2 a0_81;
		word32 a1_311;
		ra = get_next_env_addr(ra, fp + -56, dwArg0158, out s0_20, out s1_28, out a0_81, out a1_311, out a5_32, out s2_142, out s3_143, out s5_145);
		*((word32) a0_81 + 80) = s0_20;
		if (a0_81 == s1_28)
			goto l2305FCAA;
		word32 s0_110;
		word32 s2_112;
		<anonymous> * s4_114;
		word32 a0_131;
		s4_114();
	} while (a0_131 == 0x00);
l2305FCEC:
	s0Out = dwArg0158;
	a3Out = a3_134;
	a4Out = a4_135;
	a5Out = a5_136;
	s2Out = s2_142;
	s3Out = s3_143;
	s5Out = s5_145;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 2305FCFE: Register Eq_2 find_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgE8, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_351185) s3Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      del_env
//      ef_get_env_blob
//      ef_set_env
Eq_2 find_env(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgE8, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, struct Eq_351185 & s3Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	word32 a2_342;
	word32 a4_344;
	word32 a5_345;
	word32 a3_343;
	word32 a1_341;
	Eq_2 a0_28 = strlen(a0, out a1_341, out a2_342, out a3_343, out a4_344, out a5_345);
	word32 a2_346;
	word32 a5_348;
	word32 a4_347;
	struct Eq_348801 * a0_39 = ef_calc_crc32(null, a0, a0_28, out a2_346, out a4_347, out a5_348);
	struct Eq_351071 * s4_44 = g_a420174F0;
	ui32 s0_46;
	for (s0_46 = 0x00; s0_46 != 0x10; ++s0_46)
	{
		ptr32 a5_105;
		ptr32 a4_104;
		ptr32 s10_119;
		Eq_2 s2_109;
		ptr32 s11_120;
		struct Eq_351185 * s3_110;
		ptr32 s0_129;
		int32 a0_52 = s4_44->dw0004;
		if (a0_52 != ~0x00 && (word32) s4_44->w0000 == a0_39 >> 0x10)
		{
			word32 a1_350;
			word32 a3_351;
			word32 a4_352;
			word32 a0_349;
			ra = ef_port_read(ra, a0_52 + 0x1C, fp + -112, 64, out a0_349, out a1_350, out a3_351, out a4_352);
			Eq_2 a4_76;
			word32 a3_353;
			word32 a5_354;
			if (strncmp(a0, fp + -112, a0_28, out a3_353, out a4_76, out a5_354) == 0x00)
			{
				struct Eq_351257 * a5_144 = *((word32) a4_76 + 4);
				*((word32) a1 + 80) = a4_76;
				struct Eq_351264 * s0_143 = s0_46 << 3;
				up32 a4_146 = (word32) a5_144->w0002;
				word32 a5_149 = 0x0FFFFFFF;
				if (a4_146 <= 0x0FFFFFEE)
					a5_149 = (word32) (word16) (a4_146 + 16);
				s0_143->w420174F2 = (word16) a5_149;
				word32 s7_359;
				word32 a3_356;
				word32 s4_357;
				word32 s6_358;
				word32 s0_355;
				read_env(ra, a1, a0, dwLoc60, dwLoc5C, dwLoc58, dwLoc38, dwLoc34, dwLoc14, dwArg14, out s0_355, out a3_356, out a4_104, out a5_105, out s2_109, out s3_110, out s4_357, out s6_358, out s7_359, out s10_119, out s11_120);
				s0_129 = 0x01;
				goto l2305FD98;
			}
		}
		++s4_44;
	}
	Eq_2 s5_112;
	word32 s0_360;
	word32 a3_361;
	env_iterator(ra, a1, a0, s4_44, dwLoc54, dwArg28, dwArg68, dwArgE8, out s0_360, out a3_361, out a4_104, out a5_105, out s2_109, out s3_110, out s5_112, out s10_119, out s11_120);
	s0_129 = 0x00;
	if (false)
	{
		word32 a3_362;
		update_env_cache(s2_109, s5_112, s3_110->t0050, out a3_362, out a4_104, out a5_105);
	}
l2305FD98:
	s0Out = s0_129;
	s1Out = dwLoc64;
	a0Out = s0_129;
	a4Out = a4_104;
	a5Out = a5_105;
	s2Out = s2_109;
	s3Out = s3_110;
	s9Out = dwArg18;
	s10Out = s10_119;
	s11Out = s11_120;
	return dwArgE8;
}

// 2305FDE4: Register Eq_2 del_env(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 s3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg58, Register out (ptr32 Eq_351359) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out)
// Called from:
//      move_env
//      ef_del_env
//      ef_set_env
Eq_2 del_env(Eq_2 ra, Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 s3, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg58, struct Eq_351359 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	ptr32 a3_138;
	Eq_2 ra_159;
	struct Eq_351359 * s0_160;
	Eq_2 s3_104;
	Eq_2 s2_103;
	ptr32 s4_105;
	ptr32 s1_118;
	if (a1 == 0x00)
	{
		Eq_2 s3_35;
		word32 s10_420;
		word32 s11_421;
		word32 s2_418;
		word32 s9_419;
		word32 a4_416;
		word32 a5_417;
		word32 s1_415;
		ra = find_env(ra, a0, fp + -0x0078, dwLoc7C, dwLoc68, dwLoc28, dwArg58, out s0_160, out s1_415, out a0, out a4_416, out a5_417, out s2_418, out s3_35, out s9_419, out s10_420, out s11_421);
		if (a0 == 0x00)
		{
			word32 a0_423;
			word32 s1_422;
			word32 a4_425;
			word32 a1_424;
			word32 s5_426;
			word32 s6_427;
			ra_159 = ef_log_debug(ra, &g_t230C0274, s3_35, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_422, out a0_423, out a1_424, out a3_138, out a4_425, out s2_103, out s3_104, out s4_105, out s5_426, out s6_427);
			s1_118 = 0x04;
			goto l2305FE70;
		}
	}
	ui32 a5_117;
	if (a2 == 0x00)
	{
		ptr32 a0_151;
		word32 s1_436;
		word32 a1_437;
		word32 a4_438;
		word32 a5_439;
		word32 s6_440;
		word32 s7_441;
		word32 s10_442;
		word32 s11_443;
		ra_159 = write_status(ra, a0, fp + -0x0080, 0x06, 0x03, 0x4200F50B, dwLoc90, dwLoc8C, dwLoc88, dwLoc68, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s0_160, out s1_436, out a0_151, out a1_437, out a3_138, out a4_438, out a5_439, out s2_103, out s3_104, out s4_105, out s6_440, out s7_441, out s10_442, out s11_443);
		*s2_103 = 0x01;
		a5_117 = 0x01;
		s1_118 = a0_151;
	}
	else
	{
		ptr32 a0_90;
		word32 s1_428;
		word32 a1_429;
		word32 a4_430;
		word32 a5_431;
		word32 s6_432;
		word32 s7_433;
		word32 s11_435;
		word32 s10_434;
		ra_159 = write_status(ra, a0, fp + -0x0080, 0x06, 0x04, 0x4200F50B, dwLoc90, dwLoc8C, dwLoc88, dwLoc68, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s0_160, out s1_428, out a0_90, out a1_429, out a3_138, out a4_430, out a5_431, out s2_103, out s3_104, out s4_105, out s6_432, out s7_433, out s10_434, out s11_435);
		a5_117 = (word32) *s2_103;
		s1_118 = a0_90;
		if (a5_117 == 0x00 && a0_90 == 0x00)
		{
			Eq_2 a0_121;
			Eq_2 a1_120;
			if (s3_104 != 0x00)
			{
				word32 a1_458;
				word32 a2_459;
				word32 a3_460;
				word32 a4_461;
				word32 a5_462;
				a1_120 = strlen(s3_104, out a1_458, out a2_459, out a3_460, out a4_461, out a5_462);
				a0_121 = s3_104;
			}
			else
			{
				a1_120 = (word32) s0_160->b0002;
				a0_121 = (char *) &s0_160->t0008 + 8;
			}
			word32 a4_463;
			update_env_cache(a0_121, a1_120, ~0x00, out a3_138, out a4_463, out a5_117);
		}
		*s2_103 = 0x00;
	}
	if (s1_118 == 0x00)
	{
		ui32 s0_190 = a5_117 & 0xFF000000;
		word32 a0_444;
		word32 a1_445;
		word32 a3_446;
		word32 a4_447;
		ra_159 = ef_port_read(ra_159, s0_190 + 0x03, fp + -0x0080, 0x03, out a0_444, out a1_445, out a3_446, out a4_447);
		s0_160 = s0_190 + 0x03;
		word32 a1_448;
		word32 a5_449;
		if (get_status(fp + -0x0080, 0x04, out a1_448, out a3_138, out a5_449) == 0x01)
		{
			ptr32 a0_220;
			word32 s1_450;
			word32 a1_451;
			word32 a4_452;
			word32 a5_453;
			word32 s6_454;
			word32 s7_455;
			word32 s10_456;
			word32 s11_457;
			ra_159 = write_status(ra_159, s0_190 + 0x03, fp + -0x0080, 0x04, 0x02, s2_103, dwLoc90, dwLoc8C, dwLoc88, dwLoc68, dwLoc44, dwLoc40, dwLoc3C, dwLoc18, dwArg0C, out s0_160, out s1_450, out a0_220, out a1_451, out a3_138, out a4_452, out a5_453, out s2_103, out s3_104, out s4_105, out s6_454, out s7_455, out s10_456, out s11_457);
			s1_118 = a0_220;
		}
	}
l2305FE70:
	s0Out = s0_160;
	s1Out = s1_118;
	a0Out = s1_118;
	a3Out = a3_138;
	a4Out = dwLoc70;
	s2Out = s2_103;
	s3Out = s3_104;
	s4Out = s4_105;
	return ra_159;
}

