pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 2305FEBA: Register Eq_2 move_env(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Register out Eq_2 s0Out, Register out (ptr32 Eq_351071) a0Out, Register out ptr32 a3Out, Register out ptr32 s3Out)
// Called from:
//      check_and_recovery_env_cb
//      do_gc
Eq_2 move_env(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 s2, Eq_2 s3, Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg68, union Eq_2 & s0Out, struct Eq_351071 & a0Out, ptr32 & a3Out, ptr32 & s3Out)
{
	word24 nLocE8_466 = (word24) dwLocE8;
	if ((word32) *a0 == 0x02)
	{
		word32 a3_640;
		word32 a4_641;
		word32 s2_642;
		word32 s4_644;
		word32 s3_643;
		word32 s0_637;
		word32 a0_639;
		word32 s1_638;
		ra = del_env(ra, 0x00, a0, 0x00, s3, dwLocE8, dwLocE4, dwLoc98, out s0_637, out s1_638, out a0_639, out a3_640, out a4_641, out s2_642, out s3_643, out s4_644);
	}
	word32 a0_65;
	word32 s5_635;
	word32 s6_636;
	word32 s3_634;
	word32 s1_631;
	word32 a4_633;
	word32 a1_632;
	Eq_2 s2_136;
	struct Eq_351071 * s4_404;
	ptr32 a3_392;
	Eq_2 s0_134;
	Eq_2 ra_145 = alloc_env(ra, fp + -228, dwLocB0, dwLocAC, s6, dwLoc64, dwArg08, dwArg38, out s0_134, out s1_631, out a0_65, out a1_632, out a3_392, out a4_633, out s2_136, out s3_634, out s4_404, out s5_635, out s6_636);
	if (a0_65 == ~0x00)
	{
l2305FFBC:
		s0Out = s0_134;
		a0Out = s4_404;
		a3Out = a3_392;
		s3Out = dwLoc28;
		return ra_145;
	}
	Eq_2 s3_137;
	if ((word32) g_b4200F509 != 0x00)
	{
		word32 a5_668;
		word32 a0_663;
		word32 a4_667;
		word32 a1_664;
		word32 a3_666;
		word32 a2_665;
		word32 t1_662;
		Eq_2 ra_107 = memset(ra_145, fp + -0x00CC, 0x00, 65, out t1_662, out a0_663, out a1_664, out a2_665, out a3_666, out a4_667, out a5_668);
		word32 a4_671;
		word32 a5_672;
		word32 a2_669;
		word32 a3_670;
		strncpy(fp + -0x00CC, (word32) s0_134 + 16, (word32) *((word32) s0_134 + 2), out a2_669, out a3_670, out a4_671, out a5_672);
		word32 s11_678;
		word32 a5_675;
		word32 s10_677;
		word32 s5_676;
		word32 a3_673;
		word32 a4_674;
		ra_145 = env_iterator(ra_107, fp + -0x0088, s2_136, s4_404, dwLocD4, dwLoc58, dwLoc18, dwArg68, out s0_134, out a3_673, out a4_674, out a5_675, out s2_136, out s3_137, out s5_676, out s10_677, out s11_678);
		dwLocE8 = (uint32) nLocE8_466;
		if (false)
			goto l2305FFB2;
	}
	Eq_2 s2_172;
	Eq_2 s1_181;
	word32 s3_212;
	word32 s4_657;
	word32 s6_658;
	word32 s7_659;
	word32 s11_661;
	word32 s10_660;
	word32 s0_651;
	word32 s2_656;
	word32 a1_652;
	word32 a3_653;
	word32 a5_655;
	word32 a4_654;
	word32 a0_645;
	word32 s6_650;
	word32 a1_646;
	word32 a3_647;
	word32 s3_649;
	word32 a4_648;
	word32 a0_198;
	Eq_2 s1_208;
	Eq_2 ra_206 = write_status(update_sec_status(ra_145, fp + -228, *((word32) s0_134 + 8), null, s2_136, dwLocE8, dwLocC4, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_181, out a0_645, out a1_646, out a3_647, out a4_648, out s2_172, out s3_649, out s6_650), s1_181, fp + -0x00CC, 0x06, 0x01, s2_172, dwLocF0, dwLocEC, dwLocE8, dwLocC8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s0_651, out s1_208, out a0_198, out a1_652, out a3_653, out a4_654, out a5_655, out s2_656, out s3_212, out s4_657, out s6_658, out s7_659, out s10_660, out s11_661);
	Eq_2 s3_225 = s3_212 + ~0x07;
	Eq_2 s2_226 = 0x00;
	word32 s7_228 = (word32) s1_208 + 8;
	while (s2_226 < s3_225)
	{
		Eq_2 s5_232 = 32;
		if ((word32) s2_226 + 32 >= s3_225)
			s5_232 = s3_225 - s2_226;
		word32 s2_276;
		word32 s5_279;
		word32 s11_720;
		word32 s6_718;
		word32 s10_719;
		word32 a5_716;
		word32 s4_717;
		word32 a3_714;
		word32 a4_715;
		word32 s0_712;
		word32 a1_713;
		word32 a3_710;
		word32 a4_711;
		word32 a0_708;
		word32 a1_709;
		ra_206 = ef_port_write(ef_port_read(ra_206, (word32) s2_226 + (a0_198 + 0x08), fp + -0x0088, s5_232, out a0_708, out a1_709, out a3_710, out a4_711), s1_208, (word32) s2_226 + s7_228, fp + -0x0088, s5_232, s2_226, dwLocF0, dwLocEC, dwLocC8, dwLocA4, out s0_712, out s1_208, out a0_198, out a1_713, out a3_714, out a4_715, out a5_716, out s2_276, out s3_225, out s4_717, out s5_279, out s6_718, out s7_228, out s10_719, out s11_720);
		s2_226 = s2_276 + s5_279;
	}
	struct Eq_351857 * a1_297;
	Eq_2 s1_306;
	Eq_2 s6_313;
	word32 s11_694;
	word32 s7_692;
	word32 s10_693;
	word32 s3_690;
	word32 s4_691;
	word32 a5_688;
	word32 s2_689;
	word32 a3_686;
	word32 a4_687;
	word32 s0_684;
	word32 a0_685;
	Eq_2 ra_304 = write_status(ra_206, s1_208, fp + -0x00CC, 0x06, 0x02, s2_226, dwLocF0, dwLocEC, dwLocE8, dwLocC8, dwLocA4, dwLocA0, dwLoc9C, dwLoc78, dwLoc54, out s0_684, out s1_306, out a0_685, out a1_297, out a3_686, out a4_687, out a5_688, out s2_689, out s3_690, out s4_691, out s6_313, out s7_692, out s10_693, out s11_694);
	struct Eq_351892 * s0_323 = a1_297->ptr000C;
	word32 a5_696;
	word32 a4_695;
	update_sector_cache(s1_306 & 0xFF000000, a1_297 + 0x1C + CONVERT(Mem159[s0_323 + 2:byte], byte, word32) + s1_306, out a4_695, out a5_696);
	struct Eq_351912 * a5_346;
	word32 a4_698;
	word32 a3_697;
	update_env_cache(s6_313, (word32) s0_323->b0002, s1_306, out a3_697, out a4_698, out a5_346);
	s0_134 = a5_346->t0050;
	word32 s5_706;
	word32 s6_707;
	word32 s2_704;
	word32 s4_705;
	word32 a3_702;
	word32 a4_703;
	word32 a0_700;
	word32 a1_701;
	word32 s1_699;
	ra_145 = ef_log_debug(ra_304, &g_t230C0548, (word32) *((word32) s0_134 + 2), dwLocE8, dwLocC8, s2, s0, dwLoc58, dwLoc34, out s1_699, out a0_700, out a1_701, out a3_702, out a4_703, out s2_704, out s3_137, out s4_705, out s5_706, out s6_707);
l2305FFB2:
	word32 s2_682;
	word32 s3_683;
	word32 a0_680;
	word32 a4_681;
	word32 s1_679;
	ra_145 = del_env(ra_145, 0x00, s0_134, 0x01, s3_137, dwLocE8, dwLocE4, dwLoc98, out s0_134, out s1_679, out a0_680, out a3_392, out a4_681, out s2_682, out s3_683, out s4_404);
	goto l2305FFBC;
}

// 23060004: void check_and_recovery_env_cb(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C)
void check_and_recovery_env_cb(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C)
{
	word32 a5_13 = (word32) *a0;
	if ((word32) *((word32) a0 + 1) != 0x00 && a5_13 == 0x03)
	{
		Eq_2 s2_72;
		Eq_2 s3_73;
		Eq_2 s6_76;
		word32 a0_84;
		Eq_2 a3_87;
		word32 s3_290;
		word32 s0_289;
		word32 s11_288;
		word32 s10_287;
		word32 s9_286;
		word32 s7_285;
		word32 s5_284;
		word32 s4_283;
		word32 a5_282;
		word32 a4_281;
		word32 a3_280;
		word32 a2_279;
		word32 a1_278;
		word32 a0_277;
		word32 s1_276;
		Eq_2 ra_93 = move_env(ef_log_info(ra, &g_t230C00F8, a3, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_276, out a0_277, out a1_278, out a2_279, out a3_280, out a4_281, out a5_282, out s2_72, out s3_73, out s4_283, out s5_284, out s6_76, out s7_285, out s9_286, out s10_287, out s11_288), a0, a0, s2_72, s3_73, s6_76, dwLoc18, dwArg18, dwArg48, out s0_289, out a0_84, out a3_87, out s3_290);
		if (a0_84 == 0x00)
		{
			word32 s1_301;
			word32 a0_302;
			word32 a1_303;
			word32 a3_304;
			word32 a4_305;
			word32 s2_306;
			word32 s3_307;
			word32 s4_308;
			word32 s5_309;
			word32 s6_310;
			ef_log_debug(ra_93, &g_t230C0144, a3_87, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_301, out a0_302, out a1_303, out a3_304, out a4_305, out s2_306, out s3_307, out s4_308, out s5_309, out s6_310);
		}
		else
		{
			word32 a1_293;
			word32 a3_294;
			word32 a4_295;
			word32 s2_296;
			word32 a0_292;
			word32 s1_291;
			word32 s3_297;
			word32 s4_298;
			word32 s5_299;
			word32 s6_300;
			ef_log_debug(ra_93, &g_t230C0164, a3_87, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_291, out a0_292, out a1_293, out a3_294, out a4_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300);
		}
	}
	else if (a5_13 == 0x01)
	{
		word32 s0_311;
		word32 s1_312;
		word32 a0_313;
		word32 a1_314;
		word32 a3_315;
		word32 a4_316;
		word32 a5_317;
		word32 s2_318;
		word32 s3_319;
		word32 s4_320;
		word32 s6_321;
		word32 s7_322;
		word32 s10_323;
		word32 s11_324;
		write_status(ra, a0, fp + ~0x17, 0x06, 0x05, s2, dwLoc20, dwLoc1C, dwLoc18, dwArg08, dwArg2C, dwArg30, dwArg34, dwArg58, dwArg7C, out s0_311, out s1_312, out a0_313, out a1_314, out a3_315, out a4_316, out a5_317, out s2_318, out s3_319, out s4_320, out s6_321, out s7_322, out s10_323, out s11_324);
	}
}

// 23060090: void do_gc(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_352169) a0, Register Eq_2 s2, Register Eq_2 s4, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg0118)
void do_gc(Eq_2 ra, Eq_2 s0, struct Eq_352169 * a0, Eq_2 s2, Eq_2 s4, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg0118)
{
	byte bLoc78_269 = (byte) dwLoc78;
	if ((word32) a0->b0000 == 0x00 || ((word32) a0->b0002 + ~0x01 & 0x00FF) > 0x01)
		return;
	word32 s11_431;
	word32 s10_430;
	word32 s7_429;
	word32 s6_428;
	word32 s4_427;
	word32 s3_426;
	word32 s2_425;
	word32 a5_424;
	word32 a4_423;
	word32 a3_422;
	word32 a1_421;
	word32 a0_420;
	word32 s1_419;
	Eq_2 s0_131;
	Eq_2 ra_130 = write_status(ra, a0->dw0004 + 0x03, fp + -0x007C, 0x04, 0x03, s2, dwLoc80, dwLoc7C, dwLoc78, dwLoc58, dwLoc34, dwLoc30, dwLoc2C, dwLoc08, dwArg1C, out s0_131, out s1_419, out a0_420, out a1_421, out a3_422, out a4_423, out a5_424, out s2_425, out s3_426, out s4_427, out s6_428, out s7_429, out s10_430, out s11_431);
	while (true)
	{
		Eq_2 dwLoc78_272;
		byte bLoc77_268 = (byte) nLoc77_474;
		Eq_332972 a0_69;
		Eq_332972 s1_78;
		Eq_2 s2_79;
		word32 s0_457;
		word32 a1_458;
		word32 a5_459;
		word32 s3_460;
		word32 s5_461;
		Eq_2 ra_76 = get_next_env_addr(ra_130, s0_131, dwArg0118, out s0_457, out s1_78, out a0_69, out a1_458, out a5_459, out s2_79, out s3_460, out s5_461);
		if (a0_69 == s1_78)
			break;
		Eq_2 s2_100;
		Eq_2 s3_101;
		Eq_2 s6_109;
		word32 s4_435;
		word32 s7_436;
		word32 s10_437;
		word32 s11_438;
		word32 a5_434;
		word32 a4_433;
		word32 a3_432;
		ra_130 = read_env(ra_76, fp + -0x0078, s2_79, dwLoc70, dwLoc6C, dwLoc68, s2, s0, dwLoc24, dwArg04, out s0_131, out a3_432, out a4_433, out a5_434, out s2_100, out s3_101, out s4_435, out s6_109, out s7_436, out s10_437, out s11_438);
		dwLoc78 = nLoc77_474;
		nLoc77_474 = dwLoc78;
		if ((word32) bLoc77_268 != 0x00)
		{
			dwLoc78_272 = SEQ(nLoc77_474, bLoc78_473);
			word16 wLoc78_278 = (word16) dwLoc78_272;
			byte bLoc77_317 = SLICE(wLoc78_278, byte, 8);
			bLoc78_269 = bLoc78_473;
			bLoc78_269 = (byte) wLoc78_278;
			word16 wLoc76_323 = SLICE(dwLoc78_272, word16, 16);
			dwLoc78 = nLoc77_474;
			if (s2_100 >= ((word32) bLoc78_473 + ~0x01 & 0x00FF))
			{
				word32 a0_121;
				word32 s3_136;
				word32 a3_462;
				ra_130 = move_env(ra_130, s0_131, fp + -0x0078, s2_100, s3_101, s6_109, dwLoc78_272, s2, dwLoc18, out s0_131, out a0_121, out a3_462, out s3_136);
				dwLoc78 = SEQ(wLoc76_323, bLoc78_473);
				bLoc78_473 = bLoc78_269;
				if (a0_121 != 0x00)
				{
					word32 s1_463;
					word32 a0_464;
					word32 a1_465;
					word32 a3_466;
					word32 a4_467;
					word32 s2_468;
					word32 s3_469;
					word32 s4_470;
					word32 s5_471;
					word32 s6_472;
					ra_130 = ef_log_debug(ra_130, s3_136 + 656, (word32) bLoc78_473, SEQ(bLoc78_473, bLoc78_473, wLoc78_278), dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_463, out a0_464, out a1_465, out a3_466, out a4_467, out s2_468, out s3_469, out s4_470, out s5_471, out s6_472);
					dwLoc78 = SEQ(SEQ(bLoc78_473, bLoc78_473), bLoc77_317);
				}
			}
		}
	}
	Eq_2 a3_188;
	word32 s1_439;
	word32 a0_440;
	word32 a1_441;
	word32 a4_442;
	word32 s2_443;
	word32 s3_444;
	word32 s4_445;
	word32 s5_446;
	word32 s1_447;
	word32 a0_448;
	word32 a1_449;
	word32 a3_450;
	word32 a4_451;
	word32 s2_452;
	word32 s3_453;
	word32 s4_454;
	word32 s5_455;
	word32 s6_456;
	ef_log_debug(format_sector.constprop.16(ra_76, a0_69, s2_79, dwLoc64, dwLoc50, s4, dwLoc40, dwLoc3C, dwLoc28, dwLoc18, dwLoc04, dwArg0C, out s1_439, out a0_440, out a1_441, out a3_188, out a4_442, out s2_443, out s3_444, out s4_445, out s5_446), &g_t230C02C0, a3_188, dwLoc78_272, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_447, out a0_448, out a1_449, out a3_450, out a4_451, out s2_452, out s3_453, out s4_454, out s5_455, out s6_456);
}

// 23060152: Register Eq_2 create_env_blob(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Register out Eq_2 s1Out, Register out (ptr32 Eq_348801) a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s6Out)
// Called from:
//      ef_set_env
//      ef_env_set_default
Eq_2 create_env_blob(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg7C, Eq_2 dwArgA8, Eq_2 dwArgD8, union Eq_2 & s1Out, struct Eq_348801 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s6Out)
{
	Eq_2 a3_116;
	ptr32 a4_106;
	Eq_2 a1_104;
	Eq_2 ra_102;
	Eq_2 s1_119;
	Eq_2 s3_122;
	ptr32 s6_124;
	struct Eq_348801 * s0_132;
	Eq_2 a0_18 = *((word32) s1 + 20);
	Eq_2 dwLoc40_512 = (uint32) nLoc40;
	word24 nLoc27_493 = SLICE(s2, word24, 8);
	Eq_2 s4_100 = a0_18;
	Eq_2 s2_103 = a1;
	byte bLoc3D_526 = SLICE(dwLoc40_512, byte, 24);
	Eq_2 a3_29;
	word32 a5_624;
	word32 a4_623;
	word32 a1_621;
	word32 a2_622;
	if (strlen(a1, out a1_621, out a2_622, out a3_29, out a4_623, out a5_624) > 64)
	{
		word32 s11_644;
		word32 s10_643;
		word32 s9_642;
		word32 s7_641;
		word32 s5_640;
		word32 s4_639;
		word32 a5_638;
		word32 a2_637;
		word32 a0_636;
		ra_102 = ef_log_info(ra, &g_t230C01F8, a3_29, dwLoc38, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_636, out a1_104, out a2_637, out a3_116, out a4_106, out a5_638, out s2_103, out s3_122, out s4_639, out s5_640, out s6_124, out s7_641, out s9_642, out s10_643, out s11_644);
		s0_132 = (struct Eq_348801 *) 0x04;
		goto l23060190;
	}
	word32 a5_631;
	word32 a4_630;
	word32 a2_628;
	word32 a3_629;
	word32 a1_627;
	word32 a0_626;
	word32 t1_625;
	ra_102 = memset(ra, fp + -60, 0x00FF, 0x1C, out t1_625, out a0_626, out a1_627, out a2_628, out a3_629, out a4_630, out a5_631);
	Eq_2 a3_52;
	word32 a5_635;
	word32 a4_634;
	word32 a2_633;
	word32 a1_632;
	Eq_2 a0_51 = strlen(a1, out a1_632, out a2_633, out a3_52, out a4_634, out a5_635);
	byte bLoc28_481 = (byte) a0_51;
	Eq_2 a1_60 = (word32) a3 + 28 + (a0_51 & 0x00FF);
	Eq_2 dwLoc28_494 = SEQ(nLoc27_493, bLoc28_481);
	if (a1_60 > 0x00FFFFEC)
	{
		word32 a5_647;
		word32 a2_646;
		word32 a0_645;
		word32 s4_648;
		word32 s5_649;
		word32 s7_650;
		word32 s9_651;
		word32 s10_652;
		word32 s11_653;
		ra_102 = ef_log_info(ra_102, &g_t230C0228, a3_52, a1_60, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_645, out a1_104, out a2_646, out a3_116, out a4_106, out a5_647, out s2_103, out s3_122, out s4_648, out s5_649, out s6_124, out s7_650, out s9_651, out s10_652, out s11_653);
		s0_132 = (struct Eq_348801 *) 0x06;
		goto l23060190;
	}
	a1_104 = a1_60;
	if (s1 == ~0x00)
	{
		Eq_2 a0_67;
		Eq_2 s5_82;
		word32 s1_654;
		ra_102 = new_env(ra_102, a0_18, dwLoc28_494, dwLoc10, dwLoc0C, dwArg18, dwArg20, dwArg24, dwArg3C, dwArg48, dwArg6C, dwArgA8, dwArgD8, out s1_654, out a0_67, out a1_104, out a3_116, out a4_106, out s2_103, out s3_122, out s4_100, out s5_82, out s6_124);
		s1_119 = a0_67;
		s0_132 = (struct Eq_348801 *) 0x06;
		if (a0_67 == s5_82)
		{
l23060190:
			s1Out = s1_119;
			a0Out = s0_132;
			a1Out = a1_104;
			a3Out = a3_116;
			a4Out = a4_106;
			s2Out = s2_103;
			s3Out = s3_122;
			s6Out = s6_124;
			return ra_102;
		}
	}
	struct Eq_348801 * a0_105;
	ra_102 = update_sec_status(ra_102, s4_100, a1_104, fp + -61, s2_103, a1_60, dwLoc14, dwLoc10, dwLoc0C, dwArg18, dwArg3C, out s1_119, out a0_105, out a1_104, out a3_116, out a4_106, out s2_103, out s3_122, out s6_124);
	s0_132 = a0_105;
	if (a0_105 == null)
	{
		Eq_2 a2_145;
		word32 a2_655;
		word32 a4_656;
		word32 a5_657;
		word32 a4_658;
		word32 a5_659;
		word32 a2_660;
		word32 a4_661;
		word32 a5_662;
		ef_calc_crc32(ef_calc_crc32(ef_calc_crc32(a0_105, fp + -40, 0x08, out a2_655, out a4_656, out a5_657), s2_103, (word32) bLoc28_481, out a2_145, out a4_658, out a5_659), s3_122, a2_145, out a2_660, out a4_661, out a5_662);
		struct Eq_348801 * a0_161;
		word32 s0_663;
		word32 a5_664;
		word32 s4_665;
		word32 s7_666;
		word32 s10_667;
		word32 s11_668;
		ra_102 = write_status(ra_102, s1_119, fp + -60, 0x06, 0x01, s2_103, dwLoc40_512, dwLoc3C, a1_60, dwLoc18, dwArg0C, dwArg10, dwArg14, dwArg38, ra, out s0_663, out s1_119, out a0_161, out a1_104, out a3_116, out a4_106, out a5_664, out s2_103, out s3_122, out s4_665, out s6_124, out s7_666, out s10_667, out s11_668);
		s0_132 = a0_161;
		if (a0_161 == null)
		{
			struct Eq_348801 * a0_192;
			word32 s0_669;
			word32 a5_670;
			word32 s4_671;
			word32 s5_672;
			word32 s7_673;
			word32 s10_674;
			word32 s11_675;
			ra_102 = ef_port_write(ra_102, s1_119, (word32) s1_119 + 8, fp + -52, 0x14, s2_103, dwLoc40_512, dwLoc3C, dwLoc18, dwArg0C, out s0_669, out s1_119, out a0_192, out a1_104, out a3_116, out a4_106, out a5_670, out s2_103, out s3_122, out s4_671, out s5_672, out s6_124, out s7_673, out s10_674, out s11_675);
			s0_132 = a0_192;
			if (a0_192 == null)
			{
				struct Eq_348801 * a0_236;
				word32 a1_237;
				struct Eq_352708 * s4_251;
				word32 t1_676;
				word32 a0_677;
				word32 a1_678;
				word32 a2_679;
				word32 a3_680;
				word32 a4_681;
				word32 a5_682;
				word32 s0_683;
				word32 a3_684;
				word32 a4_685;
				word32 a5_686;
				word32 s5_687;
				word32 s7_688;
				word32 s10_689;
				word32 s11_690;
				ra_102 = ef_port_write(memset(ra_102, fp + -64, 0x00FF, 0x01, out t1_676, out a0_677, out a1_678, out a2_679, out a3_680, out a4_681, out a5_682), s1_119, (word32) s1_119 + 28, s2_103, (word32) bLoc28_481, s2_103, dwLoc40_512, dwLoc3C, dwLoc18, dwArg0C, out s0_683, out s1_119, out a0_236, out a1_237, out a3_684, out a4_685, out a5_686, out s2_103, out s3_122, out s4_251, out s5_687, out s6_124, out s7_688, out s10_689, out s11_690);
				s0_132 = a0_236;
				if ((word32) bLoc3D_526 == 0x00)
				{
					word32 a4_692;
					word32 a5_693;
					update_sector_cache(s4_251->t0004, (word32) s1_119 + ((a1_237 + 0x1C) + (word32) bLoc28_481), out a4_692, out a5_693);
				}
				word32 a5_691;
				a1_104 = update_env_cache(s2_103, (word32) bLoc28_481, s1_119, out a3_116, out a4_106, out a5_691);
				if (a0_236 == null)
				{
					struct Eq_348801 * a0_318;
					word32 t1_694;
					word32 a0_695;
					word32 a1_696;
					word32 a2_697;
					word32 a3_698;
					word32 a4_699;
					word32 a5_700;
					word32 s0_701;
					word32 a5_702;
					word32 s4_703;
					word32 s5_704;
					word32 s7_705;
					word32 s10_706;
					word32 s11_707;
					ra_102 = ef_port_write(memset(ra_102, fp + -64, 0x00FF, 0x01, out t1_694, out a0_695, out a1_696, out a2_697, out a3_698, out a4_699, out a5_700), s1_119, (word32) s1_119 + ((word32) bLoc28_481 + 0x1C), s3_122, s2_103, s2_103, dwLoc40_512, dwLoc3C, dwLoc18, dwArg0C, out s0_701, out s1_119, out a0_318, out a1_104, out a3_116, out a4_106, out a5_702, out s2_103, out s3_122, out s4_703, out s5_704, out s6_124, out s7_705, out s10_706, out s11_707);
					s0_132 = a0_318;
					if (a0_318 == null)
					{
						struct Eq_348801 * a0_350;
						word32 s0_708;
						word32 a5_709;
						word32 s4_710;
						word32 s7_711;
						word32 s10_712;
						word32 s11_713;
						ra_102 = write_status(ra_102, s1_119, fp + -60, 0x06, 0x02, s2_103, dwLoc40_512, dwLoc3C, a1_60, dwLoc18, dwArg0C, dwArg10, dwArg14, dwArg38, ra, out s0_708, out s1_119, out a0_350, out a1_104, out a3_116, out a4_106, out a5_709, out s2_103, out s3_122, out s4_710, out s6_124, out s7_711, out s10_712, out s11_713);
						s0_132 = a0_350;
						if (a0_350 == null && (word32) bLoc3D_526 != 0x00)
						{
							word32 a0_714;
							word32 a4_715;
							word32 s4_716;
							word32 s5_717;
							ra_102 = ef_log_debug(ra_102, &g_t230C024C, a3_116, a1_60, dwLoc18, dwArg30, dwArg34, s1, dwArg7C, out s1_119, out a0_714, out a1_104, out a3_116, out a4_715, out s2_103, out s3_122, out s4_716, out s5_717, out s6_124);
							g_b4200F508 = 0x01;
							a4_106 = 0x01;
						}
					}
				}
			}
		}
	}
	goto l23060190;
}

