pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0005.c
// 230602FA: Register Eq_2 ef_get_env_blob(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      event_cb_wifi_event
//      ef_get_env
//      psm_test_cmd
Eq_2 ef_get_env_blob(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgC8, Eq_2 dwArg0108, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 s0_119;
	ptr32 s10_203;
	ptr32 s1_120;
	Eq_2 ra_104;
	ptr32 s11_204;
	ptr32 s2_121;
	ptr32 s5_124;
	ptr32 s4_123;
	ptr32 s3_122;
	ptr32 s9_212;
	if ((word32) g_b4200F50A == 0x00)
	{
		word32 a0_412;
		word32 a1_413;
		word32 a4_416;
		word32 a2_414;
		word32 a3_415;
		word32 s6_418;
		word32 s7_419;
		word32 a5_417;
		ra_104 = ef_log_info(ra, &g_t230C043C, a3, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_120, out a0_412, out a1_413, out a2_414, out a3_415, out a4_416, out a5_417, out s2_121, out s3_122, out s4_123, out s5_124, out s6_418, out s7_419, out s9_212, out s10_203, out s11_204);
		s0_119 = 0x00;
		goto l2306031E;
	}
	struct Eq_274 * a0_159;
	if (a0 != 0x00 && a1 != 0x00)
	{
		Eq_2 a3_26;
		Eq_2 a4_27;
		Eq_2 a2_30;
		word32 a1_420;
		word32 a5_421;
		if (strlen(a0, out a1_420, out a2_30, out a3_26, out a4_27, out a5_421) <= 64)
		{
			Eq_2 a0_50;
			Eq_2 a5_55;
			ptr32 s1_60;
			union Eq_2 * s2_63;
			Eq_2 s3_64;
			word32 s0_432;
			word32 s2_429;
			word32 s3_430;
			word32 s4_431;
			word32 a1_426;
			word32 a3_427;
			word32 a4_428;
			word32 s1_424;
			word32 a0_425;
			Eq_2 a4_102;
			ra_104 = find_env(ra, ef_port_env_lock(a2_30, a3_26, a4_27, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, out s1_424, out a0_425, out a1_426, out a3_427, out a4_428, out s2_429, out s3_430, out s4_431), fp + -0x0078, dwLoc7C, dwLoc68, dwLoc28, dwArg58, out s0_432, out s1_60, out a0_50, out a4_102, out a5_55, out s2_63, out s3_64, out s9_212, out s10_203, out s11_204);
			if (a0_50 != 0x00)
			{
				if (s2_63 != null)
					*s2_63 = (union Eq_2 *) a5_55;
				Eq_2 s0_81 = s3_64;
				if (a5_55 < s3_64)
					s0_81 = a5_55;
				word32 a0_451;
				word32 a1_452;
				word32 a3_453;
				ra_104 = ef_port_read(ra_104, a0_50, s1_60, s0_81, out a0_451, out a1_452, out a3_453, out a4_102);
			}
			word32 a3_449;
			word32 a4_450;
			s0_119 = ef_port_env_unlock(a4_102, mstatus, dwLoc88, dwLoc6C, dwArg14, dwArg88, dwArgC8, dwArg0108, out s1_120, out a3_449, out a4_450, out s2_121, out s3_122, out s4_123, out s5_124);
l2306031E:
			s0Out = s0_119;
			s1Out = s1_120;
			a0Out = dwLoc8C;
			s2Out = s2_121;
			s3Out = s3_122;
			s4Out = s4_123;
			s5Out = s5_124;
			s9Out = s9_212;
			s10Out = s10_203;
			s11Out = s11_204;
			return ra_104;
		}
		if (g_t4200F560 != 0x00)
		{
			word32 a5_434;
			xTaskGetTickCountFromISR(out a5_434);
		}
		else
		{
			word32 a5_433;
			xTaskGetTickCount(out a5_433);
		}
		word32 a2_445;
		word32 a1_444;
		word32 a3_446;
		word32 a4_447;
		word32 a5_448;
		strlen(a0, out a1_444, out a2_445, out a3_446, out a4_447, out a5_448);
		a0_159 = (struct Eq_274 *) &g_t230C0414;
	}
	else
	{
		if (g_t4200F560 != 0x00)
		{
			word32 a5_423;
			xTaskGetTickCountFromISR(out a5_423);
		}
		else
		{
			word32 a5_422;
			xTaskGetTickCount(out a5_422);
		}
		a0_159 = (struct Eq_274 *) &g_t230C03E4;
	}
	word32 a2_437;
	word32 a0_435;
	word32 a1_436;
	word32 a4_439;
	word32 a5_440;
	word32 s8_443;
	word32 a3_438;
	word32 s6_441;
	word32 s7_442;
	ra_104 = bl_printk(ra, a0_159, 0x230C03C8, dwLoc88, dwLoc68, dwLoc20, dwLoc1C, dwArg08, s3, out s1_120, out a0_435, out a1_436, out a2_437, out a3_438, out a4_439, out a5_440, out s2_121, out s3_122, out s4_123, out s5_124, out s6_441, out s7_442, out s8_443, out s9_212, out s10_203, out s11_204);
	s0_119 = 0x08;
	goto l2306031E;
}

